window.MARKER_DATABASE = window.MARKER_DATABASE || {};
window.mergeLanguageTexts = function () {
    const text_bundle_en = {
        'KCT.0.steps': {
            1: "அவிதித விஷயாந்தர: சடாரேர் * உபநிஷதாம் உபகாநமாத்ர போக: *** அபி ச குநவசாத் ததேக சேஷீ * மதுரகவி ஹ்ருதயே மமாவிரஸ்து *",
            2: "வேறொன்றும் நான் அறியேன் வேதம் தமிழ் செய்த * மாறன் சடகோபன் வண்குருகூர் ஏறு *** எங்கள் வாழ்வாம் என்றேத்தும் மதுரகவியார் * எம்மை ஆள்வார் க்ஷ்அவரே அரண் *"
        },
        'KCT.1.steps': {
            1: "🙏 கண்ணிநுண் சிறுத் தாம்பினால் * கட்டுண்ணப் பண்ணிய பெரு மாயன் * என்னப்பனில் *** நண்ணித் தென் குருகூர் * நம்பி யென்றக்கால் * அண்ணிக்கும் அமுதூறும் * என் நாவுக்கே. *",
            2: "நாவினால் நவிற்று * இன்ப மெய்தினேன் * மேவினேன் * அவன் பொன்னடி மெய்ம்மையே *** தேவு மற்றறியேன் * குருகூர் நம்பி * பாவினின்னிசை * பாடித் திரிவனே. *",
            3: "திரிதந்தாகிலும் * தேவ பிரானுடை * கரிய கோலத் * திருவுருக்காண்பன் நான் *** பெரியவண் குருகூர் * நகர் நம்பிக்கு ஆள் உரியனாய் * அடியேன் பெற்ற நன்மையே. *",
            4: "நன்மையால் * மிக்க நான்மறையாளர்கள் * புன்மையாகக் * கருதுவர் ஆதலின் *** அன்னையாயத்தனாய் * என்னையாண்டிடும் தன்மையான் * சடகோபனென் நம்பியே. *",
            5: "நம்பினேன் * பிறர் நன் பொருள் தன்னையும் * நம்பினேன் * மடவாரையும் முன்னெல்லாம் *** செம்பொன் மாடத் * திருக்குருகூர் நம்பிக்கன்பனாய் * அடியேஞ் சதிர்த்தேனின்றே. *",
            6: "இன்று தொட்டும் * எழுமையும் எம்பிரான் * நின்று தன் புகழ் * எத்த வருளினான் *** குன்ற மாடத் * திருக்குருகூர் நம்பி * என்றும் என்னை * இகழ்விலன் காண்மினே. *",
            7: "கண்டு கொண்டென்னைக் * காரி மாறப்பிரான் * பண்டை வல்வினை * பாற்றியருளினான் *** எண்டிசையும் * அறிய இயம்புகேன் * ஒண்டமிழ்ச் * சடகோபனருளையே. *",
            8: "அருள் கொண்டாடும் * அடியவரின்புற * அருளினான் * அவ்வருமறையின் பொருள் *** அருள் கொண்டு * ஆயிரமின் தமிழ் பாடினான் * அருள் கண்டீர் * இவ்வுலகினில் மிக்கதே. *",
            9: "மிக்க வேதியர் * வேதத்தினுட் பொருள் * நிற்கப் பாடி * என் நெஞ்சுள் நிறுத்தினான் *** தக்க சீர்ச் * சடகோபனென் நம்பிக்கு * ஆட்புக்க காதல் * அடிமைப் பயனன்றே. *",
            10: "🙏 பயனன்றாகிலும் * பாங்கலராகிலும் * செயல் நன்றாகத் * திருத்திப் பணிகொள்வான் *** குயில் நின்றார்ப் பொழில் சூழ் * குருகூர் நம்பி * முயல்கின்றேன் * என் தன் மொய் கழற்கன்பையே *",
            11: "🙏 அன்பன் தன்னை * அடைந்தவர்கட்கெல்லாம் அன்பன் * தென்குருகூர் * நகர் நம்பிக்கு *** அன்பனாய் * மதுரகவி சொன்ன சொல் நம்புவர் பதி * வைகுந்தம் காண்மினே *"
        },
    };

    // Non-destructive runtime merging engine
    for (const key in text_bundle_en) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_en[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_en[key][p];
        }
    }
};



