window.MARKER_DATABASE = window.MARKER_DATABASE || {};

// Global function to trigger the merge on-demand
window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'PAT.2.1.steps':
        {
            1: "🙏 மெச்சூதுசங்கம் இடத்தான் * நல்வேயூதி * பொய்ச்சூதில் தோற்ற * பொறையுடை மன்னர்க்காய் *** பத்தூர் பெறாது அன்று * பாரதம் கைசெய்த * அத்தூதன் அப்பூச்சிகாட்டுகின்றான் * அம்மனே! அப்பூச்சிகாட்டுகின்றான். *",
            2: "மலைபுரை தோள் மன்னவரும் * மா ரதரும் மற்றும் * பலர்குலைய * நூற்றுவரும் பட்டழிய *** பார்த்தன் சிலைவளையத் * திண்தேர் மேல் முன்னின்ற * செங்கண் அலைவலை வந்து அப்பூச்சிகாட்டுகின்றான் * அம்மனே! அப்பூச்சி காட்டுகின்றான். *",
            3: "காயும்நீர் புக்குக் * கடம்பேறி * காளியன் தீயபணத்தில் * சிலம்பார்க்கப் பாய்ந்தாடி *** வேயின் குழலூதி * வித்தகனாய் நின்ற * ஆயன்வந்து அப்பூச்சிகாட்டுகின்றான் * அம்மனே! அப்பூச்சிகாட்டுகின்றான். *",
            4: "இருட்டில் பிறந்துபோய் * ஏழை வல்லாயர் * மருட்டைத் தவிர்ப்பித்து * வன் கஞ்சன் மாளப் *** புரட்டி அந்நாள் எங்கள் * பூம்பட்டுக் கொண்ட * அரட்டன் வந்து அப்பூச்சிகாட்டுகின்றான் * அம்மனே! அப்பூச்சிகாட்டுகின்றான். *",
            5: "சேப்பூண்ட * சாடு சிதறி * திருடி நெய்க்கு ஆப்பூண்டு * நந்தன்மனைவி கடைதாம்பால் *** சோப்பூண்டு துள்ளித் * துடிக்க துடிக்க * அன்று ஆப்பூண்டான் அப்பூச்சிகாட்டுகின்றான் * அம்மனே! அப்பூச்சிகாட்டுகின்றான். *",
            6: "செப்பிள மென்முலைத் * தேவகி நங்கைக்கு * சொப்படத் தோன்றித் * தொறுப்பாடியோம் வைத்த *** துப்பமும் பாலும் * தயிரும் விழுங்கிய * அப்பன்வந்து அப்பூச்சிகாட்டுகின்றான் * அம்மனே! அப்பூச்சிகாட்டுகின்றான். *",
            7: "தத்துக்கொண்டாள்கொலோ? * தானேபெற்றாள்கொலோ? * சித்தமனையாள் * அசோதை இளஞ்சிங்கம் *** கொத்தார் கருங்குழல் * கோபால கோளரி * அத்தன்வந்து அப்பூச்சிகாட்டுகின்றான் * அம்மனே! அப்பூச்சிகாட்டுகின்றான். *",
            8: "கொங்கைவன் * கூனி சொற்கொண்டு * குவலயத் துங்கக் கரியும் * பரியும் இராச்சியமும் *** எங்கும் பரதற்கு அருளி * வன்கானடை * அங்கண்ணன் அப்பூச்சிகாட்டுகின்றான் * அம்மனே! அப்பூச்சிகாட்டுகின்றான். *",
            9: "பதக முதலை வாய்ப் * பட்டகளிறு * கதறிக்கைகூப்பி * என்கண்ணா! கண்ணா! என்ன *** உதவப் புள் ஊர்ந்து * அங்கு உறுதுயர் தீர்த்த * அதகன் வந்து அப்பூச்சிகாட்டுகின்றான் * அம்மனே! அப்பூச்சிகாட்டுகின்றான். *",
            10: "🙏 வல்லாளி இலங்கை மலங்கச் * சரந்துரந்த * வில்லாளனை * விட்டுசித்தன் விரித்த *** சொல்லார்ந்த அப்பூச்சிப் * பாடல் இவைபத்தும் வல்லார்போய் * வைகுந்தம் மன்னியிருப்பரே. *"
        },
        'PAT.2.2.steps':
        {
            1: "🙏 அரவணையாய்! ஆயரேறே! * அம்மம் உண்ணத் துயிலெழாயே * இரவுமுண்ணாது உறங்கிநீபோய் * இன்றுமுச்சி கொண்டதாலோ *** வரவும்காணேன் வயிறசைந்தாய் * வனமுலைகள் சோர்ந்துபாய * திருவுடைய வாய்மடுத்துத் * திளைத்து உதைத்துப் பருகிடாயே. ",
            2: "வைத்தநெய்யும் காய்ந்த பாலும் * வடிதயிரும் நறுவெண்ணெயும் * இத்தனையும் பெற்றறியேன் * எம்பிரான்! நீ பிறந்தபின்னை *** எத்தனையும் செய்யப் பெற்றாய் * ஏதும்செய்யேன் கதம்படாதே * முத்தனைய முறுவல் செய்து * மூக்குறுஞ்சி முலையுணாயே. ",
            3: "தந்தம் மக்கள் அழுதுசென்றால் * தாய்மார் ஆவார் தரிக்ககில்லார் * வந்துநின்மேல் பூசல்செய்ய * வாழவல்ல வாசுதேவா! *** உந்தையார் உன்திறத்தரல்லர் * உன்னை நான்ஒன்றுஉரப்பமாட்டேன் * நந்தகோபன் அணிசிறுவா! * நான் சுரந்த முலையுணாயே. ",
            4: "கஞ்சன் தன்னால் புணர்க்கப்பட்ட * கள்ளச்சகடு கலக்கழிய * பஞ்சியன்ன மெல்லடியால் * பாய்ந்தபோது நொந்திடுமென்று *** அஞ்சினேன் காண் அமரர்கோவே! * ஆயர் கூட்டத்து அளவு அன்று ஆல் ஓ * கஞ்சனை உன் வஞ்சனையால் * வலைப்படுத்தாய்! முலையுணாயே. ",
            5: "தீயபுந்திக் கஞ்சன் உன்மேல் * சினமுடையன் சோர்வுபார்த்து * மாயந்தன்னால் வலைப்படுக்கில் * வாழகில்லேன் வாசுதேவா! *** தாயர் வாய்ச்சொல் கருமம் கண்டாய் * சாற்றிச் சொன்னேன் போகவேண்டா * ஆயர்பாடிக் கணிவிளக்கே! * அமர்ந்துவந்து என்முலையுணாயே. ",
            6: "மின் அனைய நுண்ணிடையார் * விரிகுழல்மேல் நுழைந்தவண்டு * இன்னிசைக்கும் வில்லிபுத்தூர் * இனிதமர்ந்தாய்! உன்னைக்கண்டார் *** என்ன நோன்பு நோற்றாள்கொலோ * இவனைப்பெற்ற வயிறுடையாள் * என்னும் வார்த்தை எய்துவித்த * இருடீகேசா! முலையுணாயே. ",
            7: "பெண்டிர்வாழ்வார் நின்னொப்பாரைப் * பெறுது மென்னும் ஆசையாலே * கண்டவர்கள் போக்கொழிந்தார் * கண்ணிணையால் கலக்கநோக்கி *** வண்டுலாம் பூங்குழலினார் * உன்வாயமுதம் உண்ணவேண்டி * கொண்டுபோவான் வந்துநின்றார் * கோவிந்தா! நீமுலையுணாயே. ",
            8: "இருமலைபோல் எதிர்ந்த மல்லர் * இருவர் அங்கம் எரிசெய்தாய்! * உன் திருமலிந்து திகழ்மார்வு * தேக்கவந்து என் அல்குலேறி *** ஒருமுலையை வாய்மடுத்து * ஒருமுலையை நெருடிக்கொண்டு * இருமுலையும் முறைமுறையா * ஏங்கிஏங்கி இருந்துணாயே. ",
            9: "அங்கமலப் போதகத்தில் * அணிகொள் முத்தம் சிந்தினாற்போல் * செங்கமல முகம் வியர்ப்பத் * தீமை செய்து இம் முற்றத்தூடே *** அங்கமெல்லாம் புழுதியாக * அளையவேண்டா அம்ம! விம்ம * அங்கு அமரர்க்கு அமுதளித்த * அமரர்கோவே! முலையுணாயே. ",
            10: "ஓடவோடக் கிங்கிணிகள் * ஒலிக்கும் ஓசைப் பாணியாலே * பாடிப்பாடி வருகின்றாயைப் * பற்பநாபன் என்று இருந்தேன் *** ஆடியாடி அசைந்து அசைந்திட்டு * அதனுக்கேற்ற கூத்தையாடி * ஓடியோடிப் போய்விடாதே * உத்தமா! நீமுலையுணாயே. ",
            11: "🙏 வாரணிந்த கொங்கையாய்ச்சி * மாதவா! உண்ணென்றமாற்றம் * நீரணிந்த குவளைவாசம் * நிகழநாறும் வில்லிபுத்தூர் *** பாரணிந்த தொல்புகழான் * பட்டர்பிரான் பாடல்வல்லார் * சீரணிந்த செங்கண்மால்மேல் * சென்ற சிந்தை பெறுவார்தாமே. ",
        },
        'PAT.2.3.steps':
        {
            1: "🙏 போய்ப்பாடு உடைய நின் தந்தையும் தாழ்த்தான் * பொருதிறல் கஞ்சன் கடியன் * காப்பாரும் இல்லை கடல்வண்ணா உன்னைத் * தனியே போய் எங்கும் திரிதி *** பேய்ப்பால் முலை உண்ட பித்தனே! * கேசவநம்பீ! உன்னைக் காது குத்த * ஆய்ப்பாலர் பெண்டுகள் எல்லாரும் வந்தார் * அடைக்காய் திருத்தி நான் வைத்தேன். ",
            2: "வண்ணப் பவள மருங்கினில் சாத்தி * மலர்ப்பாதக் கிங்கிணி யார்ப்ப * நண்ணித் தொழும் அவர் சிந்தை பிரியாத * நாராயணா! இங்கே வாராய் *** எண்ணற் கரிய பிரானே * திரியை எரியாமே காதுக்கு இடுவன் * கண்ணுக்கு நன்றும் அழகும் உடைய * கனகக் கடிப்பும் இவையா! ",
            3: "வையம் எல்லாம் பெறும் வார்கடல் வாழும் * மகரக் குழை கொண்டு வைத்தேன் * வெய்யவே காதில் திரியை இடுவன் * நீ வேண்டியது எல்லாம் தருவன் *** உய்ய இவ்வாயர் குலத்தினில் தோன்றிய * ஒண் சுடர் ஆயர் கொழுந்தே * மையன்மை செய்து இளஆய்ச்சியர் உள்ளத்து * மாதவனே! இங்கேவாராய். ",
            4: "வணநன்று உடைய வைரக் கடிப்பிட்டு * வார்காது தாழப் பெருக்கி * குணநன்று உடையர் இக்கோபால பிள்ளைகள் * கோவிந்தா! நீ சொல்லுக் கொள்ளாய் *** இணைநன்று அழகிய இக்கடிப்பு இட்டால் * இனிய பலாப் பழம் தந்து * சுணநன்று அணிமுலை உண்ணத் தருவன் நான் * சோத்தம்பிரான்! இங்கே வாராய்.",
            5: "சோத்தம்பிரான் என்று இரந்தாலும் கொள்ளாய் * சுரி குழலாரொடு நீ போய் * கோத்துக் குரவை பிணைந்து இங்கு வந்தால் * குணம் கொண்டு இடுவேனா? நம்பீ *** பேர்த்தும் பெரியன அப்பம் தருவன் * பிரானே! திரியிட வொட்டில் * வேய்த் தடந்தோளார் விரும்பு கருங்குழல் * விட்டுவே! நீ இங்கே வாராய். ",
            6: "விண் எல்லாம் கேட்க அழுதிட்டாய் * உன்வாயில் விரும்பி அதனை நான் நோக்கி * மண் எல்லாம் கண்டு என் மனத்து உள்ளே அஞ்சி *** மதுசூதனே என்று அறிந்தேன் * புண் ஏதும் இல்லை உன்காதும் அறியும் * பொறுத்து இறைப் போது இருநம்பீ! கண்ணா! என் கார்முகிலே! கடல்வண்ணா * காவலனே! முலைஉணாயே. ",
            7: "முலை ஏதும் வேண்டேன் என்று ஓடி * நின் காதில் கடிப்பைப் பறித்து எறிந்திட்டு * மலையை எடுத்து மகிழ்ந்து கல்மாரி காத்துப் * பசுநிரை மேய்த்தாய் *** சிலை ஒன்று இறுத்தாய்! திரிவிக்கிரமா! * திருஆயர் பாடிப் பிரானே! * தலை நிலாப்போதே உன் காதைப் பெருக்காதே * விட்டிட்டேன் குற்றமே அன்றே. ",
            8: "என் குற்றமே என்று சொல்லவும் வேண்டாகாண் * என்னை நான் மண் உண்டேன்ஆக * அன்புற்று நோக்கி அடித்தும் பிடித்தும் * அனைவர்க்கும் காட்டிற்று இலையே *** வன்புற்று அரவின் பகைக்கொடி * வாமன நம்பீ! உன்காதுகள் தூரும் * துன்புற்றன எல்லாம் தீர்ப்பாய் பிரானே * திரியிட்டுச் சொல்லுகேன் மெய்யே. ",
            9: "மெய் என்று சொல்லுவார் சொல்லைக் கருதித் * தொடுப்பு உண்டாய் வெண்ணெயை என்று * கையைப் பிடித்துக் கரை உரலோடு என்னைக் * காணவே கட்டிற்று இலையே *** செய்தன சொல்லிச் சிரித்து அங்கு இருக்கில் * சிரீதரா! உன்காது தூரும் * கையில் திரியை இடுகிடாய் * இந்நின்ற காரிகையார் சிரியாமே. ",
            10: "காரிகையார்க்கும் உனக்கும் இழுக்கு உற்றென் * காதுகள் வீங்கி எறியில் * தாரியாது ஆகில் தலை நொந்திடும் என்று * விட்டிட்டேன் குற்றமே யன்றே *** சேரியிற் பிள்ளைகள் எல்லாரும் காது பெருக்கித் * திரியவும் காண்டி * ஏர்விடைசெற்று இளங்கன்று எறிந்திட்ட * இருடீகேசா! என்தன் கண்ணே! ",
            11: "கண்ணைக் குளிரக் கலந்து எங்கும் நோக்கிக் * கடி கமழ் பூங்குழலார்கள் * எண்ணத்துள் என்றும் இருந்து தித்திக்கும் * பெருமானே! எங்கள் அமுதே *** உண்ணக் கனிகள் தருவன் * கடிப்பு ஒன்றும் நோவாமே காதுக்கு இடுவன் * பண்ணைக் கிழியச் சகடம் உதைத்திட்ட * பற்பநாபா! இங்கே வாராய். ",
            12: "வா என்று சொல்லி என் கையைப் பிடித்து * வலியவே காதில் கடிப்பை * நோவத் திரிக்கில் உனக்கு இங்கு இழுக்கு உற்றென் * காதுகள் நொந்திடும் கில்லேன் *** நாவற் பழம் கொண்டு வைத்தேன் * இவை காணாய் நம்பீ * முன் வஞ்ச மகளைச் சாவப்பால் உண்டு சகடிறப் பாய்ந்திட்ட * தாமோதரா! இங்கே வாராய். ",
            13: "🙏 வார்காது தாழப் பெருக்கி அமைத்து * மகரக் குழையிட வேண்டி * சீரால் அசோதை திருமாலைச் சொன்ன சொல் * சிந்தை உள் நின்று திகழ *** பாரார் தொல் புகழான் புதுவை மன்னன் * பன்னிரு நாமத்தால் சொன்ன * ஆராத அந்தாதி பன்னிரண்டும் வல்லார் * அச்சுதனுக்கு அடியாரே. ",
        },
        'PAT.2.4.steps':
        {
            1: "🙏 வெண்ணெயளைந்த குணுங்கும் * விளையாடு புழுதியும் கொண்டு * திண்ணென இவ்விரா உன்னைத் * தேய்த்துக் கிடக்க நான்ஒட்டேன் *** எண்ணெய்ப் புளிப்பழம் கொண்டு * இங்கு எத்தனைபோதும் இருந்தேன் * நண்ணலரியபிரானே! * நாரணா! நீராடவாராய். ",
            2: "கன்றுகள் ஓடச்செவியில் * கட்டெறும்பு பிடித்திட்டால் * தென்றிக் கெடுமாகில் * வெண்ணெய்திரட்டி விழுங்குமாகாண்பன் *** நின்ற மராமரம் சாய்த்தாய்! * நீ பிறந்த திருவோணம் * இன்று நீ நீராடவேண்டும் * எம்பிரான்! ஓடாதேவாராய். ",
            3: "பேய்ச்சிமுலை உண்ணக்கண்டு * பின்னையும் நில்லாது என்னெஞ்சம் * ஆய்ச்சியர் எல்லாம்கூடி * அழைக்கவும் நான்முலைதந்தேன் *** காய்ச்சின நீரொடு நெல்லி * கடாரத்தில் பூரித்துவைத்தேன் * வாய்த்தபுகழ் மணிவண்ணா! * மஞ்சனமாடநீவாராய். ",
            4: "கஞ்சன் புணர்ப்பினில் வந்த * கடியசகடம் உதைத்து * வஞ்சகப் பேய்மகள் துஞ்ச * வாய்முலை வைத்தபிரானே! *** மஞ்சளும் செங்கழுநீரின் * வாசிகையும் நாறுசாந்தும் * அஞ்சனமும் கொண்டுவைத்தேன் * அழகனே! நீராடவாராய். ",
            5: "அப்பம் கலந்த சிற்றுண்டி * அக்காரம் பாலில் கலந்து * சொப்பட நான் சுட்டுவைத்தேன் * தின்னல் உறிதியேல்நம்பீ! *** செப்பிள மென்முலையார்கள் * சிறுபுறம் பேசிச்சிரிப்பர் * சொப்பட நீராடவேண்டும் * சோத்தம்பிரான்! இங்கேவாராய். ",
            6: "எண்ணெய்க் குடத்தை உருட்டி * இளம்பிள்ளை கிள்ளியெழுப்பி * கண்ணைப் புரட்டி விழித்துக் * கழகண்டு செய்யும்பிரானே! *** உண்ணக் கனிகள் தருவன் * ஒலிகடல் ஓதநீர்போலே * வண்ணம் அழகியநம்பீ! * மஞ்சனமாட நீவாராய். ",
            7: "கறந்தநற் பாலும் தயிரும் * கடைந்து உறிமேல் வைத்த வெண்ணெய் * பிறந்ததுவே முதலாகப் * பெற்றறியேன் எம்பிரானே! *** சிறந்தநற்றாய் அலர்தூற்றும் * என்பதனால் பிறர்முன்னே * மறந்தும் உரையாட மாட்டேன் * மஞ்சனமாட நீவாராய். ",
            8: "கன்றினை வாலோலை கட்டிக் * கனிகள் உதிரஎறிந்து * பின்தொடர்ந்து ஓடிஓர்பாம்பைப் * பிடித்துக்கொண்டு ஆட்டினாய்போலும் *** நின்திறத்தே நல்லேன்நம்பீ! * நீபிறந்த திருநல்நாள் * நன்று நீநீராட வேண்டும் * நாரணா! ஓடாதேவாராய். ",
            9: "பூணித் தொழுவினில் புக்குப் * புழுதியளைந்த பொன்மேனி * காணப்பெரிதும் உகப்பன் * ஆகிலும் கண்டார் பழிப்பர் *** நாணெத்தனையும் இலாதாய்! * நப்பின்னை காணில்சிரிக்கும் * மாணிக்கமே! என்மணியே! * மஞ்சனமாட நீவாராய். ",
            10: "🙏 கார்மலி மேனி நிறத்துக் * கண்ணபிரானை உகந்து * வார்மலி கொங்கை யசோதை * மஞ்சன மாட்டியவாற்றை *** பார்மலிதொல் புதுவைக்கோன் * பட்டர்பிரான் சொன்னபாடல் * சீர்மலி செந்தமிழ் வல்லார் * தீவினையாதும் இலரே. ",
        },
        'PAT.2.5.steps':
        {
            1: "🙏 பின்னை மணாளனைப் * பேரில்கிடந்தானை * முன்னையமரர் * முதல்தனிவித்தினை *** என்னையும் எங்கள் * குடிமுழுது ஆட்கொண்ட * மன்னனைவந்து குழல்வாராய்அக்காக்காய்! * மாதவன்தன் குழல்வாராய்அக்காக்காய்! ",
            2: "பேயின்முலையுண்ட * பிள்ளைஇவன்முன்னம் * மாயச்சகடும் * மருதும்இறுத்தவன் *** காயாமலர்வண்ணன் * கண்ணன்கருங்குழல் * தூய்தாகவந்து குழல்வாராய்அக்காக்காய்! * தூமணிவண்ணன் குழல்வாராய்அக்காக்காய்! ",
            3: "திண்ணக்கலத்தில் * திரையுறிமேல்வைத்த * வெண்ணெய்விழுங்கி * விரையஉறங்கிடும் *** அண்ணல் அமரர் * பெருமானை ஆயர்தம் * கண்ணனைவந்து குழல்வாராய்அக்காக்காய்! * கார்முகில்வண்ணன் குழல்வாராய்அக்காக்காய்! ",
            4: "பள்ளத்தில்மேயும் * பறவையுருக்கொண்டு * கள்ளவசுரன் * வருவானைத் தான்கண்டு *** புள்ளிதுவென்று * பொதுக்கோவாய்கீண்டிட்ட * பிள்ளையைவந்து குழல்வாராய்அக்காக்காய்! * பேய்முலையுண்டான் குழல்வாராய்அக்காக்காய்! ",
            5: "கற்றினம் மேய்த்துக் * கனிக்கு ஒருகன்றினை * பற்றியெறிந்த * பரமன்திருமுடி *** உற்றனபேசி * நீஓடித்திரியாதே * அற்றைக்கும்வந்து குழல்வாராய்அக்காக்காய்! * ஆழியான்தன் குழல்வாராய்அக்காக்காய்! ",
            6: "கிழக்கில் குடிமன்னர் * கேடிலாதாரை * அழிப்பான் நினைந்திட்டு * அவ்வாழியதனால் *** விழிக்குமளவிலே * வேரறுத்தானை * குழற்குஅணியாகக் குழல்வாராய்அக்காக்காய்! * கோவிந்தன்தன் குழல்வாராய்அக்காக்காய்! ",
            7: "பிண்டத்திரளையும் * பேய்க்கு இட்டநீர்ச்சோறும் * உண்டற்குவேண்டி * நீஓடித் திரியாதே *** அண்டத்துஅமரர் * பெருமான் அழகமர் * வண்டொத்திருண்ட குழல்வாராய்அக்காக்காய்! * மாயவன்தன் குழல்வாராய்அக்காக்காய்! ",
            8: "உந்தியெழுந்த * உருவமலர்தன்னில் * சந்தச்சதுமுகன் * தன்னைப் படைத்தவன் *** கொந்தக் குழலைக் * குறந்து புளியட்டி * தந்தத்தின்சீப்பால் குழல்வாராய்அக்காக்காய்! * தாமோதரன்தன் குழல்வாராய்அக்காக்காய்! ",
            9: "மன்னன் தன் தேவிமார் * கண்டு மகிழ்வெய்த * முன்இவ் உலகினை * முற்றும் அளந்தவன் *** பொன்னின் முடியினைப் * பூவணை மேல்வைத்து * பின்னேயிருந்து குழல்வாராய்அக்காக்காய்! * பேராயிரத்தான் குழல்வாராய்அக்காக்காய்! ",
            10: "🙏 கண்டார்பழியாமே * அக்காக்காய்! * கார்வண்ணன் வண்டார் குழல்வார * வாவென்ற ஆய்ச்சிசொல் *** விண்தோய்மதிள் * வில்லிபுத்தூர்க்கோன் பட்டன்சொல் * கொண்டாடிப்பாடக் * குறுகாவினைதாமே! ",
        },
        'PAT.2.6.steps':
        {
            1: "🙏 வேலிக்கோல்வெட்டி * விளையாடு வில்லேற்றி * தாலிக்கொழுந்தைத் * தடங்கழுத்தில் பூண்டு *** பீலித்தழையைப் * பிணைத்துப் பிறகிட்டு * காலிப்பின்போவாற்குஓர் கோல்கொண்டுவா! * கடல்நிறவண்ணற்குஓர் கோல்கொண்டுவா. ",
            2: "கொங்கும் குடந்தையும் * கோட்டியூரும் பேரும் * எங்கும் திரிந்து * விளையாடும் என்மகன் *** சங்கம் பிடிக்கும் * தடக்கைக்குத் தக்க * நல்அங்கமுடையதோர் கோல்கொண்டுவா! * அரக்குவழித்ததோர் கோல்கொண்டுவா. ",
            3: "கறுத்திட்டு எதிர்நின்ற * கஞ்சனைக் கொன்றான் * பொறுத்திட்டு எதிர்வந்த * புள்ளின்வாய் கீண்டான் *** நெறித்த குழல்களை * நீங்கமுன்னோடி * சிறுக்கன்றுமேய்ப்பாற்குஓர் கோல்கொண்டுவா! * தேவபிரானுக்குஓர்கோல்கொண்டுவா. ",
            4: "ஒன்றே உரைப்பான் * ஒருசொல்லே சொல்லுவான் * துன்றுமுடியான் * துரியோதனன் பக்கல் *** சென்று அங்குப் பாரதம் * கையெறிந்தானுக்கு * கன்றுகள்மேய்ப்பதோர் கோல்கொண்டுவா * கடல்நிறவண்ணர்க்குஓர் கோல்கொண்டுவா. ",
            5: "சீரொன்று தூதாய்த் * துரியோதனன் பக்கல் * ஊரொன்று வேண்டிப் * பெறாத உரோடத்தால் *** பாரொன்றிப் பாரதம் * கைசெய்து பார்த்தற்குத் * தேரொன்றையூர்ந்தாற்குஓர் கோல்கொண்டுவா * தேவபிரானுக்குஓர் கோல்கொண்டுவா. ",
            6: "ஆலத்திலையான் * அரவினணை மேலான் * நீலக்கடலுள் * நெடுங்காலம் கண்வளர்ந்தான் *** பாலப்பிராயத்தே * பார்த்தர்க்கு அருள்செய்த * கோலப்பிரானுக்குஓர் கோல்கொண்டுவா * குடந்தைக்கிடந்தார்க்குஓர் கோல்கொண்டுவா.",
            7: "பொன்திகழ் * சித்திரகூடப் பொருப்பினில் * உற்றவடிவில் * ஒருகண்ணும் கொண்ட *** அக்கற்றைக் குழலன் * கடியன் விரைந்து உன்னை * மற்றைக்கண்கொள்ளாமே கோல்கொண்டுவா! * மணிவண்ணநம்பிக்குஓர் கோல்கொண்டுவா. ",
            8: "மின்னிடைச் சீதைபொருட்டா * இலங்கையர் * மன்னன் மணிமுடி * பத்தும் உடன்வீழ *** தன்னிகர் ஒன்றில்லாச் * சிலைகால் வளைத்திட்ட * மின்னுமுடியற்குஓர் கோல்கொண்டுவா! * வேலையடைத்தாற்குஓர் கோல்கொண்டுவா. ",
            9: "தென்னிலங்கை மன்னன் * சிரம்தோள் துணிசெய்து * மின்னிலங்குபூண் * விபீடணநம்பிக்கு *** என்னிலங்கு நாமத்தளவும் * அரசென்ற * மின்னிலங்காரற்குஓர் கோல்கொண்டுவா! * வேங்கடவாணர்க்குஓர்கோல்கொண்டுவா. ",
            10: "🙏 அக்காக்காய்! நம்பிக்குக் * கோல்கொண்டு வாவென்று * மிக்காள் உரைத்தசொல் * வில்லிபுத்தூர்ப்பட்டன் *** ஒக்க உரைத்த * தமிழ்பத்தும் வல்லவர் * மக்களைப் பெற்று * மகிழ்வர் இவ்வையத்தே. ",
        },
        'PAT.2.7.steps':
        {
            1: "🙏 ஆனிரை மேய்க்க நீபோதி * அருமருந்து ஆவதறியாய் * கானகம் எல்லாம் திரிந்து * உன்கரிய திருமேனிவாட *** பானையில் பாலைப் பருகிப் * பற்றாதார் எல்லாம் சிரிப்ப * தேனில் இனியபிரானே! * செண்பகப்பூச் சூட்டவாராய். ",
            2: "கருவுடை மேகங்கள் கண்டால் * உன்னைக் கண்டால் ஒக்கும்கண்கள் * உருவுடையாய்! உலகேழும் * உண்டாக வந்து பிறந்தாய்! *** திருவுடையாள் மணவாளா! * திருவரங்கத்தே கிடந்தாய்! * மருவிமணம் கமழ்கின்ற * மல்லிகைப்பூச் சூட்டவாராய். ",
            3: "மச்சொடு மாளிகை ஏறி * மாதர்கள் தம்மிடம்புக்கு * கச்சொடு பட்டைக் கிழித்துக் * காம்பு துகிலவைகீறி *** நிச்சலும் தீமைகள் செய்வாய்! * நீள் திருவேங்கடத்து எந்தாய்! * பச்சைத் தமனகத்தோடு * பாதிரிப்பூச் சூட்டவாராய். ",
            4: "தெருவின்கண் நின்று இளவாய்ச்சிமார்களைத் * தீமைசெய்யாதே * மருவும் தமனகமும்சீர் * மாலை மணம் கமழ்கின்ற *** புருவம் கருங்குழல் நெற்றி * பொலிந்த முகிற் கன்றுபோலே * உருவமழகியநம்பீ! * உகந்திவை சூட்டநீவாராய். ",
            5: "புள்ளினை வாய் பிளந்திட்டாய்! * பொருகரியின் கொம்பொசித்தாய்! * கள்ளவரக்கியை மூக்கொடு * காவலனைத் தலைகொண்டாய்! *** அள்ளி நீ வெண்ணெய் விழுங்க * அஞ்சாது அடியேன் அடித்தேன் * தெள்ளிய நீரில் எழுந்த * செங்கழுநீர் சூட்டவாராய். ",
            6: "எருதுகளோடு பொருதி * ஏதும் உலோபாய்காண் நம்பி! * கருதிய தீமைகள் செய்து * கஞ்சனைக் கால்கொடு பாய்ந்தாய்! *** தெருவின்கண் தீமைகள் செய்து * சிக்கென மல்லர்களோடு * பொருது வருகின்ற பொன்னே! * புன்னைப்பூச் சூட்டவாராய். ",
            7: "குடங்கள் எடுத்தேறவிட்டுக் * கூத்தாட வல்லஎம்கோவே! * மடங்கொள் மதிமுகத்தாரை * மால்செய்யவல்ல என்மைந்தா! *** இடந்திட்டு இரணியன் நெஞ்சை * இருபிளவாக முன்கீண்டாய்! * குடந்தைக் கிடந்த எம்கோவே! * குருக்கத்திப்பூச் சூட்டவாராய். ",
            8: "சீமாலிகன் அவேனாடு * தோழமை கொள்ளவும் வல்லாய்! * சாமாறு அவனை நீ எண்ணிச் * சக்கரத்தால் தலைகொண்டாய்! *** ஆமாறறியும்பிரானே! * அணியரங்கத்தே கிடந்தாய்! * ஏமாற்றம் என்னைத்தவிர்த்தாய்! * இருவாட்சிப்பூச் சூட்டவாராய். ",
            9: "அண்டத்தமரர்கள் சூழ * அத்தாணியுள் அங்கிருந்தாய்! * தொண்டர்கள் நெஞ்சிலுறைவாய்! * தூமலராள் மணவாளா! *** உண்டிட்டு உலகினையேழும் * ஓராலிலையில் துயில்கொண்டாய்! * கண்டுநான் உன்னை உகக்கக் * கருமுகைப்பூச் சூட்டவாராய். ",
            10: "🙏 செண்பக மல்லிகையோடு * செங்கழுநீர் இருவாட்சி * எண்பகர் பூவும் கொணர்ந்தேன் * இன்று இவை சூட்டவாவென்று *** மண்பகர் கொண்டானை * ஆய்ச்சி மகிழ்ந்துரை செய்தஇம்மாலை * பண்பகர் வில்லிபுத்தூர்க்கோன் * பட்டர்பிரான் சொன்னபத்தே. ",
        },
        'PAT.2.8.steps':
        {
            1: "🙏 இந்திரேனாடு பிரமன் * ஈசன் இமையவர் எல்லாம் * மந்திர மாமலர் கொண்டு * மறைந்துஉவராய் வந்து நின்றார் *** சந்திரன் மாளிகை சேரும் * சதிரர்கள் வெள்ளறை நின்றாய் * அந்தியம் போது இதுவாகும் * அழகனே! காப்பிடவாராய். ",
            2: "கன்றுகள் இல்லம் புகுந்து * கதறுகின்ற பசு எல்லாம் * நின்று ஒழிந்தேன் உன்னைக் கூவி * நேசமேல் ஒன்றும் இலாதாய்! *** மன்றில் நில்லேல் அந்திப் போது * மதிள்திரு வெள்ளறை நின்றாய்! * நன்று கண்டாய் என் தன் சொல்லு * நான் உன்னைக் காப்பிடவாராய். ",
            3: "செப்போது மென் முலையார்கள் * சிறுசோறும் இல்லும் சிதைத்திட்டு * அப்போது நான் உரப்பப்போய் *** அடிசிலும் உண்டிலை ஆள்வாய்! * முப்போதும் வானவர் ஏத்தும் * முனிவர்கள் வெள்ளறை நின்றாய்! * இப்போது நான் ஒன்றும் செய்யேன் * எம்பிரான்! காப்பிடவாராய். ",
            4: "கண்ணில் மணல் கொடு தூவிக் * காலினால் பாய்ந்தனை என்றுஎன்று * எண்ணரும் பிள்ளைகள் வந்திட்டு *** இவரால் முறைப்படு கின்றார் * கண்ணனே! வெள்ளறை நின்றாய்! * கண்டாரோடே தீமை செய்வாய்! வண்ணமே வேலைய தொப்பாய்! * வள்ளலே! காப்பிடவாராய். ",
            5: "பல்லாயிரவர் இவ்வூரில் பிள்ளைகள் * தீமைகள் செய்வார் * எல்லாம் உன் மேல் அன்றிப் போகாது * எம்பிரான்! நீ இங்கே வாராய் *** நல்லார்கள் வெள்ளறை நின்றாய்! * ஞானச்சுடரே! உன் மேனி * சொல்லார வாழ்த்தி நின்று ஏத்திச் * சொப்படக் காப்பிடவாராய். ",
            6: "கஞ்சன் கறுக்கொண்டு நின்மேல் * கருநிறச் செம்மயிர்ப் பேயை * வஞ்சிப்பதற்கு விடுத்தான் என்பது ஓர் *** வார்த்தையும் உண்டு * மஞ்சு தவழ் மணிமாட * மதிள்திரு வெள்ளறை நின்றாய்! அஞ்சுவன் நீ அங்கு நிற்க * அழகனே! காப்பிடவாராய். ",
            7: "கள்ளச் சகடும் மருதும் * கலக்கழிய உதை செய்த * பிள்ளையரசே! நீ பேயைப் பிடித்து * முலை உண்ட பின்னை *** உள்ளவாறு ஒன்றும் அறியேன் * ஒளிஉடை வெள்ளறை நின்றாய்! * பள்ளி கொள் போது இதுவாகும் * பரமனே! காப்பிடவாராய். ",
            8: "இன்பம் அதனை உயர்த்தாய்! * இமையவர்க்கு என்றும் அரியாய்! * கும்பக் களிறட்ட கோவே! *** கொடுங்கஞ்சன் நெஞ்சினிற் கூற்றே! * செம்பொன் மதிள் வெள்ளறையாய்! * செல்வத்தினால் வளர் பிள்ளாய்! கம்பக் கபாலி காண் அங்குக் * கடி தோடிக் காப்பிடவாராய். ",
            9: "இருக்கொடு நீர் சங்கில் கொண்டிட்டு * எழில் மறையோர் வந்து நின்றார் * தருக்கேல்நம்பி! சந்தி நின்று * தாய் சொல்லுக் கொள்ளாய் சிலநாள் *** திருக்காப்பு நான் உன்னைச் சாத்தத் * தேசுடை வெள்ளறை நின்றாய்! * உருக்காட்டும் அந்தி விளக்கு * இன்று ஒளி கொள்ள ஏற்றுகேன் வாராய். ",
            10: "🙏 போதமர் செல்வக் கொழுந்து * புணர் திருவெள்ளறை யானை * மாதர்க் குயர்ந்த அசோதை * மகன் தன்னைக் காப்பிட்ட மாற்றம் *** வேதப் பயன் கொள்ள வல்ல * விட்டுசித்தன் சொன்ன மாலை * பாதப் பயன் கொள்ள வல்ல * பத்தருள்ளார் வினை போமே. ",
        },
        'PAT.2.9.steps':
        {
            1: "🙏 வெண்ணெய்விழுங்கி வெறுங்கலத்தை வெற்பிடையிட்டு * அதேனாசைகேட்கும் * கண்ணபிரான் கற்ற கல்விதன்னைக் * காக்ககில்லோம் உன்மகனைக் காவாய் *** புண்ணில் புளிப்பெய்தால் ஒக்கும்தீமை * புரைபுரையால் இவைசெய்யவல்ல * அண்ணற்கண்ணானோர் மகனைப் பெற்ற * அசோதைநங்காய்! உன்மகனைக்கூவாய். ",
            2: "வருக வருக வருக இங்கே * வாமனநம்பீ! வருக இங்கே * கரியகுழல் செய்யவாய் முகத்துக் * காகுத்தநம்பீ! வருகஇங்கே *** அரியனிவன் எனக்கு இன்றுநங்காய்! * அஞ்சனவண்ணா! அசலகத்தார் * பரிபவம்பேசத் தரிக்ககில்லேன் * பாவியேனுக்கு இங்கே போதராயே. ",
            3: "திருவுடைப் பிள்ளை தான் தீயவாறு * தேக்கம் ஒன்றுமிலன் தேசுடையன் * உருகவைத்த குடத்தொடு வெண்ணெய் * உறிஞ்சிய் உடைத்திட்டுப் போந்து நின்றான் *** அருகிருந்தார் தம்மை அநியாயம் செய்வது தான் * வழக்கோ? அசோதாய்! * வருக வென்று உன்மகன் தன்னைக்கூவாய் * வாழவொட்டான் மதுசூதனனே. ",
            4: "கொண்டல் வண்ணா! இங்கே போதராயே * கோயிற்பிள்ளாய்! இங்கே போதராயே * தெண்திரைசூழ் திருப்பேர்க் கிடந்த * திருநாரணா! இங்கே போதராயே *** உண்டுவந்தேன் அம்மம் என்றுசொல்லி * ஓடி அகம்புக ஆய்ச்சிதானும் * கண்டெதிரே சென்றெடுத்துக் கொள்ளக் * கண்ணபிரான் கற்ற கல்விதானே. ",
            5: "பாலைக் கறந்து அடுப்பேற வைத்துப் * பல்வளையாள் என்மகள் இருப்ப * மேலையகத்தே நெருப்பு வேண்டிச் சென்று * இறைப்பொழுது அங்கே பேசிநின்றேன் *** சாளக்கிராமம் உடைய நம்பி * சாய்த்துப் பருகிட்டுப் போந்து நின்றான் * ஆலைக் கரும்பின் மொழி அனைய * அசோதை நங்காய்! உன்மகனைக் கூவாய். ",
            6: "போதர் கண்டாய் இங்கே போதர் கண்டாய் * போதரேன் என்னாதே போதர் கண்டாய் * ஏதேனும் சொல்லி அசலகத்தார் * ஏதேனும்பேச நான் கேட்கமட்டேன் *** கோதுகலமுடைக் குட்டனேயா! * குன்றெடுத்தாய்! குடமாடுகூத்தா! * வேதப்பொருளே! என்வேங்கடவா! * வித்தகனே! இங்கேபோதராயே. ",
            7: "செந்நெல் அரிசி சிறுபருப்புச் * செய்த அக்காரம் நறுநெய் பாலால் * பன்னிரண்டு திருவோணம் அட்டேன் * பண்டும் இப்பிள்ளை பரிசறிவன் *** இன்னமுகப்பன் நான் என்றுசொல்லி * எல்லாம்விழுங்கிட்டுப் போந்து நின்றான் * உன்மகன் தன்னை அசோதை நங்காய்! * கூவிக்கொள்ளாய் இவையும் சிலவே. ",
            8: "கேசவனே! இங்கே போதராயே * கில்லேன் என்னாது இங்கே போதராயே * நேசமிலாதார் அகத்திருந்து * நீ விளையாடாதே போதராயே *** தூசனம் சொல்லும் தொழுத்தைமாரும் * தொண்டரும் நின்ற இடத்தில் நின்று * தாய்சொல்லுக் கொள்வது தன்மம் கண்டாய் * தாமோதரா! இங்கேபோதராயே. ",
            9: "கன்னல் இலட்டுவத்தோடு சீடை * கார் எள்ளின் உண்டை கலத்திலிட்டு * என்னகம் என்று நான்வைத்துப் போந்தேன் * இவன்புக்கு அவற்றைப் பெறுத்திப் போந்தான் *** பின்னும் அகம்புக்கு உறியை நோக்கிப் * பிறங்கொளி வெண்ணெயும் சோதிக்கின்றான் * உன்மகன் தன்னை யசோதைநங்காய்! * கூவிக்கொள்ளாய் இவையும்சிலவே. ",
            10: "சொல்லில் அரசிப்படுதி நங்காய்! * சுழலுடையன் உன்பிள்ளை தானே * இல்லம்புகுந்து என்மகளைக் கூவிக் * கையில் வளையைக் கழற்றிக் கொண்டு *** கொல்லையில் நின்றும் கொணர்ந்து விற்ற * அங்கொருத்திக்கு அவ்வளை கொடுத்து * நல்லன நாவற்பழங்கள் கொண்டு * நானல்லேன் என்று சிரிக்கின்றானே. ",
            11: "🙏 வண்டு களித்திரைக்கும் பொழில்சூழ் * வருபுனல் காவிரித் தென்னரங்கன் * பண்டவன்செய்த கிரீடையெல்லாம் * பட்டர்பிரான் விட்டுசித்தன் பாடல் *** கொண்டிவை பாடிக் குனிக்க வல்லார் * கோவிந்தன் தன் அடியார்களாகி * எண்திசைக்கும் விளக்காகி நிற்பார் * இணையடி என் தலைமேலனவே. ",
        },
        'PAT.2.10.steps':
        {
            1: "🙏 ஆற்றிலிருந்து * விளையாடுவோங்களை * சேற்றாலெறிந்து * வளைதுகில் கைக்கொண்டு *** காற்றின் கடியனாய் * ஓடி அகம்புக்கு * மாற்றமும்தாரானால் இன்றுமுற்றும் * வளைத்திறம்பேசானால் இன்றுமுற்றும். ",
            2: "குண்டலம் தாழக் * குழல்தாழ நாண்தாழ * எண்திசையோரும் * இறைஞ்சித் தொழுதேத்த *** வண்டமர் பூங்குழலார் * துகில் கைக்கொண்டு * விண்தோய்மரத்தானால் இன்றுமுற்றும் * வேண்டவும்தாரானால் இன்றுமுற்றும். ",
            3: "தடம்படு தாமரைப் * பொய்கை கலக்கி * விடம்படு நாகத்தை * வால்பற்றி ஈர்த்து *** படம்படு பைந்தலை * மேலெழப் பாய்ந்திட்டு * உடம்பைய் அசைத்தானால் இன்றுமுற்றும் * உச்சியில் நின்றானால் இன்றுமுற்றும். ",
            4: "தேனுகன் ஆவி * செகுத்து பனங்கனி * தானெறிந்திட்ட * தடம்பெரும் தோளினால் *** வானவர் கோன்விட * வந்த மழை தடுத்து * ஆனிரை காத்தானால் இன்றுமுற்றும் * அவை உய்யக்கொண்டானால் இன்றுமுற்றும்.",
            5: "ஆய்ச்சியர்சேரி * அளைதயிர் பாலுண்டு * பேர்த்தவர் கண்டு * பிடிக்கப் பிடியுண்டு *** வேய்த்தடன் தோளினார் * வெண்ணெய் கொள்மாட்டாது * அங்கு ஆப்புண்டு இருந்தானால் இன்றுமுற்றும் * அடியுண்டு அழுதானால் இன்றுமுற்றும். ",
            6: "தள்ளித் தளிர்நடையிட்டு * இளம்பிள்ளையாய் * உள்ளத்தின் உள்ளே * அவளை உறநோக்கி *** கள்ளத்தினால்வந்த * பேய்ச்சி முலையுயிர் * துள்ள ச்சுவைத்தானால் இன்றுமுற்றும் * துவக்கற உண்டானால் இன்றுமுற்றும். ",
            7: "மாவலி வேள்வியில் * மாண் உருவாய்ச் சென்று * மூவடி தாவென்று * இரந்த இம்மண்ணினை *** ஓரடியிட்டு * இரண்டாம் அடிதன்னிலே * தாவடியிட்டானால் இன்றுமுற்றும் * தரணியளந்தானால் இன்றுமுற்றும். ",
            8: "தாழை தண்ணாம்பல் * தடம்பெரும் பொய்கைவாய் * வாழுமுதலை * வலைப்பட்டு வாதிப்புண் *** வேழம் துயர்கெட * விண்ணோர் பெருமானாய் * ஆழிபணி கொண்டானால் இன்றுமுற்றும் * அதற்கு அருள்செய்தானால் இன்றுமுற்றும். ",
            9: "வானத்தெழுந்த * மழைமுகில்போல் * எங்கும் கானத்து மேய்ந்து *** களித்து விளையாடி * ஏனத்துருவாய் * இடந்த இம்மண்ணினை * தானத்தே வைத்தானால் இன்றுமுற்றும் * தரணி யிடந்தானால் இன்றுமுற்றும். ",
            10: "🙏 அங்கமலக் கண்ணன் தன்னை * யசோதைக்கு * மங்கை நல்லார்கள் * தாம் வந்து முறைப்பட்ட *** அங்கவர்சொல்லைப் * புதுவைப்கோன் பட்டன்சொல் * இங்கு இவை வல்லவர்க்கு * ஏதம் ஒன்றில்லையே. ",
        }
    };
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};