window.MARKER_DATABASE = window.MARKER_DATABASE || {};

// Global function to trigger the merge on-demand
window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'PAT.3.1.steps':
        {
            1: "🙏 தன்னேர் ஆயிரம் பிள்ளைகளோடு * தளர்நடையிட்டு வருவான் * பொன்னேய் நெய்யொடு பாலமுதுண்டு * ஒருபுள்ளுவன் பொய்யே தவழும் *** மின்னேர் நுண்ணிடை வஞ்சமகள் கொங்கை துஞ்ச * வாய் வைத்த பிரானே! * அன்னே! உன்னை அறிந்துகொண்டேன் * உனக்கு அஞ்சுவன் அம்மம் தரவே. * ",
            2: "பொன்போல் மஞ்சனமாட்டி அமுதூட்டிப் போனேன் * வருமளவு இப்பால் * வன்பார சகடம் இறச்சாடி * வடக்கில் அகம் புக்கிருந்து *** மின்போல் நுண்ணிடையால் ஒருகன்னியை * வேற்றுருவம் செய்துவைத்த * அன்பா! உன்னை அறிந்துகொண்டேன் * உனக்கு அஞ்சுவன் அம்மம்தரவே. * ",
            3: "கும்மாயத்தொடு வெண்ணெய் விழுங்கிக் * குடத்தயிர் சாய்த்துப்பருகி * பொய்ம்மாய மருதான அசுரரைப் * பொன்றுவித்து இன்றுநீவந்தாய் *** இம்மாயம் வல்லபிள்ளை நம்பீ! * உன்னை என்மகனே என்பர் நின்றார் * அம்மா! உன்னை அறிந்துகொண்டேன் * உனக்கு அஞ்சுவன் அம்மம் தரவே. * ",
            4: "மையார்க்கண் மடவாய்ச்சியர் மக்களை * மையன்மை செய்து அவர் பின் போய் * கொய்யார் பூந்துகில் பற்றித்தனிநின்று * குற்றம் பலபல செய்தாய் *** பொய்யா! உன்னைப் புறம் பலபேசுவ * புத்தகத்துக் உள கேட்டேன் * ஐயா! உன்னை அறிந்துகொண்டேன் * உனக்குஅஞ்சுவன்அம்மம்தரவே. * ",
            5: "முப்போதும் கடைந் தீண்டிய வெண்ணெயினோடு * தயிரும் விழுங்கி * கப்பால் ஆயர்கள் காவில் கொணர்ந்த * கலத்தொடு சாய்த்துப்பருகி *** மெய்ப்பாலுண்ட அழுபிள்ளைகள்போல * நீ விம்மி விம்மி ஆழுகின்ற * அப்பா! உன்னை அறிந்துகொண்டேன் * உனக்கு அஞ்சுவன் அம்மம் தரவே. * ",
            6: "கரும்பார் நீள்வயல் காய்கதிர்ச் செந்நெலைக் * கற்றா நிறைமண்டித் தின்ன * விரும்பாக் கன்று ஒன்று கொண்டு * விளங்கனி வீழ எறிந்த பிரானே! *** சுரும்பார் மென்குழல் கன்னியொருத்திக்குச் * சூழ்வலை வைத்துத் திரியும் * அரம்பா! உன்னை அறிந்துகொண்டேன் * உனக்கு அஞ்சுவன் அம்மம் தரவே. * ",
            7: "மருட்டார் மெங்குழல் கொண்டு பொழில்புக்கு * வாய்வைத்து அவ்வாயர் தம்பாடி * சுருட்டார் மென்குழல் கன்னியர் வந்து உன்னைச் * சுற்றும் தொழ நின்ற சோதி! *** பொருட்டாயமிலேன் எம்பெருமான்! * உன்னைப் பெற்ற குற்றமல்லால் * மற்றிங்குஅரட்டா! உன்னை அறிந்துகொண்டேன் * உனக்கு அஞ்சுவன் அம்மம் தரவே. * ",
            8: "வாளாவாகிலும் காணகில்லார் * பிறர் மக்களை மையன்மை செய்து * தோளாலிட்டு அவரோடு திளைத்து * நீ சொல்லப்படாதன செய்தாய் *** கேளார் ஆயர் குலத்தவர் இப்பழி * கெட்டேன்!  வாழ்வில்லை * நந்தன்காளாய்! உன்னை அறிந்துகொண்டேன் * உனக்கு அஞ்சுவன் அம்மம் தரவே. * ",
            9: "தாய்மார் மோர் விற்கப் போவர் * தகப்பன்மார் கற்றாநிறைப்பின்பு போவர் * நீ ஆய்ப்பாடி இளங்கன்னிமார்களை * நேர்படவேகொண்டுபோதி *** காய்வார்க்கு என்றும் உகப்பனவே செய்து * கண்டார் கழறத்திரியும் * ஆயா! உன்னை அறிந்துகொண்டேன் * உனக்கு அஞ்சுவன் அம்மம் தரவே. * ",
            10: "தொத்தார் பூங்குழல் கன்னியொருத்தியைச் * சோலைத் தடம் கொண்டு புக்கு * முத்தார் கொங்கை புணர்ந்து இராநாழிகை * மூவேழு சென்ற பின்வந்தாய் *** ஒத்தார்க்கு ஒத்தன பேசுவர் * உன்னை உரப்பவே நான் ஒன்றும்மாட்டேன் * அத்தா! உன்னை அறிந்துகொண்டேன் * உனக்கு அஞ்சுவன் அம்மம்தரவே. * ",
            11: "🙏 காரார் மேனிநிறத்து ஏம்பிரானைக் * கடிகமழ் பூங்குழலாய்ச்சி * ஆரா இன்னமுது உண்ணத்தருவன் நான் * அம்மம் தாரேனென்றமாற்றம் *** பாரார் தொல் புகழான் புதுவை மன்னன் * பட்டர்பிரான் சொன்ன பாடல் * ஏரார் இன்னிசை மாலைவல்லார் * இருடீகேசன் அடியாரே. * ",
        },
        'PAT.3.2.steps':
        {
            1: "🙏 அஞ்சனவண்ணனை * ஆயர் கோலக்கொழுந்தினை * மஞ்சனமாட்டி * மனைகள் தோறும் திரியாமே *** கஞ்சனைக் காய்ந்த * கழலடி நோவக் கன்றின்பின் * என்செயப் பிள்ளையைப் போக்கினேன்? * எல்லேபாவமே! * ",
            2: "பற்று மஞ்சள் பூசிப் * பாவைமாரொடு பாடியில் * சிற்றில் சிதைத்து எங்கும் * தீமை செய்து திரியாமே *** கற்றுத்தூளியுடை * வேடர் கானிடைக்கன்றின்பின் * எற்றுக்கு என் பிள்ளையைப் போக்கினேன்? * எல்லேபாவமே! * ",
            3: "நன்மணிமேகலை * நங்கைமாரொடு நாள்தொறும் * பொன்மணிமேனி * புழுதியாடித்திரியாமே *** கன்மணி நின்றதிர் * கான் அதரிடைக் கன்றின்பின் * என் மணிவண்ணனைப் போக்கினேன் * எல்லேபாவமே! * ",
            4: "வண்ணக் கருங்குழல் * மாதர்வந்து அலர் தூற்றிட * பண்ணிப்பலசெய்து * இப்பாடி எங்கும் திரியாமே *** கண்ணுக்கினியானைக் * கான் அதரிடைக் கன்றின்பின் * எண்ணற்கரியானைப் போக்கினேன் * எல்லேபாவமே! * ",
            5: "அவ்வவ்விடம்புக்கு * அவ்வாயர் பெண்டிர்க்கு அணுக்கனாய் * கொவ்வைக் கனிவாய் கொடுத்துக் * கூழைமைசெய்யாமே *** எவ்வும் சிலையுடை * வேடர் கானிடைக்கன்றின்பின் * தெய்வத் தலைவனைப் போக்கினேன் * எல்லேபாவமே! * ",
            6: "மிடறு மெழுமெழுத்தோட * வெண்ணெய் விழுங்கிப் போய் * படிறுபலசெய்து * இப்பாடியெங்கும்திரியாமே *** கடிறுபலதிரி * கான் அதரிடைக் கன்றின்பின் * இடற என்பிள்ளையைப் போக்கினேன் * எல்லேபாவமே! * ",
            7: "வள்ளி நுடங்கிடை * மாதர்வந்து அலர்தூற்றிட * துள்ளி விளையாடித் * தோழரோடு திரியாமே *** கள்ளியுணங்கு * வெங் கான் அதரிடைக் கன்றின்பின் * புள்ளின் தலைவனைப் போக்கினேன் * எல்லேபாவமே! * ",
            8: "பன்னிருதிங்கள் * வயிற்றில் கொண்ட அப்பாங்கினால் * என் இளங்கொங்கை * அமுதமூட்டி எடுத்து யான் *** பொன்னடி நோவப் * புலரியே கானில்கன்றின்பின் * என்னிளஞ் சிங்கத்தைப் போக்கினேன் * எல்லேபாவமே! * ",
            9: "குடையும் செருப்பும் கொடாதே * தாமோதரனை நான் * உடையும் கடியன  * ஊன்று வெம்பரற்களுடை *** கடிய வெங்கானிடைக் * காலடிநோவக் கன்றின்பின் * கொடியேன் என்பிள்ளையைப் போக்கினேன் * எல்லேபாவமே! * ",
            10: "🙏 என்றும் எனக்கு இனியானை * என்மணிவண்ணனை * கன்றின் பின் போக்கினேனென்று * அசோதைகழறிய *** பொன் திகழ்மாடப் * புதுவையர் கோன் பட்டன் சொல் * இன்தமிழ் மாலைகள் வல்லவர்க்கு * இடரில்லையே. * ",
        },
        'PAT.3.3.steps':
        {
            1: "🙏 சீலைக்குதம்பை ஒருகாது * ஒருகாது  செந்நிற மேல் தோன்றிப் பூ * கோலப்பணைக் கச்சும் கூறையுடையும் * குளிர் முத்தின் கோடாலமும் *** காலிப் பின்னே வருகின்ற * கடல் வண்ணன் வேடத்தை வந்து காணீர் * ஞாலத்துப்  புத்திரனைப் பெற்றார் * நங்கைமீர்! நானே மற்றாருமில்லை. ",
            2: "கன்னி நன் மாமதிள் சூழ்தரு * பூம்பொழில் காவிரித் தென்னரங்கம் * மன்னியசீர் மதுசூதனா! * கேசவா!  பாவியேன் வாழ்வுகந்து *** உன்னை இளங்கன்று மேய்க்கச் * சிறுகாலேயூட்டி ஒருப்படுத்தேன் * என்னின் மனம் வலியாள் ஒரு பெண் இல்லை * என் குட்டனே முத்தம்தா. * ",
            3: "காடுகளூடு போய்க் * கன்றுகள் மேய்த்து மறியோடி * கார்க்கோடல் பூச் சூடி வருகின்ற தாமோதரா! * கற்றுத் தூளிகாண் உன்னுடம்பு *** பேடை மயிற் சாயல் பின்னை மணாளா! * நீராட்டமைத்து வைத்தேன் * ஆடி அமுதுசெய் அப்பனும் உண்டிலன் * உன்னோடு உடனே உண்பான். * ",
            4: "கடியார் பொழிலணி வேங்கடவா! * கரும் போரேறே! * நீயுகக்கும் குடையும் செருப்பும் குழலும் தருவிக்கக் *  கொள்ளாதே போனாய் மாலே! *** கடிய வெங்கானிடைக் கன்றின் பின் போன * சிறுக் குட்டச் செங்கமல  அடியும் வெதும்பி * உன் கண்கள் சிவந்தாய் அசைந்திட்டாய் * நீ எம்பிரான்! ",
            5: "பற்றார் நடுங்க முன் பாஞ்சசன்னியத்தை * வாய் வைத்த போரேறே! * என் சிற்றாயர் சிங்கமே! சீதை மணாளா! * சிறுக்குட்டச் செங்கண்மாலே! *** சிற்றாடையும் சிறுப் பத்திரமும் * இவை கட்டிலின் மேல் வைத்துப் போய் * கற்றாயரோடு நீ கன்றுகள் மேய்த்துக் * கலந்துடன் வந்தாய் போலும். * ",
            6: "அஞ்சுடராழி உன்கையகத்து ஏந்தும்  * அழகா! நீ பொய்கை புக்கு * நஞ்சுமிழ் நாகத்தினோடு பிணங்கவும் * நான் உயிர் வாழ்ந்திருந்தேன் *** என் செய்ய என்னை வயிறு மறுக்கினாய்? * ஏதும் ஓர் அச்சமில்லை * கஞ்சன் மனத்துக்கு உகப்பனவே செய்தாய் * காயாம் பூவண்ணம் கொண்டாய்! * ",
            7: "பன்றியும் ஆமையும் மீனமுமாகிய * பாற்கடல்வண்ணா! உன் மேல்  * கன்றின் உருவாகி மேய் புலத்தே வந்த * கள்ள அசுரன் தன்னை *** சென்று பிடித்துச் சிறுக் கைகளாலே * விளங்காய் எறிந்தாய் போலும் * என்றும் என் பிள்ளைக்குத் தீமைகள்  செய்வார்கள் * அங்கனமாவர்களே. * ",
            8: "கேட்டு அறியாதன கேட்கின்றேன் * கேசவா! கோவலர் இந்திரற்கு * காட்டிய சோறும் கறியும் தயிரும் * கலந்துடன் உண்டாய் போலும் *** ஊட்ட முதலிலேன் உன் தன்னைக் கொண்டு * ஒரு போதும் எனக்கரிது * வாட்டமிலாப் புகழ் வாசுதேவா! * உன்னை அஞ்சுவன் இன்று தொட்டும். * ",
            9: "திண்ணார் வெண்சங் குடையாய்! * திருநாள் திருவோணம் இன்றேழுநாள் * முன்பண்ணேர் மொழியாரைக் கூவிமுளையட்டிப் * பல்லாண்டு கூறுவித்தேன் *** கண்ணாலம்செய்யக் * கறியும் கலத்தரிசியும் ஆக்கிவைத்தேன் * கண்ணா நீ நாளைத் தொட்டுக்  கன்றின்பின் போகேல் * கோலம் செய்திங்கேயிரு. * ",
            10: "🙏 புற்றரவல்குல் அசோதை நல்லாய்ச்சி * தன் புத்திரன் கோவிந்தனை * கற்றினம் மேய்த்துவரக் கண்டுகந்து * அவள் கற்பித்த மாற்றமெல்லாம் *** செற்றமிலாதவர் வாழ்தரு * தென்புதுவை விட்டுசித்தன் சொல் * கற்றிவை பாட வல்லார் * கடல்வண்ணன் கழலிணை காண்பர்களே. ",
        },
        'PAT.3.4.steps':
        {
            1: "🙏 தழைகளும் தொங்கலும் ததும்பி எங்கும் * தண்ணுமை எக்கம் மத்தளிதாழ் பீலி * குழல்களும் கீதமுமாகி  எங்கும் * கோவிந்தன் வருகின்ற கூட்டம் கண்டு *** மழை கொலோ வருகின்றதென்று சொல்லி * மங்கைமார் சாலக வாசல் பற்றி * நுழைவனர் நிற்பனராகி எங்கும் * உள்ளம் விட்டு ஊண் மறந்தொழிந்தனரே. * ",
            2: "வல்லி நுண் இதழன்ன ஆடை கொண்டு * வசையறத் திருவரை விரித்துடுத்து * பல்லி நுண் பற்றாக உடைவாள் சாத்திப் * பணைக்கச்சு உந்திப் பலதழை நடுவே *** முல்லை நல் நறுமலர் வேங்கை மலர் அணிந்து * பல்லாயர் குழாம் நடுவே * எல்லியம் போதாகப் பிள்ளைவரும் * எதிர் நின்று அங்கு இனவளை இழவேன்மினே * ",
            3: "சுரிகையும் தெறிவில்லும் செண்டுகோலும் * மேலாடையும் தோழன்மார் கொண்டோட * ஒரு கையால் ஒருவன் தன் தோளையூன்றி * ஆநிரை இனம் மீளக் குறித்த சங்கம் *** வருகையில் வாடிய பிள்ளை கண்ணன் * மஞ்சளும் மேனியும் வடிவும் கண்டாள் * அருகே நின்றாள் என்பெண் நோக்கிக் கண்டாள் * அதுகண்டு இவ்வூர் ஒன்று புணர்க்கின்றதே. * ",
            4: "குன்றெடுத்து ஆநிரைகாத்த பிரான் * கோவலனாய்க் குழலூதி யூதி * கன்றுகள் மேய்த்துத் தன்தோழரோடு * கலந்து உடன் வருவானைத் தெருவில்கண்டு *** என்றும் இவனை ஒப்பாரை நங்காய் * கண்டறியேன் ஏடி! வந்துகாணாய் * ஒன்றும் நில்லா வளை கழன்று * துகில் ஏந்து இளமுலையும் என் வசமல்லவே. * ",
            5: "சுற்றிநின்று ஆயர் தழைகள் இடச் * சுருள் பங்கி நேத்திரத்தால் அணிந்து * பற்றி நின்று ஆயர் கடைத்தலையே * பாடவும் ஆடக்கண்டேன் *** அன்றிப்பின்மற்றொருவர்க்கு என்னைப் பேசலொட்டேன் * மாலிருஞ்சோலை எம் ஆயற்கல்லால் * கொற்றவனுக்கு இவளாம் என்றெண்ணிக் * கொடுமின்கள் கொடீராகில் கோழம்பமே. * ",
            6: "சிந்துரமிலங்கத் தன் திருநெற்றிமேல் * திருத்திய கோறம்பும் திருக்குழலும் * அந்தரம் முழவம் தண் தழைக் காவின்கீழ் * வரும் ஆயரோடு உடன் வளைகோல் வீச *** அந்தம் ஒன்றில்லாத ஆயப் பிள்ளை * அறிந்தறிந்து இவ்வீதி போதுமாகில் * பந்துகொண்டானென்று வளைத்து வைத்துப் * பவளவாய் முறுவலும் காண்போம் தோழீ! * ",
            7: "சாலப்பல் நிரைப்பின்னே தழைக்காவின்கீழ் * தன் திருமேனி நின்றொளி திகழ * நீல நல் நறுங் குஞ்சி நேத்திரத்தால் அணிந்து * பல்லாயர் குழாம் நடுவே *** கோலச் செந்தாமரைக் கண் மிளிரக் * குழல் ஊதி இசை பாடிக் குனித்து * ஆயரோடுஆலித்து வருகின்ற ஆயப் பிள்ளை * அழகுகண்டு என்மகள் அயர்க்கின்றதே. * ",
            8: "சிந்துரப் பொடிக்கொண்டு சென்னி அப்பித் * திருநாமம் இட்டு அங்கோர் இலையந் தன்னால் * அந்தரமின்றித் தன்னெறி பங்கியை * அழகிய நேத்திரத்தால் அணிந்து *** இந்திரன் போல் வரும் ஆயப்பிள்ளை * எதிர்நின்று அங்கு இனவளை இழவேல் என்ன * சந்தியில் நின்று கண்டீர் * நங்கைதன்  துகிலொடு சரிவளை கழல்கின்றதே. * ",
            9: "வலங்காதின் மேல் தோன்றிப் பூவணிந்து * மல்லிகை வனமாலை மௌவல் மாலை * சிலிங்காரத்தால் குழல் தாழவிட்டுத் * தீங்குழல் வாய்மடுத் தூதி யூதி *** அலங்காரத்தால் வரும் ஆய்ப்பிள்ளை * அழகுகண்டு என்மகள் ஆசைப்பட்டு * விலங்கி நில்லாது எதிர் நின்று கண்டீர் * வெள்வளை கழன்று மெய் மெலிகின்றதே. * ",
            10: "🙏 விண்ணின் மீது அமரர்கள் விரும்பித்தொழ * மிறைத்து ஆயர்ப் பாடியில் வீதியூடே * கண்ணன் காலிப்பின்னே எழுந்தருளக்கண்டு * இளவாய்க் கன்னிமார் காமுற்றவண்ணம் *** வண்டமர் பொழில் புதுவையர்கோன் * விட்டுசித்தன் சொன்னமாலை பத்தும் * பண்ணின்பம் வரப்பாடும் பத்தருள்ளார் * பரமான வைகுந்தம் நண்ணுவரே. * ",
        },
        'PAT.3.5.steps':
        {
            1: "🙏 அட்டுக்குவி சோற்றுப் பருப்பதமும் * தயிர் வாவியும் நெய் அளறும் அடங்கப்பொட்டத் துற்று * மாரிப் பகைபுணர்த்த * பொருமா கடல்வண்ணன் பொறுத்தமலை *** வட்டத் தடங்கண் மடமான் கன்றினை * வலைவாய்ப் பற்றிக் கொண்டு * குற மகளிர்கொட்டைத் தலைப் பால் கொடுத்து வளர்க்கும் * கோவர்த்தனமென்னும் கொற்றக்குடையே. * ",
            2: "வழுவொன்றுமில்லாச் செய்கை வானவர்கோன் * வலிப்பட்டு முனிந்து விடுக்கப்பட்ட * மழைவந்து எழுநாள் பெய்து மாத்தடைப்ப * மதுசூதன் எடுத்து மறித்தமலை *** இழவு தரியாததோர் ஈற்றுப்பிடி * இளஞ்சீயம் தொடர்ந்து முடுகுதலும் * குழவியிடைக் காலிட்டு எதிர்ந்து பொரும் * கோவர்த்தனம் என்னும் கொற்றக்குடையே. * ",
            3: "அம்மைத் தடங்கண் மடவாய்ச்சியரும் * ஆனாயரும் ஆநிரையும் அலறி * எம்மைச் சரண் என்று கொள் என்றிரப்ப * இலங்காழிக்கை எந்தை எடுத்தமலை *** தம்மைச் சரணென்ற தம் பாவையரைப் * புனமேய்கின்ற மானினம் காண்மின் என்று * கொம்மைப் புயம் குன்றர் சிலைகுனிக்கும் * கோவர்த்தனம் என்னும் கொற்றக்குடையே. * ",
            4: "கடுவாய்ச்சின வெங்கண் களிற்றினுக்குக் * கவளம் எடுத்துக் கொடுப்பான் அவன் போல் * அடிவாய் உறக்கை இட்டு எழப் பறித்திட்டு * அமரர் பெருமான் கொண்டு நின்றமலை *** கடல்வாய்ச் சென்று மேகம் கவிழ்ந்து இறங்கிக் * கதுவாய்ப்பட நீர்முகந் தேறி * எங்கும்குடவாய்ப்பட நின்று மழைபொழியும் * கோவர்த்தனம் என்னும் கொற்றக்குடையே. * ",
            5: "வானத்தில் உள்ளீர்! வலியீர் உள்ளீரேல் * அறையோ! வந்து வாங்குமின் என்பவன் போல் * ஏனத்துருவாகிய ஈசன் எந்தை * இடவன் எழ வாங்கி எடுத்தமலை *** கானக் களியானைதன் கொம்பு இழந்து * கதுவாய் மதம் சோரத் தன் கையெடுத்து * கூனல் பிறைவேண்டி அண்ணாந்து நிற்கும் * கோவர்த்தனம் என்னும் கொற்றக்குடையே. * ",
            6: "செப்பாடுடைய திருமாலவன் தன் * செந்தாமரைக் கைவிரல் ஐந்தினையும் * கப்பாக மடுத்து மணிநெடுந்தோள் * காம்பாகக் கொடுத்துக் கவித்தமலை *** எப்பாடும் பரந்திழி தெள்ளருவி * இலங்கு மணி முத்து வடம் பிறழ * குப்பாயமென நின்று காட்சி தரும் * கோவர்த்தனம் என்னும் கொற்றக்குடையே. * ",
            7: "படங்கள் பலவும் உடைப் பாம்பரையன் * படர் பூமியைத் தாங்கிக் கிடப்பவன்போல் * தடங்கை விரல் ஐந்தும் மலர வைத்துத் * தாமோதரன் தாங்கு தடவரைதான் *** அடங்கச் சென்று இலங்கையை ஈடழித்த * அனுமன் புகழ் பாடித் தம் குட்டன்களை * குடங்கைக் கொண்டு மந்திகள் கண்வளர்த்தும் * கோவர்த்தனம் என்னும் கொற்றக்குடையே. * ",
            8: "சலமாமுகில் பல்கணப் போர்க்களத்துச் * சரமாரி பொழிந்து எங்கும் பூசலிட்டு * நலிவான் உறக் கேடகம் கோப்பவன் போல் * நாராயணன் முன்முகம் காத்தமலை *** இலை வேய் குரம்பைத் தவ மாமுனிவர் * இருந்தார் நடுவேசென்று அணார் சொறிய * கொலைவாய்ச்சின வேங்கைகள் நின்று உறங்கும் * கோவர்த்தனம் என்னும் கொற்றக்குடையே. * ",
            9: "வன்பேய் முலையுண்ட தோர் வாயுடையன் * வன் தூணென நின்றதோர் வன் பரத்தை * தன்பேரிட்டுக் கொண்டு தரணி தன்னில் * தாமோதரன் தாங்கு தடவரைதான் *** முன்பே வழிகாட்ட முசுக் கணங்கள் * முதுகில் பெய்து தம்முடைக் குட்டன்களை * கொம்பு ஏற்றியிருந்து குதி பயிற்றும் * கோவர்த்தனம் என்னும் கொற்றக்குடையே. * ",
            10: "கொடியேறு செந்தாமரைக் கைவிரல்கள் * கோலமும் அழிந்தில வாடிற்றில * வடிவேறு திருவுகிர் நொந்துமில * மணிவண்ணன் மலையுமோர் சம்பிரதம் *** முடியேறிய மாமுகிற் பல் கணங்கள் * முன்னெற்றி நரைத்தன போல * எங்கும்குடியேறி இருந்து மழைபொழியும் * கோவர்த்தனம் என்னும் கொற்றக்குடையே * . ",
            11: "🙏 அரவில் பள்ளிகொண்டு அரவம் துரந்திட்டு * அரவப் பகையூர்தி அவனுடைய * குரவிற்கொடி முல்லைகள் நின்று உறங்கும் * கோவர்த்தனம் என்னும் கொற்றக்குடைமேல் *** திருவிற் பொலிமறை வாணர் புத்தூர்த் திகழ் * பட்டர்பிரான் சொன்ன மாலைபத்தும் * பரவு மன நன்குடைப் பத்தருள்ளார் * பரமான வைகுந்தம் நண்ணுவரே. * ",
        },
        'PAT.3.6.steps':
        {
            1: "🙏 நாவலம் பெரிய தீவினில் வாழும் * நங்கைமீர்கள்! இதோர் அற்புதம் கேளீர் * தூவலம்புரி உடைய திருமால் * தூய வாயில் குழலோசை வழியே *** கோவலர் சிறுமியர் இளங்கொங்கை குதுகலிப்ப * உடல் உள் அவிழ்ந்து * எங்கும்காவலும் கடந்து கயிறு மாலையாகி * வந்து கவிழ்ந்து நின்றனரே. * ",
            2: "இடவணரை இடத் தோளொடு சாய்த்து * இருகை கூடப் புருவம் நெரிந்து ஏற * குடவயிறு படவாய் கடை கூடக் * கோவிந்தன் குழல்கொடு ஊதினபோது *** மடமயில்களொடு மான் பிணைபோலே * மங்கைமார்கள் மலர்க் கூந்தல் அவிழ * உடை நெகிழ ஓர் கையால் துகில்பற்றி * ஒல்கி ஓடு அரிக் கண் ஓட நின்றனரே. * ",
            3: "வான் இளவரசு வைகுந்தக் குட்டன் * வாசுதேவன் மதுரைமன்னன் * நந்தகோன் இளவரசு கோவலர் குட்டன் * கோவிந்தன் குழல்கொடு ஊதினபோது *** வானிளம் படியர் வந்து வந்தீண்டி * மனமுருகி மலர்க் கண்கள் பனிப்ப * தேனளவு செறிகூந்தலவிழச் * சென்னி வேர்ப்பச் செவிசேர்த்து நின்றனரே. * ",
            4: "தேனுகன் பிலம்பன் காளியன் என்னும் * தீப்பப் பூடுகள் அடங்க உழக்கி * கானகம்படி உலாவி உலாவிக் * கருஞ் சிறுக்கன் குழலூதின போது *** மேனகையொடு திலோத்தமை அரம்பை * உருப்பசி அரவர் வெள்கி மயங்கி * வானகம் படியில் வாய் திறப்பின்றி * ஆடல் பாடலவை மாறினர் தாமே * . ",
            5: "முன்நரசிங்கமதாகி  அவுணன் முக்கியத்தை முடிப்பான் *  மூவுலகில்மன்னர் அஞ்சும் * மதுசூதனன் வாயில் குழலினோசை * செவியைப் பற்றி வாங்க *** நன்னரம்புடைய தும்புருவோடு * நாரதனும் தம்தம் வீணை மறந்து * கின்னர மிதுனங்களும் தம்தம் கின்னரம் * தொடுகிலோம் என்றனரே. * ",
            6: "செம்பெருந் தடங்கண்ணன் திரள்தோளன் * தேவகி சிறுவன் தேவர்கள் சிங்கம் * நம் பரமன் இந்நாள் குழலூதக்  கேட்டவர்கள் * இடர் உற்றன கேளீர் *** அம்பரம் திரியும் காந்தப்பர் எல்லாம் * அமுத கீத வலையால் சுருக்குண்டு * நம் பரமன் என்று நாணி மயங்கி * நைந்து சோர்ந்து கை மறித்து நின்றனரே. * ",
            7: "புவியுள் நான் கண்டதோர் அற்புதம் கேளீர் * பூணி மேய்க்கும் இளங் கோவலர் கூட்டத்து அவையுள் * நாகத்தணையான் குழலூத * அமர லோகத்தளவும் சென்றிசைப்ப *** அவியுணா மறந்து வானவரெல்லாம் * ஆயர்பாடி நிறையப் புகுந்து ஈண்டி * செவியுணாவின் சுவை கொண்டு மகிழ்ந்து * கோவிந்தனைத் தொடர்ந்து என்றும் விடாரே. * ",
            8: "சிறுவிரல்கள் தடவிப் பரிமாறச் * செங்கண் கோடச் செய்ய வாய் கொப்பளிக்க * குறு வெயர்ப் புருவம் கூடலிப்பக் * கோவிந்தன் குழல் கொடு ஊதினபோது *** பறவையின் கணங்கள் கூடு துறந்து * வந்து சூழ்ந்து படு காடு கிடப்ப * கறவையின் கணங்கள் கால் பரப்பிட்டுக் * கவிழ்ந்து இறங்கிச் செவி ஆட்டகில்லாவே. * ",
            9: "திரண்டு எழு தழை மழை முகில்வண்ணன் * செங்கமல மலர்சூழ் வண்டினம் போலே * சுருண்டு இருண்ட குழல் தாழ்ந்த முகத்தான் * ஊதுகின்ற குழலோசை வழியே *** மருண்டு மான் கணங்கள் மேய்கை மறந்து * மேய்ந்த புல்லும் கடைவாய் வழிசோர * இரண்டுபாடும் துலங்காப் புடை பெயரா * எழுது சித்திரங்கள் போல நின்றனவே. * ",
            10: "கருங்கண் தோகைமயிற் பீலியணிந்து * கட்டி நன்கு உடுத்த பீதகவாடை * அருங் கலம் உருவின் ஆயர் பெருமான் * அவன் ஒருவன் குழலூதின போது *** மரங்கள் நின்று மது தாரைகள் பாயும் * மலர்கள் வீழும் வளர் கொம்புகள் தாழும் * இரங்கும் கூம்பும் திருமால் நின்ற நின்ற பக்கம் நோக்கி * அவை செய்யும் குணமே. * ",
            11: "🙏 குழல் இருண்டு சுருண்டு ஏறிய குஞ்சிக் * கோவிந்தனுடைய கோமள வாயில் * குழல் முழைஞ்சுகளினூடு குமிழ்த்துக் * கொழித்து இழிந்த அமுதப் புனல் தன்னை *** குழல் முழவம் விளம்பும் புதுவைக்கோன் * விட்டுசித்தன் விரித்த தமிழ்வல்லார் * குழலை வென்ற குளிர் வாயினர் ஆகிச் * சாது கோட்டியுள் கொள்ளப் படுவாரே. * ",
        },
        'PAT.3.7.steps':
        {
            1: "🙏 ஐய புழுதி உடம்பளைந்து * இவள் பேச்சும் அலந்தலையாய் * செய்ய நூலின் சிற்றாடை * செப்பன் உடுக்கவும் வல்லள் அல்லள் *** கையினில் சிறு தூதையோடு * இவள் முற்றில் பிரிந்தும் இலள் * பையரவணைப் பள்ளியானொடு * கைவைத்து இவள் வருமே. * ",
            2: "வாயில் பல்லும் எழுந்தில * மயிரும் முடி கூடிற்றில * சாய்விலாத குறுந்தலைச் * சில பிள்ளைகளோடு இணங்கி *** தீ இணக்கு இணங்காடி வந்து * இவள் தன்னன்ன செம்மைசொல்லி * மாயன் மாமணிவண்ணன் மேல் * இவள் மாலுறுகின்றாளே. * ",
            3: "பொங்கு வெண்மணல் கொண்டு * சிற்றிலும் முற்றத்து இழைக்கல் உறில் * சங்கு சக்கரம் தண்டு வாள் * வில்லும் அல்லது இழைக்கல் உறாள் *** கொங்கை இன்னம் குவிந்து எழுந்தில * கோவிந்தேனாடு இவளை * சங்கையாகி என்னுள்ளம் * நாள்தொறும் தட்டுளுப்பாகின்றதே. * ",
            4: "ஏழை பேதை ஓர் பாலகன் வந்து * என் பெண்மகளை எள்கி * தோழிமார் பலர் கொண்டு போய்ச் * செய்த சூழ்ச்சியை யார்க்குரைக்கேன்? *** ஆழியானென்னும் ஆழம் மோழையில் * பாய்ச்சி அகப்படுத்தி * மூழை உப்பு அறியாதது என்னும் * மூதுரையும் இலளே. * ",
            5: "நாடும் ஊரும் அறியவே போய் * நல்ல துழாய் அலங்கல் –சூடி * நாரணன் போம் இடமெல்லாம் * சோதித்து ஊழி தருகின்றாள் *** கேடு வேண்டுகின்றார் பலர் உளர் * கேசவேனாடு இவளை * பாடு காவல் இடுமின் என்றென்று * பார் தடுமாறினதே. * ",
            6: "பட்டம் கட்டிப் பொன் தோடு பெய்து * இவள் பாடகமும் சிலம்பும் * இட்டமாக வளர்த்து எடுத்தேனுக்கு * என்னோடு இருக்கலுறாள் *** பொட்டப் போய்ப் புறப்பட்டு நின்று * இவள் பூவைப் பூவண்ணாவென்னும் * வட்டவார் குழல் மங்கைமீர்! * இவள் மாலுறுகின்றாளே. * ",
            7: "பேசவும் தரியாத பெண்மையின் * பேதையேன் பேதை இவள் * கூசமின்றி நின்றார்கள் தம்மெதிர் * கோல் கழிந்தான் மூழையாய் *** கேசவாவென்றும் கேடிலீயென்றும் * கிஞ்சுகம் வாய் மொழியாள் * வாசவார் குழல் மங்கைமீர்! * இவள் மாலுறுகின்றாளே. * ",
            8: "காறை பூணும் கண்ணாடி காணும் * தன் கையில் வளை குலுக்கும் * கூறையுடுக்கும் அயர்க்கும் * தன் கொவ்வைச் செவ்வாய் திருத்தும் *** தேறித்தேறி நின்று ஆயிரம்பேர்த் * தேவன் திறம் பிதற்றும் * மாறில் மாமணிவண்ணன் மேல் * இவள் மாலுறுகின்றாளே. * ",
            9: "கைத் தலத்துள்ள மாடழியக் * கண்ணாலங்கள் செய்து * இவளைவைத்து வைத்துக் கொண்டு என்ன வாணிபம்? * நம்மை வடுப்படுத்தும் *** செய்த்தலை எழு நாற்றுப்போல் * அவன் செய்வன செய்து கொள்ள * மைத்தட முகில் வண்ணன் பக்கல் * வளர விடுமின்களே. * ",
            10: "பெருப் பெருத்த கண்ணாலங்கள் செய்து * பேணி நம் இல்லத்துள்ளே * இருத்துவான் எண்ணி நாமிருக்க * இவளும் ஒன்று எண்ணுகின்றாள் *** மருத்துவப் பதம் நீங்கினாள் என்னும் * வார்த்தை படுவதன் முன் * ஒருப் படுத்திடுமின் இவளை * உலகளந்தானிடைக்கே. * ",
            11: "🙏 ஞாலமுற்றும் உண்டு ஆலிலைத் துயில் * நாராயணனுக்கு * இவள்மாலதாகி மகிழ்ந்தனள் என்று * தாயுரை செய்ததனை *** கோலமார் பொழில் சூழ் புதுவையர்கோன் * விட்டுசித்தன்சொன்ன * மாலை பத்தும் வல்லவர்கட்கு * இல்லை வருதுயரே. * ",
        },
        'PAT.3.8.steps':
        {
            1: "🙏 நல்லதோர் தாமரைப் பொய்கை * நாண் மலர் மேல் பனி சோர * அல்லியும் தாதும் உதிர்ந்திட்டு * அழகு அழிந்தால் ஒத்ததாலோ *** இல்லம் வெறியோடிற்றாலோ * என் மகளை எங்கும் காணேன் * மல்லரை அட்டவன் பின்போய் * மதுரைப் புறம் புக்காள் கொலோ? * ",
            2: "ஒன்றும் அறிவொன்றில்லாத * உருவறைக் கோபாலர் தங்கள் * கன்று கால் மாறுமா போலே * கன்னி இருந்தாளைக் கொண்டு *** நன்றும் கிறி செய்து போனான் * நாராயணன் செய்த தீமை * என்றும் எமர்கள் குடிக்கு * ஓர் ஏச்சுக் கொல் ஆயிடுங் கொலோ? * ",
            3: "குமரி மணம் செய்து கொண்டு * கோலம் செய்து இல்லத்து இருத்தி * தமரும் பிறரும் அறியத் * தாமோதரற்கு என்று சாற்றி *** அமரர் பதியுடைத் தேவி * அரசாணியை வழிபட்டு * துமிலம் எழப் பறை கொட்டித் * தோரணம் நாட்டிடுங் கொலோ? * ",
            4: "ஒருமகள் தன்னையுடையேன் * உலகம் நிறைந்த புகழால் * திருமகள் போல வளர்த்தேன் * செங்கண்மால்தான் கொண்டு போனான் *** பெருமகளாய்க் குடிவாழ்ந்து * பெரும் பிள்ளை பெற்ற அசோதை * மருமகளைக் கண்டுகந்து * மணாட்டுப்புறம் செய்யுங் கொலோ? * ",
            5: "தம் மாமன் நந்தகோபாலன் * தழீஇக் கொண்டு என் மகள் தன்னை * செம்மாந்து இரு என்று சொல்லிச் * செழுங்கயற் கண்ணும் செவ்வாயும் *** கொம்மை முலையும் இடையும் * கொழும் பணைத் தோள்களும் கண்டிட்டு * இம்மகளைப் பெற்ற தாயர் * இனித் தரியாரென்னுங் கொலோ? * ",
            6: "வேடர் மறக்குலம் போலே * வேண்டிற்றுச் செய்து என்மகளை * கூடிய கூட்டமேயாகக் * கொண்டு குடிவாழுங்கொலோ? *** நாடும் நகரும் அறிய * நல்லதோர் கண்ணாலம் செய்து * சாடிறப் பாய்ந்த பெருமான் * தக்க ஆ கைப்பற்றுங்கொலோ? * ",
            7: "அண்டத்தமரர் பெருமான் * ஆழியான் இன்று என்மகளை * பண்டப் பழிப்புக்கள் சொல்லிப் * பரிசற ஆண்டிடுங் கொலோ? *** கொண்டு குடிவாழ்க்கை வாழ்ந்து * கோவலப் பட்டம் கவித்து * பண்டை மணாட்டிமார் முன்னே * பாதுகாவல் வைக்குங்கொலோ? * ",
            8: "குடியில் பிறந்தவர் செய்யும் * குணமொன்றும் செய்திலன் அந்தோ! * நடையொன்றும் செய்திலன் நங்காய்! * நந்தகோபன் மகன் கண்ணன் *** இடை இருபாலும் வணங்க * இளைத்திளைத்து என் மகள் ஏங்கி * கடை கயிறே பற்றி வாங்கிக் * கை தழும்பு ஏறிடுங் கொலோ? * ",
            9: "வெண்ணிறத்தோய் தயிர்தன்னை * வெள்வரைப்பின் முன் எழுந்து * கண்ணுறங்காதே இருந்து * கடையவும் தான் வல்லள்கொலோ? *** ஒண்ணிறத் தாமரைச் செங்கண் * உலகளந்தான் என்மகளை * பண்ணறையாப் பணிகொண்டு * பரிசு அற அண்டிடுங்கொலோ? * ",
            10: "🙏 மாயவன் பின் வழிசென்று * வழியிடை மாற்றங்கள் கேட்டு * ஆயர்கள் சேரியிலும் புக்கு * அங்குத்தை மாற்றமும் எல்லாம் *** தாயவள் சொல்லிய சொல்லைத் * தண் புதுவைப்பட்டன் சொன்ன * தூய தமிழ்ப் பத்தும் வல்லார் * தூமணிவண்ணனுக்காளரே. * ",
        },
        'PAT.3.9.steps':
        {
            1: "🙏 என் நாதன் தேவிக்கு * அன்று இன்பப்பூ ஈயாதாள் * தன் நாதன் காணவே * தண் பூமரத்தினை *** வன்னாதப் புள்ளால் * வலியப் பறித்திட்ட * என் நாதன் வன்மையைப் பாடிப்பற * எம்பிரான் வன்மையைப் பாடிப்பற. * ",
            2: "என் வில்வலி கண்டு * போவென்று எதிர்வந்தான் * தன் வில்லினோடும் * தவத்தை எதிர்வாங்கி *** முன் வில் வலித்து * முது பெண்ணுயிருண்டான் * தன் வில்லின் வன்மையைப் பாடிப்பற * தாசரதி தன்மையைப் படிப்பற. * ",
            3: "உருப்பிணி நங்கையைத் * தேரேற்றிக் கொண்டு * விருப்புற்று அங்கேக * விரைந்து எதிர்வந்து *** செருக் குற்றான் வீரம் சிதைய * தலையைச்சிரைத்திட்டான் வன்மையைப் பாடிப்பற * தேவகி சிங்கத்தைப் பாடிப்பற. * ",
            4: "மாற்றுத் தாய் சென்று * வனம் போகே என்றிட * ஈற்றுத் தாய் பின்தொடர்ந்து * எம்பிரான்! என்றுஅழ *** கூற்றுத் தாய் சொல்லக் * கொடிய வனம் போன * சீற்றமிலாதானைப் பாடிப்பற * சீதை மணாளனைப் பாடிப்பற. * ",
            5: "பஞ்சவர் தூதனாய்ப் * பாரதம் கைசெய்து * நஞ்சுமிழ் நாகம்  கிடந்த * நல்பொய்கை புக்கு *** அஞ்சப்பணத்தின்மேல் * பாய்ந்திட்டு அருள் செய்த * அஞ்சன வண்ணனைப் பாடிப்பற * அசோதைதன் சிங்கத்தைப் பாடிப்பற. * ",
            6: "முடியொன்றி * மூவுலகங்களும் ஆண்டு * உன்அடியேற்கு அருளென்று * அவன்பின் தொடர்ந்த *** படியில் குணத்துப் * பரதநம்பிக்கு * அன்றுஅடிநிலை யீந்தானைப் பாடிப்பற * அயோத்தியர் கோமானைப் பாடிப்பற. * ",
            7: "காளியன் பொய்கை * கலங்கப் பாய்ந்திட்டு * அவன்நீள் முடி ஐந்திலும் * நின்று நடம் செய்து *** மீள அவனுக்கு * அருள் செய்த வித்தகன் * தோள்வலி வீரமே பாடிப்பற * தூமணி வண்ணனைப் பாடிப்பற. * ",
            8: "தார்க்கு இளந் தம்பிக்கு * அரசீந்து * தண்டகம்நூற்றவள்  சொல் கொண்டு * போகி  நுடங்கிடைச் *** சூர்ப்பணகாவைச் * செவியொடு மூக்கு * அவள்ஆர்க்க அரிந்தானைப் பாடிப்பற * அயோத்திக்கரசனைப் பாடிப்பற. * ",
            9: "மாயச் சகடமுதைத்து * மருது இறுத்து * ஆயர்களோடுபோய் * ஆநிரைகாத்து *** அணிவேயின் குழலூதி * வித்தகனாய்நின்ற * ஆயர்களேற்றினைப் பாடிப்பற * ஆநிரைமேய்த்தானைப் பாடிப்பற. * ",
            10: "காரார் கடலை * அடைத்திட்டு  இலங்கைபுக்கு * ஓராதான் பொன்முடி * ஒன்பதோடொன்றையும் *** நேரா அவன் தம்பிக்கே * நீள் அரசீந்த * ஆராவமுதனைப் பாடிப்பற * அயோத்தியர் வேந்தனைப் பாடிப்பற. * ",
            11: "🙏 நந்தன் மதலையைக் * காகுத்தனை நவின்று * உந்திபறந்த * ஒளியிழையார்கள் சொல் *** செந்தமிழ்த் தென்புதுவை * விட்டுசித்தன்சொல் * ஐந்தினோடைந்தும் வல்லார்க்கு * அல்லலில்லையே. * ",
        },
        'PAT.3.10.steps':
        {
            1: "🙏 நெறிந்த கருங்குழல் மடவாய்! * நின்னடியேன் விண்ணப்பம் * செறிந்த மணி முடிச்சனகன் * சிலையிறுத்து நினைக்கொணர்ந்ததுஅறிந்து *** அரசுகளைகட்ட * அருந்தவத்தோன் இடை விலங்க * செறிந்த சிலை கொடு தவத்தைச் * சிதைத்ததும் ஓரடையாளம். * ",
            2: "அல்லியம் பூமலர்க் கோதாய்! * அடிபணிந்தேன் விண்ணப்பம் * சொல்லுகேன் கேட்டருளாய் * துணை மலர்க்கண் மடமானே! *** எல்லியம் போது இனிது இருத்தல் * இருந்ததோர் இட வகையில் * மல்லிகை மாமாலை கொண்டு * அங்கு ஆர்த்ததும் ஓரடையாளம். * ",
            3: "கலக்கிய மாமனத்தனளாய்க் * கைகேசி வரம் வேண்ட * மலக்கிய மாமனத்தனனாய் * மன்னவனும் மறாதொழிய *** குலக் குமரா! காடுறையப் * போ என்று  விடைகொடுப்ப * இலக்குமணன் தன்னொடும் * அங்கு ஏகியது ஓரடையாளம். * ",
            4: "வாரணிந்த முலை மடவாய்! * வைதேவீ! விண்ணப்பம் * தேரணிந்த அயோத்தியர் கோன் * பெருந்தேவீ! கேட்டருளாய் *** கூரணிந்த வேல் வலவன் * குகேனாடும் கங்கை தன்னில் * சீரணிந்த தோழமை * கொண்டதும் ஓரடையாளம். * ",
            5: "மான் அமரும் மெல் நோக்கி! * வைதேவீ! விண்ணப்பம் * கானமரும் கல் அதர் போய்க் * காடுறைந்த காலத்து *** தேனமரும் பொழிற் சாரல் * சித்திர கூடத்து இருப்ப * பால் மொழியாய்! பரதநம்பி * பணிந்ததும் ஓரடையாளம். * ",
            6: "சித்திரகூடத்து இருப்பச் * சிறுகாக்கை முலைதீண்ட * அத்திரமே கொண்டெறிய * அனைத்து உலகும் திரிந்தோடி *** வித்தகனே! இராமாவோ! * நின் அபயம் என்று அழைப்ப * அத்திரமே அதன் கண்ணை * அறுத்ததும் ஓரடையாளம். * ",
            7: "மின்னொத்த நுண்ணிடையாய்! * மெய்யடியேன் விண்ணப்பம் * பொன்னொத்த மான் ஒன்று * புகுந்து இனிது விளையாட *** நின் அன்பின் வழி நின்று * சிலைபிடித்து எம்பிரான் ஏக * பின்னே அங்கு இலக்குமணன் * பிரிந்ததும் ஓரடையாளம். * ",
            8: "மைத்தகு மாமலர்க் குழலாய்! * வைதேவீ! விண்ணப்பம் * ஒத்த புகழ் வானரக்கோன் * உடனிருந்து நினைத்தேட *** அத்தகுசீர் அயோத்தியர்கோன் * அடையாளம் இவை மொழிந்தான் * இத்தகையால் அடையாளம் * ஈது அவன் கை மோதிரமே. * ",
            9: "🙏 திக்கு நிறை புகழாளன் * தீ வேள்விச் சென்ற நாள் * மிக்க பெருஞ்சபை நடுவே * வில்லிறுத்தான் மோதிரம் கண்டு *** ஒக்குமால் அடையாளம் * அனுமான்! என்று  உச்சிமேல் * வைத்துக் கொண்டு உகந்தனளால் * மலர்க்குழலாள் சீதையுமே * . ",
            10: "🙏 வாராரும் முலைமடவாள் * வைதேவிதனைக்கண்டு * சீராரும் திறல் அனுமன் * தெரிந்துரைத்த அடையாளம் *** పారారుమ్ పుకల్ పుతువైప్ * పట్టర్పిరాన్ పాడల్వల్లార్ * ఏరారుమ్ వైకుందత్తు * ఇమైయవరోడు ఇరుప్పారే. * ",
        }
    };
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};