window.MARKER_DATABASE = window.MARKER_DATABASE || {};

// Global function to trigger the merge on-demand
window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'PAT.4.1.steps':
        {
            1: "கதிராயிரம் இரவி * கலந்தெரித்தாலொத்த நீள்முடியன் * எதிரில் பெருமை இராமனை * இருக்குமிடம் நாடுதிரேல் *** அதிரும் கழற் பொருதோள் * இரணியனாகம் பிளந்து * அரியாய்உதிரம் அளைந்த கையோடு இருந்தானை * உள்ளவா கண்டாருளர். ",
            2: "நாந்தகம் சங்கு தண்டு * நாணொலிச் சார்ங்கம் திருச்சக்கரம் * ஏந்துபெருமை இராமனை * இருக்குமிடம் நாடுதிரேல் *** காந்தள் முகிழ் விரல் சீதைக்காகிக் * கடுஞ்சிலை சென்றிறுக்க * வேந்தர் தலைவன் சனக ராசன்தன் * வேள்வியில் கண்டாருளர். ",
            3: "கொலை யானைக் கொம்பு பறித்துக் * கூடலர்சேனை பொருதழிய * சிலையால் மராமரமெய்த தேவனைச் * சிக்கென நாடுதிரேல் *** தலையால் குரக்கினம் தாங்கிச்சென்று * தடவரை கொண்டு அடைப்ப * அலையார் கடற்கரை வீற்றிருந்தானை * அங்குத்தைக் கண்டாருளர். ",
            4: "தோயம் பரந்த நடுவுசூழலில் * தொல்லை வடிவுகொண்ட * மாயக் குழவியதனை நாடுறில் * வம்மின் சுவடுரைக்கேன் *** ஆயர் மடமகள் பின்னைக்காகி * அடல் விடை ஏழினையும் * வீயப் பொருது வியர்த்து நின்றானை * மெய்ம்மையே கண்டாருளர். ",
            5: "நீரேறு செஞ்சடை நீலகண்டனும் * நான்முகனும் முறையால் * சீரேறு வாசகஞ் செய்ய நின்ற * திருமாலை நாடுதிரேல் *** வாரேறு கொங்கை உருப்பிணியை * வலியப் பிடித்துக் கொண்டு தேரேற்றி * சேனைநடுவு போர்செய்யச் * சிக்கெனக் கண்டாருளர். ",
            6: "பொல்லா வடிவுடைப் பேய்ச்சிதுஞ்சப் * புணர் முலைவாய் மடுக்கவல்லானை * மாமணிவண்ணனை *** மருவுமிடம் நாடுதிரேல் * பல்லாயிரம் பெருந்தேவிமாரொடு * பௌவம் ஏறி துவரை * எல்லாரும் சூழச் சிங்காசனத்தே * இருந்தானைக் கண்டாருளர். ",
            7: "வெள்ளை விளிசங்கு வெஞ்சுடர்த் திருச்சக்கரம் * ஏந்துகையன் * உள்ளவிடம் வினவில் * உமக்கு இறை வம்மின் சுவடுரைக்கேன் *** வெள்ளைப்புரவிக் குரக்குவெல் கொடித் * தேர்மிசை முன்புநின்று * கள்ளப் படைத் துணையாகிப் * பாரதம் கைசெய்யக் கண்டாருளர். ",
            8: "நாழிகை கூறிட்டுக் காத்து நின்ற * அரசர்கள் தம்முகப்பே * நாழிகை போகப்படை பொருதவன் * தேவகிதன் சிறுவன் *** ஆழிகொண்டு அன்று இரவி மறைப்பச் * சயத்திரதன் தலையை * பாழில் உருளப் படைபொருதவன் * பக்கமே கண்டாருளர். ",
            9: "மண்ணும் மலையும் மறிகடல்களும் * மற்றும் யாவுமெல்லாம் * திண்ணம் விழுங்கி உமிழ்ந்த தேவனைச் * சிக்கென நாடுதிரேல் *** எண்ணற்கரியதோர் ஏனமாகி * இருநிலம்புக் கிடந்து * வண்ணக் கருங்குழல் மாதரோடு * மணந்தானைக் கண்டாருளர். ",
            10: "கரியமுகில் புரைமேனி மாயனைக் * கண்ட சுவடுரைத்து * புரவிமுகம் செய்து செந்நெலோங்கி * விளை கழனிப்புதுவை *** திருவிற் பொலி மறைவாணன் * பட்டர்பிரான் சொன்ன மாலைபத்தும் * பரவு மனமுடைப் பத்தருள்ளார் * பரமனடி சேர்வர்களே. ",
        },
        'PAT.4.2.steps':
        {

            1: "அலம்பாவெருட்டாக் * கொன்று திரியும் அரக்கரை * குலம் பாழ் படுத்துக் * குலவிளக்காய் நின்ற கோன்மலை *** சிலம்பார்க் கவந்து * தெய்வ மகளிர்களாடும் சீர் * சிலம்பாறு பாயும் * தென்திருமாலிருஞ்சோலையே. ",
            2: "வல்லாளன் தோளும் * வாளரக்கன் முடியும் * தங்கைபொல்லாத மூக்கும் * போக்குவித்தான் பொருந்தும்மலை *** எல்லாவிடத்தில் * எங்கும்பரந்து பல்லாண்டொலி * செல்லா நிற்கும் சீர்த் * தென்திருமாலிருஞ்சோலையே. ",
            3: "தக்கார் மிக்கார்களைச் * சஞ்சலம்செய்யும் சலவரை * தெக்கா நெறியே போக்குவிக்கும் * செல்வன் பொன்மலை *** எக் காலமும் சென்று * சேவித்திருக்கும் அடியரை * அக்கானெறியை மாற்றும் * தண் திருமாலிருஞ்சோலையே. ",
            4: "ஆனாயர்கூடி * அமைத்த விழவை * அமரர்தம்கோனார்க் கொழியக் * கோவர்த்தனத்துச் செய்தான் மலை *** வானாட்டில்நின்று * மாமலர்க் கற்பகத் தொத்திழி * தேனாறுபாயும் * தென்திருமாலிருஞ்சோலையே. ",
            5: "ஒருவாரணம் * பணிகொண்டவன் பொய்கையில் * கஞ்சன்தன்ஒருவாரணம் * உயிருண்டவன்  சென்றுறையும்மலை *** கருவாரணம் * தன்பிடி துறந்தோட * கடல்வண்ணன்திருவாணை கூறத்திரியும் * தண்திருமாலிருஞ்சோலையே. ",
            6: "ஏவிற்றுச்செய்வான் * ஏன்றெதிர்ந்து வந்த மல்லரை * சாவத் தகர்த்த * சாந்தணி தோள் சதுரன்மலை *** ஆவத்தனமென்று * அமரர்களும் நன்முனிவரும் * சேவித்திருக்கும் * தென்திருமாலிருஞ்சோலையே. ",
            7: "மன்னர் மறுக * மைத்துனன்மார்க்கு ஒருதேரின்மேல் * முன்னங்கு நின்று * மோழை யெழுவித்தவன் மலை *** கொன்னவில் கூர்வேற்கோன் * நெடுமாறன் தென்கூடற்கோன் * தென்னன் கொண்டாடும் * தென்திருமாலிருஞ்சோலையே. ",
            8: "குறுகாத மன்னரைக் கூடுகலக்கி * வெங்கானிடைச்சிறுகால் நெறியே போக்குவிக்கும் * செல்வன் பொன்மலை *** அறுகால் வரிவண்டுகள் * ஆயிரநாமம் சொல்லி * சிறுகாலைப் பாடும் * தென்திருமாலிருஞ்சோலையே. ",
            9: "சிந்தப்புடைத்துச் * செங்குருதிகொண்டு * பூதங்கள்அந்திப்பலி கொடுத்து * ஆவத்தனம் செய் அப்பன்மலை *** இந்திர கோபங்கள் * எம்பெருமான் கனிவாய் ஒப்பான் * சிந்தும் புறவில் * தென்திருமாலிருஞ்சோலையே. ",
            10: "எட்டுத் திசையும் * எண்ணிறந்த பெருந்தேவிமார் * விட்டு விளங்க * வீற்றிருந்த விமலன் மலை *** பட்டிப் பிடிகள் * பகடு உறிஞ்சிச் சென்று  மாலைவாய்த் * தெட்டித் திளைக்கும் * தென்திருமாலிருஞ்சோலையே. ",
            11: "மருதப் பொழிலணி * மாலிருஞ்சோலை மலைதன்னை * கருதியுறைகின்ற * கார்க் கடல் வண்ணனம்மான் தன்னை *** விரதம் கொண்டேத்தும் * வில்லிபுத்தூர் விட்டுசித்தன் சொல் * கருதியுரைப்பவர் * கண்ணன் கழலிணை காண்பார்களே. ",
        },
        'PAT.4.3.steps':
        {

            1: "உருப்பிணி நங்கை தன்னைமீட்பான் * தொடர்ந்தோடிச் சென்ற * உருப்பனை யோட்டிக் கொண்டிட்டு * உறைத்திட்ட உறைப்பன்மலை *** பொருப்பிடைக் கொன்றை நின்று * முறியாழியும் காசும் கொண்டு * விருப்பொடு பொன்வழங்கும் * வியன்மாலிருஞ்சோலையதே. ",
            2: "கஞ்சனும் காளியனும் * களிறும் மருதும் எருதும் * வஞ்சனையில் மடிய * வளர்ந்த மணிவண்ணன் மலை *** நஞ்சுமிழ் நாகமெழுந்தணவி * நளிர்மாமதியை * செஞ்சுடர் நாவளைக்கும் * திருமாலிருஞ்சோலையதே. ",
            3: "மன்னு நரகன் தன்னைச் * சூழ்போகி வளைத்தெறிந்து * கன்னி மகளிர் தம்மைக் * கவர்ந்த கடல்வண்ணன் மலை *** புன்னை செருந்தியொடு * புன வேங்கையும் கோங்கும் நின்று * பொன்னரிமாலைகள்சூழ் * பொழில்மாலிருஞ்சோலையதே. ",
            4: "மாவலி தன்னுடைய * மகன் வாணன் மகளிருந்த * காவலைக் கட்டழித்த * தனிக்காளை கருதும்மலை *** கோவலர் கோவிந்தனைக் * குறமாதர்கள் பண்குறிஞ்சிப் * பாவொலி பாடி நடம்பயில் * மாலிருஞ்சோலையதே. ",
            5: "#பலபல நாழம் சொல்லிப் * பழித்த சிசுபாலன் தன்னை * அலவலைமை தவிர்த்த * அழகன் அலங்காரன் மலை *** குலமலை கோலமலை * குளிர்மாமலை கொற்றமலை * நிலமலை நீண்டமலை * திருமாலிருஞ்சோலையதே. ",
            6: "பாண்டவர் தம்முடைய * பாஞ்சாலி மறுக்கமெல்லாம் * ஆண்டு அங்கு நூற்றுவர்தம் * பெண்டிர்மேல்வைத்த அப்பன்மலை *** பாண்தகு வண்டினங்கள் * பண்கள் பாடி மதுப்பருக * தோண்டலுடைய மலை * தொல்லைமாலிருஞ்சோலையதே. ",
            7: "கனங் குழையாள் பொருட்டாக் * கணைபாரித்து * அரக்கர் தங்கள்இனம் கழுவேற்றுவித்த * எழில்தோள் எம் இராமன்மலை *** கனம்கொழி தெள்ளருவி * வந்துசூழ்ந்து கல் ஞாலமெல்லாம் * இனம் குழுவாடும் மலை * எழில்மாலிருஞ்சோலையதே. ",
            8: "எரிசிதறும் சரத்தால் * இலங்கையினை * தன்னுடையவரிசிலை வாயில் பெய்து * வாய்க் கோட்டம் தவிர்த்து உகந்த *** அரையன் அமரும் மலை * அமரரொடு கோனும்சென்று * திரிசுடர் சூழும்மலை * திருமாலிருஞ்சோலையதே. ",
            9: "கோட்டு மண் கொண்டிடந்து * குடங்கையில் மண் கொண்டளந்து * மீட்டும் அதுண்டுமிழ்ந்து * விளையாடு விமலன் மலை *** ஈட்டிய பல்பொருள்கள் * எம்பிரானுக்கு அடியுறையென்று * ஓட்டரும் தண் சிலம்பாறுடை * மாலிருஞ்சோலையதே. ",
            10: "#ஆயிரம்தோள்பரப்பி * முடியாயிரம் மின்னிலக * ஆயிரம் பைந்தலைய * அனந்த சயனன் ஆளும்மலை *** ஆயிரம் ஆறுகளும் * சுனைகள் பலவாயிரமும் * ஆயிரம் பூம்பொழிலுமுடை * மாலிருஞ்சோலையதே. ",
            11: "# மாலிருஞ்சோலையென்னும் * மலையை உடைய மலையை * நாலிரு மூர்த்தி தன்னை * நால் வேதக் கடலமுதை *** மேலிருங் கற்பகத்தை * வேதாந்த விழுப்பொருளில் * மேலிருந்த விளக்கை * விட்டுசித்தன் விரித்தனவே. ",
        },
        'PAT.4.4.steps':
        {

            1: "நாவகாரியம் சொல்லிலாதவர் * நாள்தொறும் விருந்தோம்புவார் * தேவகாரியம்செய்து * வேதம் பயின்று வாழ் திருக்கோட்டியூர் *** மூவர் காரியமும் திருத்தும் * முதல்வனைச் சிந்தியாத * அப்பாவ காரிகளைப் படைத்தவன் * எங்ஙனம் படைத்தான் கொலோ! ",
            2: "குற்றமின்றிக் குணம் பெருக்கிக் * குருக்களுக்கு அனுகூலராய் * செற்றமொன்றும் இலாத * வண் கையினார்கள் வாழ்திருக்கோட்டியூர் *** துற்றி ஏழ் உலகுண்ட * தூமணிவண்ணன் தன்னைத் தொழாதவர் * பெற்ற தாயர் வயிற்றினைப் * பெருநோய் செய்வான் பிறந்தார்களே. ",
            3: "வண்ணநல் மணியும் * மரகதமும் அழுத்தி * நிழலெழும்திண்ணைசூழ் * திருக்கோட்டியூர்த் திருமாலவன் திருநாமங்கள் *** எண்ணக் கண்ட விரல்களால் * இறைப்பொழுதும் எண்ணகிலாது போய் * உண்ணக்கண்ட தம் ஊத்தை வாய்க்குக் * கவளம் உந்துகின்றார்களே. ",
            4: "உரகமெல்லணையான் கையில் * உறை சங்கம்போல் மடவன்னங்கள் * நிரை கணம் பரந்தேறும் * செங்கமல வயல் திருக்கோட்டியூர் *** நரக நாசனை நாவில் கொண்டு அழையாத * மானிட சாதியர் * பருகு நீரும் உடுக்குங் கூறையும் * பாவம் செய்தனதாங் கொலோ! ",
            5: "ஆமையின் முதுகத்திடைக் குதிகொண்டு * தூமலர் சாடிப்போய் * தீமை செய்து இள வாளைகள் * விளையாடு நீர்த் திருக்கோட்டியூர் *** நேமிசேர் தடங்கையினானை * நினைப்பிலா வலி நெஞ்சுடை * பூமி பாரங்கள் உண்ணும் சோற்றினை வாங்கிப் * புல்லைத் திணிமினே. ",
            6: "பூதம் ஐந்தொடு வேள்வியைந்து * புலன்களைந்து பொறிகளால் * ஏதமொன்றுமிலாத * வண் கையினார்கள் வாழ் திருக்கோட்டியூர் *** நாதனை நரசிங்கனை * நவின்றேத்துவார்கள் உழக்கிய * பாத தூளி படுதலால் * இவ்வுலகம் பாக்கியம் செய்ததே. ",
            7: "குருந்தம் ஒன்று ஒசித்தானொடும் சென்று * கூடியாடி விழாச்செய்து * திருந்து நான்மறையோர் இராப்பகல் * ஏத்தி வாழ் திருக்கோட்டியூர் *** கருந்தட முகில்வண்ணனைக் * கடைக் கொண்டு கைதொழும் பத்தர்கள் * இருந்த ஊரிலிருக்கும் மானிடர் * எத்தவங்கள் செய்தார்கொலோ! ",
            8: "நளிர்ந்த சீலன் நயாசலன் * அபிமனதுங்கனை நாள்தொறும் * தெளிந்த செல்வனைச் * சேவகங்கொண்ட செங்கண்மால் திருக்கோட்டியூர் *** குளிர்ந்துறைகின்ற கோவிந்தன் * குணம் பாடுவாருள்ள நாட்டினுள் * விளைந்த தானியமும் * இராக்கதர் மீது கொள்ளகிலார்களே. ",
            9: "கொம்பினார் பொழில்வாய்க் * குயிலினம் கோவிந்தன் குணம் பாடுசீர் * செம்பொனார் மதிள்சூழ் * செழுங் கழனியுடைத் திருக்கோட்டியூர் *** நம்பனை நரசிங்கனை * நவின்று ஏத்துவார்களைக் கண்டக்கால் * எம்பிரான் தன சின்னங்கள் * இவர் இவரென்று ஆசைகள் தீர்வனே. ",
            10: "காசின் வாய்க் கரம் விற்கிலும் * கரவாது மாற்றிலி சோறிட்டு * தேச வார்த்தை படைக்கும் * வண் கையினார்கள் வாழ் திருக்கோட்டியூர் *** கேசவா! புருடோத்தமா! * கிளர் சோதியாய்! குறளா! என்று * பேசுவார் அடியார்கள் * எந்தம்மை விற்கவும் பெறுவார்களே. ",
            11: "சீதநீர் புடைசூழ் * செழுங் கழனியுடைத் திருக்கோட்டியூர் * ஆதியான் அடியாரையும் * அடிமையின்றித் திரிவாரையும் *** கோதில் பட்டர்பிரான் * குளிர் புதுவைமன் விட்டுசித்தன்சொல் * ஏதமின்றி உரைப்பவர் * இருடீகேசனுக்காளரே. ",
        },
        'PAT.4.5.steps':
        {

            1: "ஆசைவாய்ச் சென்ற சிந்தையராகி * அன்னை அத்தன் என் புத்திரர் பூமி * வாசவார் குழலாள் என்று மயங்கி * மாளுமெல்லைக் கண்வாய் திறவாதே *** கேசவா! புருடோத்தமா! என்றும் * கேழலாகிய கேடிலீ! என்றும் * பேசுவார் அவர் எய்தும் பெருமை * பேசுவான் புகில் நம் பரமன்றே. ",
            2: "சீயினால் செறிந்தேறிய புண்மேல் * செற்றல் ஏறிக் குழம்பிருந்து * எங்கும்ஈயினால் அரிப்புண்டு மயங்கி * எல்லை வாய்ச்சென்று சேர்வதன் முன்னம் *** வாயினால் நமோநாரணா என்று * மத்தகத்திடைக் கைகளைக்கூப்பி * போயினால் பின்னை இத்திசைக்கு என்றும் * பிணைக்கொடுக்கிலும் போகவொட்டாரே.",
            3: "சோர்வினால் பொருள் வைத்தது உண்டாகில் * சொல்லு சொல்லு என்று சுற்றும் இருந்து * ஆர் வினவிலும் வாய் திறவாதே * அந்தகாலம் அடைவதன் முன்னம் *** மார்வம் என்பதோர் கோயில் அமைத்து * மாதவனென்னும் தெய்வத்தை நாட்டி * ஆர்வம் என்பதோர் பூவிட வல்லார்க்கு * அரவ தண்டத்தில் உய்யலுமாமே. ",
            4: "மேலெழுந்தது ஓர் வாயுக் கிளர்ந்து * மேல் மிடற்றினை உள் எழ வாங்கி * காலும் கையும் விதிர் விதிர்த்தேறிக் * கண் உறக்கம் அது ஆவதன்முன்னம் *** மூலமாகிய ஒற்றை எழுத்தை * மூன்றுமாத்திரை உள் எழ வாங்கி * வேலை வண்ணனை மேவுதிராகில் * விண்ணகத்தினில் மேவலுமாமே. ",
            5: "மடிவழி வந்து நீர் புலன் சோர * வாயில் அட்டிய கஞ்சியும் மீண்டே * கடைவழி வாரக் கண்டம் அடைப்பக் * கண்ணுறக்கம் அது ஆவதன் முன்னம் *** தொடை வழி உம்மை நாய்கள்கவரா * சூலத்தால் உம்மைப் பாய்வதும் செய்யார் * இடைவழியில் நீர் கூறையும் இழவீர் * இருடீகேசன் என்று ஏத்தவல்லீரே. ",
            6: "அங்கம்விட்டு அவை ஐந்தும் அகற்றி * ஆவி மூக்கினில் சோதித்த பின்னை * சங்கம் விட்டவர் கையை மறித்துப் * பையவே தலை சாய்ப்பதன் முன்னம் *** வங்கம் விட்டு உலவும் கடற்பள்ளி மாயனை * மதுசூதனனை மார்பில்தங்க விட்டு வைத்து * ஆவதோர் கருமம் சாதிப்பார்க்கு * என்றும் சாதிக்கலாமே. ",
            7: "தென்னவன் தமர் செப்பமிலாதார் * சே அதக்குவார் போலப்புகுந்து * பின்னும் வன்கயிற்றால் பிணித்து எற்றிப் * பின் முன்னாக இழுப்பதன் முன்னம் *** இன்னவன் இனையான் என்றுசொல்லி * எண்ணி உள்ளத்து இருள் அற நோக்கி * மன்னவன் மதுசூதனன் என்பார் * வானகத்து மன்றாடிகள் தாமே. ",
            8: "கூடிக்கூடி உற்றார்கள் இருந்து * குற்றம் நிற்க நற்றங்கள் பறைந்து * பாடிப் பாடி ஓர் பாடையிலிட்டு * நரிப் படைக்கு ஒரு பாகுடம்போலே *** கோடி மூடியெடுப்பதன் முன்னம் * கௌத்துவமுடைக் கோவிந்தனோடு * கூடியாடிய உள்ளத்தர் ஆனால் * குறிப்பிடம் கடந்து உய்யலுமாமே. ",
            9: "வாயொரு பக்கம் வாங்கி வலிப்ப * வார்ந்த நீர்க்குழிக் கண்கள் மிழற்ற * தாய் ஒருபக்கம் தந்தை ஒருபக்கம் * தாரமும் ஒருபக்கம் அலற்ற *** தீ ஓருபக்கம் சேர்வதன் முன்னம் * செங்கண் மாலொடும் சிக்கெனச் சுற்றமாய் * ஒருபக்கம் நிற்க வல்லார்க்கு * அரவ தண்டத்தில் உய்யலுமாமே. ",
            10: "செத்துப் போவதோர் போது நினைந்து * செய்யும் செய்கைகள் தேவபிரான்மேல் * பத்தராய் இறந்தார் பெறும் பேற்றைப் * பாழித்தோள் விட்டுசித்தன் புத்தூர்க்கோன் *** சித்தம் நன்கு ஒருங்கித் திருமாலைச் * செய்த மாலை இவைபத்தும் வல்லார் * சித்தம் நன்கு ஒருங்கித் திருமால்மேல் * சென்ற சிந்தை பெறுவர் தாமே. ",
        },
        'PAT.4.6.steps':
        {

            1: "காசும் கரை உடைக் கூறைக்கும் * அங்கோர் கற்றைக்கும்ஆசையினால் * அங்கு அவத்தப் பேரிடும்  ஆதர்காள்! *** கேசவன் பேரிட்டு * நீங்கள் தேனித்து இருமினோ * நாயகன் நாரணன் * தம் அன்னை நரகம்புகாள். ",
            2: "அங்கொருகூறை * அரைக்கு உடுப்பதன் ஆசையால் * மங்கிய மானிட சாதியின் * பேரிடும் ஆதர்காள்! *** செங்கணெடுமால்! * சிரீதரா! என்று அழைத்தக் கால் * நங்கைகாள்! நாரணன் * தம் அன்னை நரகம்புகாள். ",
            3: "உச்சியில் எண்ணெயும் * சுட்டியும் வளையும் உகந்து * எச்சம் பொலிந்தீர்காள்! * என் செய்வான் பிறர் பேர் இட்டீர்? *** பிச்சை புக்கு ஆகிலும் * எம்பிரான் திருநாமமேநச்சுமின் * நாரணன் * தம் அன்னை நரகம்புகாள். ",
            4: "மானிட சாதியில் தோன்றிற்று   ஓர் * மானிடசாதியை * மானிட சாதியின் பேரிட்டால் * மறுமைக்கில்லை *** வானுடை மாதவா! * கோவிந்தா! என்று அழைத்தக்கால் * நானுடை நாரணன் * தம் அன்னை நரகம்புகாள். ",
            5: "மலமுடை ஊத்தையில் தோன்றிற்று  ஓர் * மல ஊத்தையை * மலமுடை ஊத்தையின் பேரிட்டால் * மறுமைக்கில்லை *** குலமுடைக் கோவிந்தா! * கோவிந்தா! என்று அழைத்தக்கால் * நலமுடை நாரணன் * தம் அன்னை நரகம்புகாள். ",
            6: "நாடும் நகரும் அறிய * மானிடப் பேரிட்டு * கூடி அழுங்கிக் * குழியில் வீழ்ந்து வழுக்காதே *** சாடிறப் பாய்ந்த தலைவா! * தாமோதரா! என்றுநாடுமின் * நாரணன் * தம் அன்னை நரகம்புகாள். ",
            7: "மண்ணில் பிறந்து மண்ணாகும் * மானிடப் பேரிட்டு * அங்குஎண்ணமொன்று இன்றி இருக்கும் * ஏழை மனிசர்காள்! *** கண்ணுக்கினிய * கருமுகில் வண்ணன் நாமமேநண்ணுமின் * நாரணன் * தம் அன்னை நரகம்புகாள். ",
            8: "நம்பி பிம்பியென்று * நாட்டு மானிடப் பேரிட்டால் * நம்பும் பிம்புமெல்லாம் * நாலுநாளில் அழுங்கிப்போம் *** செம்பெருந் தாமரைக் கண்ணன் * பேரிட்டு அழைத்தக்கால் * நம்பிகாள்! நாரணன் * தம் அன்னை நரகம்புகாள். ",
            9: "ஊத்தைக் குழியில் * அமுதம் பாய்வதுபோல் * உங்கள்மூத்திரப் பிள்ளையை * என் முகில்வண்ணன் பேரிட்டு *** கோத்துக் குழைத்துக் * குணாலம் ஆடித் திரிமினோ * நாத்தகு நாரணன் * தம் அன்னை நரகம்புகாள். ",
            10: "சீரணி மால் * திருநாமமே இடத் தேற்றிய * வீரணி தொல் புகழ் * விட்டுசித்தன் விரித்த *** ஓர் அணி ஒண் தமிழ் * ஒன்பதோடொன்றும் வல்லவர் * பேரணி வைகுந்தத்து * என்றும் பேணியிருப்பரே. ",
        },
        'PAT.4.7.steps':
        {

            1: "தங்கையை மூக்கும் தமையனைத் தலையும் தடிந்த * எம் தாசரதிபோய் * எங்கும் தன் புகழா இருந்து அரசாண்ட * எம் புருடோத்தமன் இருக்கை *** கங்கை கங்கையென்ற வாசகத்தாலே * கடுவினை களைந்திட கிற்கும் * கங்கையின் கரைமேல் கைதொழ நின்ற * கண்டமென்னும் கடிநகரே. ",
            2: "சலம்பொதி உடம்பின் தழல் உமிழ் பேழ்வாய்ச் * சந்திரன் வெங்கதிர் அஞ்ச * மலர்ந்து எழுந்து அணவு மணிவண்ண உருவின் * மால் புருடோத்தமன் வாழ்வு *** நலம் திகழ் சடையான் முடிக் கொன்றை மலரும் * நாரணன் பாதத் துழாயும் * கலந்திழி புனலால் புகர்படு கங்கைக் * கண்டமென்னும் கடிநகரே. ",
            3: "அதிர் முகமுடைய வலம்புரி குமிழ்த்தி * அழல் உமிழ் ஆழி கொண்டெறிந்து * அங்குஎதிர்முக அசுரர் தலைகளை இடறும் * எம் புருடோத்தமன் இருக்கை *** சதுமுகன் கையில் சதுப் புயன் தாளில் * சங்கரன் சடையினில் தங்கி * கதிர்முக மணிகொண்டு எழி புனல் கங்கைக் * கண்டமென்னும் கடிநகரே. ",
            4: "இமையவர் இறுமாந்திருந்து அரசாள * ஏற்று வந்தெதிர் பொருசேனை * நமபுரம் நணுக நாந்தகம் விசிறும் * நம் புருடோத்தமன் நகர்தான் *** இமவந்தம் தொடங்கி இருங்கடல் அளவும் * இருகரை உலகிரைத்தாட * கமையுடைப் பெருமைக் கங்கையின் கரைமேல் * கண்டமென்னும் கடிநகரே. ",
            5: "உழுவதோர் படையும் உலக்கையும் வில்லும் * ஒண் சுடராழியும் சங்கும் * மழுவொடு வாளும் படைக்கலம் உடைய * மால் புருடோத்தமன் வாழ்வு *** எழுமையும் கூடி ஈண்டிய பாவம் * இறைப் பொழுது அளவினில் எல்லாம் * கழுவிடும் பெருமைக் கங்கையின் கரைமேல் * கண்டமென்னும் கடிநகரே. ",
            6: "தலைப் பெய்து குமுறிச் சலம் பொதி மேகம் * சலசல பொழிந்திடக்கண்டு * மலைப் பெருங்குடையால் மறுத்தவன் மதுரை * மால் புருடோத்தமன் வாழ்வு *** அலைப்புடைத் திரைவாய் அருந்தவ முனிவர் * அவபிரதம் குடைந்தாட * கலப்பைகள் கொழிக்கும் கங்கையின் கரைமேல் * கண்டமென்னும் கடிநகரே. ",
            7: "விற் பிடித்து இறுத்து வேழத்தை முறுக்கி * மேலிருந்தவன் தலைசாடி * மற் பொருது எழப் பாய்ந்து அரையனை உதைத்த * மால் புருடோத்தமன் வாழ்வு *** அற்புதமுடைய ஐராவத மதமும் * அவர் இளம்படியர் ஒண்சாந்தும் * கற்பக மலரும் கலந்திழி கங்கைக் * கண்டமென்னும் கடிநகரே. ",
            8: "திரை பொருகடல் சூழ் திண்மதிள் துவரைவேந்து * தன் மைத்துனன்மார்க்காய் * அரசனை அவிய அரசினை அருளும் * அரி புருடோத்தமன் அமர்வு *** நிரை நிரையாக நெடியன யூபம் * நிரந்தரம் ஒழுக்கு விட்டு * இரண்டுகரைபுரை வேள்விப் புகை கமழ் கங்கை * கண்டமென்னும் கடிநகரே. ",
            9: "#வடதிசை மதுரை சாளக்கிராமம் * வைகுந்தம் துவரை அயோத்தி * இடமுடை வதரி இட வகையுடைய * எம் புருடோத்தமன் இருக்கை *** தடவரை அதிரத் தரணி விண்டு இடியத் * தலைப் பற்றிக் கரை மரம்சாடி * கடலினைக் கலங்கக் கடுத்திழி கங்கைக் * கண்டமென்னும் கடிநகரே. ",
            10: "#மூன்றெழுத்து அதனை மூன்றெழுத்து அதனால் * மூன்றெழுத்தாக்கி * மூன்றெழுத்தைஏன்று கொண்டிருப்பார்க்கு இரக்கம் நன்குடைய * எம் புருடோத்தமன் இருக்கை *** மூன்றடி நிமிர்த்து மூன்றினில் தோன்றி * மூன்றினில் மூன்று உருவானான் * கான்தடம் பொழில்சூழ் கங்கையின் கரைமேல் * கண்டமென்னும் கடிநகரே. ",
            11: "பொங்கொலி கங்கைக் கரைமலி கண்டத்து * உறை புருடோத்தமனடிமேல் * வெங்கலி நலியா வில்லிபுத்தூர்க்கோன் * விட்டுசித்தன் விருப்புற்று *** தங்கிய அன்பால் செய்த தமிழ்மாலை * தங்கிய நாவுடையார்க்கு * கங்கையில் திருமால் கழலிணைக்கீழே * குளித்திருந்த கணக்காமே. ",
        },
        'PAT.4.8.steps':
        {

            1: "மாதவத்தோன் புத்திரன்போய் * மறிகடல்வாய் மாண்டானை * ஓதுவித்த தக்கணையா * உரு உருவே கொடுத்தானூர் *** தோத வத்தித் தூய் மறையோர் * துறை படியத் துளும்பி எங்கும் * போதில் வைத்த தேன் சொரியும் * புனலரங்கம் என்பதுவே. ",
            2: "பிறப்பகத்தே மாண்டொழிந்த * பிள்ளைகளை நால்வரையும் * இறைப் பொழுதில் கொணர்ந்து கொடுத்து * ஒருப்படுத்த உறைப்பனூர் *** மறைப் பெருந்தீ வளர்த்திருப்பார் * வரு விருந்தை அளித்திருப்பார் * சிறப்புடைய மறையவர் வாழ் * திருவரங்கம் என்பதுவே. ",
            3: "மருமகன் தன் சந்ததியை * உயிர்மீட்டு மைத்துனன்மார் * உரு மகத்தே வீழாமே * குருமுகமாய்க் காத்தானூர் *** திருமுகமாய்ச் செங்கமலம் * திரு நிறமாய்க் கருங்குவளை * பொருமுகமாய் நின்றலரும் * புனலரங்கம் என்பதுவே. ",
            4: "கூன் தொழுத்தை சிதகுரைப்பக் * கொடியவள் வாய்க் கடிய சொல்கேட்டு * ஈன்றெடுத்த தாயரையும் * இராச்சியமும் ஆங்கொழிய *** கான் தொடுத்த நெறி போகிக் * கண்டகரைக் களைந்தானூர் * தேன் தொடுத்த மலர்ச்சோலைத் * திருவரங்கம் என்பதுவே. ",
            5: "பெரு வரங்கள் அவை பற்றிப் * பிழக்குடைய இராவணனை * உருவரங்கப் பொருதழித்து * இவ்வுலகினைக் கண் பெறுத்தானூர் *** குருவரும்பக் கோங்கு அலரக் * குயில்கூவும் குளிர்பொழில்சூழ் * திருவரங்கம் என்பதுவே * என்திருமால் சேர்விடமே. ",
            6: "கீழுலகில் அசுரர்களைக் * கிழங்கிருந்து கிளராமே * ஆழிவிடுத்து அவருடைய * கருவழித்த வழிப்பனூர் *** தாழை மடல் ஊடு உரிஞ்சித் * தவளவண்ணப் பொடியணிந்து * யாழின் இசை வண்டினங்கள் * ஆளம் வைக்கும் அரங்கமே. ",
            7: "கொழுப்புடைய செழுங்குருதி * கொழித்து இழிந்து குமிழ்த்தெறிய * பிழக்குடைய அசுரர்களைப் * பிணம் படுத்த பெருமானூர் *** தழுப்பரிய சந்தனங்கள் * தடவரைவாய் ஈர்த்துக்கொண்டு * தெழிப்புடைய காவிரி வந்து * அடிதொழும் சீரரங்கமே. ",
            8: "வல்லெயிற்றுக் கேழலுமாய் * வாளெயிற்றுச் சீயமுமாய் * எல்லையில்லாத் தரணியையும் * அவுணனையும் இடந்தானூர் *** எல்லியம்போது இருஞ்சிறை வண்டு * எம்பெருமான் குணம்பாடி * மல்லிகை வெண்சங்கூதும் * மதிளரங்கம் என்பதுவே. ",
            9: "குன்றாடு கொழு முகில்போல் * குவளைகள்போல் குரைகடல்போல் * நின்றாடு கண மயில்போல் * நிறமுடைய நெடுமாலூர் *** குன்றூடு பொழில் நுழைந்து * கொடியிடையார் முலை அணவி * மன்றூடு தென்றலுமாம் * மதிளரங்கம் என்பதுவே. ",
            10: "பருவரங்கள் அவைபற்றிப் * படையாலித்து எழுந்தானை * செருவரங்கப் பொருது அழித்த * திருவாளன் திருப்பதிமேல் *** திருவரங்கத் தமிழ்மாலை * விட்டுசித்தன் விரித்தனகொண்டு * இருவரங்கம் எரித்தானை * ஏத்தவல்லார் அடியோமே. ",
        },
        'PAT.4.9.steps':
        {

            1: "மரவடியைத் தம்பிக்கு * வான்பணையம் வைத்துப்போய் வானோர்வாழ * செருவுடைய திசைக் கருமம் திருத்தி வந்து உலகாண்ட  திருமால்கோயில் *** திருவடிதன் திருவுருவும் * திருமங்கைமலர் கண்ணும் காட்டி நின்று * உருவுடைய மலர் நீலம் * காற்றாட்ட ஓசலிக்கும் ஒளியரங்கமே. ",
            2: "#தன்னடியார் திறத்தகத்துத் * தாமரையாளாகிலும் சிதகுரைக்குமேல் * என்னடியார் அதுசெய்யார் * செய்தாரேல் நன்றுசெய்தார் என்பர்போலும் *** மன்னுடைய விபீடணற்கா * மதிளிலங்கைத் திசைநோக்கி மலர்கண்வைத்த * என்னுடைய திருவரங்கற்கு அன்றியும் * மற்றொருவர்க்கு ஆளாவரே? ",
            3: "கருளுடைய பொழில் மருதும் * கதக்களிறும் பிலம்பனையும் கடியமாவும் * உருளுடைய சகடரையும் மல்லரையும் * உடைய விட்டு ஓசைகேட்டான் *** இருளகற்றும் எறி கதிரோன் * மண்டலத் தூடு ஏற்றிவைத்து ஏணிவாங்கி * அருள் கொடுத்திட்டு அடியவரை * ஆட்கொள்வான் அமரும் ஊர் அணியரங்கமே. ",
            4: "பதினாறாம் ஆயிரவர் * தேவிமார் பணிசெய்ய * துவரை என்னும் அதில் நாயகராகி வீற்றிருந்த * மணவாளர் மன்னுகோயில் *** புதுநாண் மலர்க்கமலம் * எம்பெருமான் பொன்வயிற்றில் பூவேபோல்வான் * பொதுநாயகம் பாவித்து இருமாந்து * பொன் சாய்க்கும் புனலரங்கமே. ",
            5: "ஆமையாய்க் கங்கையாய் * ஆழ்கடலாய் அவனியாய் அருவரைகளாய் * நான்முகனாய் நான்மறையாய் * வேள்வியாய்த் தக்கணையாய்த் தானும் ஆனான் *** சேமமுடை நாரதனார் * சென்றுசென்று துதித்து இறைஞ்சக் கிடந்தான் கோயில் * பூமருவிப் புள்ளினங்கள் * புள்ளரையன் புகழ் குழறும் புனலரங்கமே. ",
            6: "மைத்துனன்மார் காதலியை * மயிர் முடிப்பித்து அவர்களையே மன்னராக்கி * உத்தரைதன் சிறுவனையும்  * உய்யக்கொண்ட உயிராளன் உறையும்கோயில் *** பத்தர்களும் பகவர்களும் * பழமொழிவாய் முனிவர்களும் பரந்த நாடும் * சித்தர்களும் தொழுது இறைஞ்சத் * திசைவிளக்காய் நிற்கின்ற திருவரங்கமே. ",
            7: "குறட் பிரமசாரியாய் * மாவலியைக் குறும்பு அதக்கி அரசுவாங்கி * இறைப் பொழிதில் பாதாளம் கலவிருக்கை * கொடுத்துகந்த எம்மான்கோயில் *** எறிப்புடைய மணிவரைமேல் * இள ஞாயிறு எழுந்தாற்போல் அரவணையின் வாய் * சிறப்புடைய பணங்கள் மிசைச் * செழுமணிகள் விட்டெறிக்கும் திருவரங்கமே. ",
            8: "உரம்பற்றி இரணியனை * உகிர் நுதியால் ஒள்ளிய மார்பு உறைக்கவூன்றி * சிரம்பற்றி முடி இடியக் கண் பிதுங்க * வாய் அலரத் தெழித்தான் கோயில் *** உரம் பெற்ற மலர்க்கமலம் * உலகளந்த சேவடிபோல் உயர்ந்துகாட்ட * வரம்புற்ற கதிர்ச் செந்நெல் * தாள் சாய்த்துத் தலை வணக்கும் தண்ணரங்கமே. ",
            9: "தேவுடைய மீனமாய் ஆமையாய் ஏனமாய் * அரியாய்க் குறளாய் * மூவுருவின் இராமனாய்க் * கண்ணனாய்க் கற்கியாய் முடிப்பான் கோயில் *** சேவலொடு பெடையன்னம் * செங்கமல மலரேறி ஊசலாடி * பூவணைமேல் துதைந்து எழு * செம்பொடி ஆடி விளையாடும் புனலரங்கமே. ",
            10: "செருவாளும் புள்ளாளன் மண்ணாளன் * செருச்செய்யும் நாந்தகமென்னும் ஒருவாளன் * மறையாளன் ஓடாத படையாளன் * விழுக்கையாளன் *** இரவாளன் பகலாளன் என்னை ஆளன் * ஏழுலகப் பெரும் புரவாளன் * திருவாளன் இனிதாகத் * திருக்கண்கள் வளர்கின்ற திருவரங்கமே. ",
            11: "கைந் நாகத்து இடர் கடிந்த * கனலாழிப் படை உடையான் கருதும்கோயில் * தென்னாடும் வடநாடும் தொழ நின்ற * திருவரங்கம் திருப்பதியின்மேல் *** மெய்ந்நாவன் மெய் அடியான் விட்டுசித்தன் * விரித்த தமிழ் உரைக்க வல்லார் * எஞ்ஞான்றும் எம்பெருமான் இணையடிக் கீழ் * இணை பிரியாது இருப்பர் தாமே. ",
        },
        'PAT.4.10.steps':
        {

            1: "துப்புடையாரை அடைவதெல்லாம் * சோர்விடத்துத் துணையாவரென்றே * ஒப்பிலேனாகிலும் நின்னடைந்தேன் * ஆனைக்கு நீ அருள்செய்தமையால் *** எய்ப்பு என்னை வந்து நலியும்போது * அங்குஏதும் நானுன்னை நினைக்கமாட்டேன் * அப்போதைக்கு இப்போதே சொல்லிவைத்தேன் * அரங்கத்தரவணைப் பள்ளியானே! ",
            2: "சாமிடத்து என்னைக் குறிக்கொள் கண்டாய் * சங்கொடு சக்கரம் ஏந்தினானே! * நாமடித்து என்னை அனேக தண்டம் * செய்வதா நிற்பர் நமன்தமர்கள் *** போமிடத்து உன்திறத்து எத்தனையும் * புகாவண்ணம் நிற்பதோர் மாயை வல்லை * ஆமிடத்தே உன்னைச் சொல்லிவைத்தேன் * அரங்கத்தரவணைப் பள்ளியானே! ",
            3: "எல்லையில் வாசல் குறுகச்சென்றால் * எற்றி நமன்தமர் பற்றும்போது * நில்லுமின் என்னும் உபாயமில்லை * நேமியும் சங்கமும் ஏந்தினானே! *** சொல்லலாம்போதே உன் நாமமெல்லாம் * சொல்லினேன் என்னைக் குறிக்கொண்டுஎன்றும் * அல்லல்படாவண்ணம் காக்கவேண்டும் * அரங்கத்தரவணைப் பள்ளியானே! ",
            4: "ஒற்றைவிடையனும் நான்முகனும் * உன்னையறியாப் பெருமையோனே! * முற்றஉலகெல்லாம் நீயேயாகி * மூன்றெழுத்தாய முதல்வனேயா! *** அற்றது வாணாள் இவர்க்கு என்றெண்ணி * அஞ்சநமன்தமர் பற்றலுற்ற * அற்றைக்கு நீ என்னைக் காக்கவேண்டும் * அரங்கத்தரவணைப் பள்ளியானே! ",
            5: "பையரவினணைப் பாற்கடலுள் * பள்ளிகொள்கின்ற பரமமூர்த்தி! * உய்யஉலகு படைக்கவேண்டி * உந்தியில் தோற்றினாய் நான்முகனை *** வையமனிசரைப் பொய்யென்றெண்ணிக் * காலனையும் உடனே படைத்தாய் * ஐய! இனி என்னைக் காக்க வேண்டும் * அரங்கத்தரவணைப் பள்ளியானே! ",
            6: "தண்ணனவில்லை நமன்தமர்கள் * சாலக்கொடுமைகள் செய்யாநிற்பர் * மண்ணொடு நீரும் எரியும் காலும் * மற்றும் ஆகாசமும் ஆகிநின்றாய்! *** எண்ணலாம்போதே உன்நாமமெல்லாம் * எண்ணினேன்,என்னைக் குறிக்கொண்டு என்றும் * அண்ணலே! நீஎன்னைக் காக்கவேண்டும் * அரங்கத்தரவணைப் பள்ளியானே! ",
            7: "செஞ்சொல்மறைப் பொருளாகி நின்ற * தேவர்கள்நாயகனே! எம்மானே! * எஞ்சலில் என்னுடை இன்னமுதே! * ஏழுலகுமுடையாய்! என்னப்பா! *** வஞ்சவுருவின் நமன்தமர்கள் * வலிந்துநலிந்து என்னைப்பற்றும்போது * அஞ்சலமென்று என்னைக் காக்கவேண்டும் * அரங்கத்தரவணைப் பள்ளியானே! ",
            8: "நான் ஏதும் உன் மாயம் ஒன்றறியேன் * நமன்தமர்பற்றி நலிந்திட்டு * இந்த ஊனேபுகேயென்று மோதும்போது * அங்கேதும் நான் உன்னை நினைக்கமாட்டேன் *** வானேய் வானவர் தங்கள் ஈசா! * மதுரைப் பிறந்த மாமாயனே! * என்ஆனாய்! நீஎன்னைக் காக்கவேண்டும் * அரங்கத்தரவணைப் பள்ளியானே! ",
            9: "குன்றெடுத்து ஆநிரை காத்த ஆயா! * கோநிரை மேய்த்தவனே! எம்மானே! * அன்றுமுதல் இன்று அறுதியா * ஆதியஞ்சோதி மறந்தறியேன் *** நன்றும் கொடிய நமன்தமர்கள் * நலிந்து வலிந்து என்னைப் பற்றும்போது * அன்றங்கு நீஎன்னைக் காக்கவேண்டும் * அரங்கத்தரவணைப் பள்ளியானே! ",
            10: "மாயவனை மதுசூதனனை * மாதவனை மறையோர்கள் ஏத்தும் * ஆயர்களேற்றினை அச்சுதனை * அரங்கத்தரவணைப் பள்ளியானை *** வேயர்புகழ் வில்லிபுத்தூர்மன் * விட்டுசித்தன் சொன்ன மாலைபத்தும் * தூய மனத்தனராகி வல்லார் * தூமணி வண்ணனுக்காளர் தாமே. ",
        },
    };
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};