window.MARKER_DATABASE = window.MARKER_DATABASE || {};

// Global function to trigger the merge on-demand
window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'PAT.5.1.steps':
        {
            1: "🙏 வாக்குத் தூய்மை இலாமையினாலே * மாதவா! உன்னை வாய்க்கொள்ள மாட்டேன் * நாக்கு நின்னையல்லால் அறியாது * நான் அதஞ்சுவன் என் வசமன்று *** மூர்க்குப் பேசுகின்றான் இவனென்று * முனிவாயேலும் என்நாவினுக்கு ஆற்றேன் * காக்கை வாயிலும் கட்டுரை கொள்வர் * காரணா! கருளக் கொடியானே! ",
            2: "சழக்கு நாக்கொடு புன்கவி சொன்னேன் * சங்கு சக்கரம் ஏந்து கையனே! * பிழைப்பர் ஆகிலும் தம்மடியார் சொல் * பொறுப்பது பெரியோர் கடனன்றே *** விழிக்கும் கண்ணிலேன் நின் கண் மற்றல்லால் * வேறு ஒருவரோடு என் மனம் பற்றாது * உழைக்கு ஓர் புள்ளி மிகையன்று கண்டாய் * ஊழி ஏழு உலகு உண்டு உமிழ்ந்தானே! ",
            3: "நன்மை தீமைகள் ஒன்றும் அறியேன் * நாரணா! என்னும் இத்தனை அல்லால் * புன்மையால் உன்னைப் புள்ளுவம் பேசிப் * புகழ்வான் அன்று கண்டாய் திருமாலே! *** உன்னும் ஆறு உன்னை ஒன்றும் அறியேன் * ஓவாதே நமோநாரணா! என்பன் * வன்மையாவது உன் கோயிலில்வாழும் * வைஷ்ணவன் என்னும் வன்மை கண்டாயே.",
            4: "நெடுமையால் உலகேழும் அளந்தாய்! * நின்மலா! நெடியாய்! அடியேனைக் * குடிமை கொள்வதற்கு ஐயுறவேண்டா * கூறை சோறு இவை வேண்டுவதில்லை *** அடிமையென்னும் அக் கோயின்மையாலே * அங்கங்கே அவை போதரும் கண்டாய் * கொடுமைக் கஞ்சனைக் கொன்று நின்தாதை * கோத்தவன் தளை கோள் விடுத்தானே!",
            5: "தோட்டம் இல்லவள் ஆத்தொழு ஓடை * துடவையும் கிணறும் இவையெல்லாம் * வாட்டமின்றி உன்பொன்னடிக் கீழே * வளைப்பகம் வகுத்துக் கொண்டிருந்தேன் *** நாட்டு மானிடத்தோடு எனக்கு அரிது * நச்சுவார் பலர் கேழல் ஒன்றாகி * கோட்டு மண் கொண்ட கொள்கையினானே! * குஞ்சரம் வீழக் கொம்பொசித்தானே! ",
            6: "கண்ணா! நான்முகனைப் படைத்தானே! * காரணா! கரியாய்! அடியேன் நான் * உண்ணா நாள் பசியாவது ஒன்றில்லை * ஓவாதே நமோநாரணா என்று *** எண்ணா நாளும் இருக்கு எசுச் சாம வேத * நாண்மலர் கொண்டு உன்பாதம்நண்ணா நாள் * அவை தத்துறும் ஆகில் * அன்று எனக்கு அவை பட்டினிநாளே. ",
            7: "வெள்ளை வெள்ளத்தின் மேல் ஒருபாம்பை * மெத்தையாக விரித்து * அதன் மேலே கள்ள நித்திரை கொள்கின்ற மார்க்கம் * காணலாங்கொல் என்ற ஆசையினாலே *** உள்ளம் சோர உகந்தெதிர் விம்மி * உரோம கூபங்களாய் * கண்ண நீர்கள்துள்ளம்சோரத் துயிலணை கொள்ளேன் * சொல்லாய் யான் உன்னைத் தத்துறும் ஆறே. ",
            8: "வண்ணமால் வரையே குடையாக * மாரி காத்தவனே! மதுசூதா! * கண்ணனே! கரிகோள் விடுத்தானே! * காரணா! களிறட்ட பிரானே! *** எண்ணுவார் இடரைக் களைவானே! * ஏத்தரும் பெருங் கீர்த்தியினானே! * நண்ணி நான் உன்னை நாள்தொறும் ஏத்தும் * நன்மையே அருள்செய் எம்பிரானே! ",
            9: "நம்பனே! நவின்று ஏத்த வல்லார்கள் * நாதனே! நரசிங்கமது ஆனாய்! * உம்பர்கோன் உலகேழும் அளந்தாய் * ஊழி ஆயினாய்! ஆழி முன்னேந்தி *** கம்ப மா கரிகோள் விடுத்தானே! * காரணா! கடலைக் கடைந்தானே! * எம்பிரான்! என்னையாளுடைத் தேனே! * ஏழையேன் இடரைக் களையாயே. ",
            10: "🙏 காமர் தாதை கருதலர் சிங்கம் * காண இனிய கருங்குழல் குட்டன் * வாமனன் என் மரதக வண்ணன் * மாதவன் மதுசூதனன் தன்னை *** சேம நன்கமரும் புதுவையர்கோன் * விட்டுசித்தன் வியன் தமிழ்பத்தும் * நாமமென்று நவின்றுரைப்பார்கள் * நண்ணுவார் ஒல்லை நாரணன் உலகே. ",
        },
        'PAT.5.2.steps':
        {
            1: "🙏 நெய்க் குடத்தைப்பற்றி * ஏறும் எறும்புகள்போல் நிரந்து * எங்கும்கைக் கொண்டு நிற்கின்ற நோய்காள்! * காலம் பெற உய்யப்போமின் *** மெய்க் கொண்டு வந்து புகுந்து * வேதப்பிரானார் கிடந்தார் * பைக் கொண்ட பாம்பணையோடும் * பண்டன்று பட்டினம் காப்பே. ",
            2: "சித்திரகுத்தன் எழுத்தால் * தென் புலக்கோன் பொறியொற்றி * வைத்த இலச்சினை மாற்றித் * தூதுவர் ஓடி ஒளித்தார் *** முத்துத் திரைக்கடற் சேர்ப்பன் * மூதறிவாளர் முதல்வன் * பத்தர்க்கு அமுதன் அடியேன் * பண்டன்று பட்டினம் காப்பே. ",
            3: "வயிற்றில் தொழுவைப் பிரித்து * வன்புலச் சேவை அதக்கி * கயிற்றும் அக்காணி கழித்துக் * காலிடைப் பாசம்கழற்றி *** எயிற்றிடை மண் கொண்ட எந்தை * இராப்பகல் ஓதுவித்து * என்னைப் பயிற்றிப் பணிசெய்யக்கொண்டான் * பண்டன்று பட்டினம் காப்பே. ",
            4: "மங்கிய வல்வினை நோய்காள்! * உமக்கும் ஓர் வல்வினை கண்டீர் * இங்குப் புகேன்மின் புகேன்மின் * எளிதன்று கண்டீர் புகேன்மின் *** சிங்கப்பிரான் அவன் எம்மான் * சேரும் திருக்கோயில் கண்டீர் * பங்கப்படாது உய்யப்போமின் * பண்டன்று பட்டினம் காப்பே. ",
            5: "மாணிக் குறளுருவாய * மாயனை என் மனத்துள்ளே * பேணிக் கொணர்ந்து புகுத வைத்துக்கொண்டேன் * பிறிதின்றி *** மாணிக்கப் பண்டாரம் கண்டீர் * வலிவன் குறும்பர்கள் உள்ளீர்! * பாணிக்க வேண்டா நடமின் * பண்டன்று பட்டினம் காப்பே. ",
            6: "உற்றவுறு பிணிநோய்காள்! * உமக்கு ஒன்று சொல்லுகேன் கேண்மின் * பெற்றங்கள் மேய்க்கும் பிரானார் * பேணும் திருக்கோயில் கண்டீர் *** அற்றம் உரைக்கின்றேன் * இன்னம் ஆழ் வினைகாள்! * உமக்கு இங்கு ஓர்பற்றில்லை கண்டீர் நடமின் * பண்டன்று பட்டினம் காப்பே. ",
            7: "கொங்கைச் சிறுவரை என்னும் * பொதும்பினில் வீழ்ந்து வழுக்கி * அங்கோர் முழையினில் புக்கிட்டு * அழுந்திக் கிடந்து உழல்வேனை *** வங்கக் கடல்வண்ணன் அம்மான் * வல் வினையாயின மாற்றி * பங்கப்படா வண்ணம் செய்தான் * பண்டன்று பட்டினம் காப்பே. ",
            8: "ஏதங்கள் ஆயினவெல்லாம் * இறங்கல் இடுவித்து * என்னுள்ளே பீதகவாடைப் பிரானார் * பிரம குருவாகி வந்து *** போதில் கமல வன்னெஞ்சம் * புகுந்தும் என் சென்னித்திடரில் * பாத இலச்சினை வைத்தார் * பண்டன்று பட்டினம் காப்பே. ",
            9: "🙏 உறகல் உறகல் உறகல் * ஒண்சுடராழியே! சங்கே! * அறவெறி நாந்தக வாளே! * அழகிய சார்ங்கமே! தண்டே! *** இறவு படாமலிருந்த * எண்மர் உலோக பாலீர்காள்! * பறவை அரையா! உறகல் * பள்ளியறைக் குறிக்கோண்மின். ",
            10: "🙏 அரவத்து அமளியினோடும் * அழகிய பாற்கடலோடும் * அரவிந்தப் பாவையும் தானும் * அகம்படி வந்து புகுந்து *** பரவைத் திரை பல மோதப் * பள்ளி கொள்கின்ற பிரானை * பரவுகின்றான் விட்டுசித்தன் * பட்டினம் காவற் பொருட்டே. ",
        },
        'PAT.5.3.steps':
        {
            1: "🙏 துக்கச் சுழலையைச் சூழ்ந்து கிடந்த * வலையை அறப் பறித்து * புக்கினில் புக்குன்னைக் கண்டு கொண்டேன் * இனிப் போக விடுவதுண்டோ? *** மக்கள் அறுவரைக் கல்லிடை மோத * இழந்தவள் தன்வயிற்றில் * சிக்கென வந்து பிறந்து நின்றாய்! * திருமாலிருஞ்சோலை எந்தாய்! ",
            2: "வளைத்து வைத்தேன் இனிப் போகலொட்டேன் * உன்தன் இந்திர ஞாலங்களால் * ஒளித்திடில் நின் திருவாணை கண்டாய் * நீ ஒருவர்க்கும் மெய்யன் அல்லை *** அளித்தெங்கும் நாடும் நகரமும் * தம்முடைத் தீவினை தீர்க்கலுற்று * தெளித்து வலஞ்செய்யும் தீர்த்தமுடைத் * திருமாலிருஞ்சோலை எந்தாய்! ",
            3: "#உனக்குப் பணி செய்திருக்கும் தவமுடையேன் * இனிப்போய் ஒருவன்தனக்குப் பணிந்து * கடைத்தலை நிற்கை * நின்சாயை அழிவு கண்டாய் *** புனத்தினை கிள்ளிப் புது அவி காட்டி * உன் பொன்னடி வாழ்கவென்று * இனக் குறவர் புதியது உண்ணும் * எழில் திருமாலிருஞ்சோலை எந்தாய்! ",
            4: "காதம் பலவும் திரிந்து உழன்றேற்கு * அங்கோர் நிழலில்லை நீரில்லை * உன்பாத நிழல் அல்லால் மற்றோர் உயிர்ப்பிடம் * நான் எங்கும் காண்கின்றிலேன் *** தூதுசென்றாய்! குரு பாண்டவர்க்காய் * அங்கோர் பொய் சுற்றம் பேசிச்சென்று * பேதஞ்செய்து எங்கும் பிணம் படைத்தாய்! * திருமாலிருஞ்சோலை எந்தாய்! ",
            5: "காலும் எழா கண்ண நீரும் நில்லா * உடல் சோர்ந்து நடுங்கி * குரல்மேலும் எழா மயிர்க்கூச்சும் அறா * எனதோள்களும் வீழ்வொழியா *** மால் உகளா நிற்கும் என் மனனே! * உன்னை வாழத் தலைப் பெய்திட்டேன் * சேலுகளா நிற்கும் நீள்சுனை சூழ் * திருமாலிருஞ்சோலை எந்தாய்! ",
            6: "எருத்துக் கொடியுடையானும் * பிரமனும் இந்திரனும் * மற்றும்ஒருத்தரும் இப் பிறவியென்னும் நோய்க்கு * மருந்து அறிவாருமில்லை *** மருத்துவனாய் நின்ற மாமணிவண்ணா! * மறு பிறவி தவிரத்திருத்தி * உன்கோயில் கடைப்புகப் பெய் * திருமாலிருஞ்சோலை எந்தாய்! ",
            7: "அக்கரையென்னு மனத்தக் கடலுள் அழுந்தி * உன் பேர் அருளால் * இக்கரையேறி இளைத்திருந்தேனை * அஞ்சலென்று கை கவியாய் *** சக்கரமும் தடக்கைகளும் * கண்களும் பீதகவாடையொடும் * செக்கர் நிறத்துச் சிவப்புடையாய்! * திருமாலிருஞ்சோலை எந்தாய்! ",
            8: "எத்தனை காலமும் எத்தனையூழியும் * இன்றொடு நாளையென்றே * இத்தனை காலமும் போய்க் கிறிப் பட்டேன் * இனி உன்னைப் போகலொட்டேன் *** மைத்துனன்மார்களை வாழ்வித்து * மாற்றலர் நூற்றுவரைக் கெடுத்தாய்! * சித்தம் நின்பாலது அறிதி அன்றே * திருமாலிருஞ்சோலை எந்தாய்! ",
            9: "அன்று வயிற்றில் கிடந்திருந்தே * அடிமை செய்யல் உற்றிருப்பன் * இன்று வந்து இங்கு உன்னைக் கண்டு கொண்டேன் * இனிப்போக விடுவதுண்டே? *** சென்று அங்கு வாணனை ஆயிரந்தோளும் * திருச் சக்கரம் அதனால் தென்றித் * திசைதிசை வீழச் செற்றாய்! * திருமாலிருஞ்சோலை எந்தாய்! ",
            10: "🙏 சென்று உலகம் குடைந்தாடும் சுனைத் * திருமாலிருஞ்சோலை தன்னுள் நின்ற பிரான் * அடிமேல் அடிமைத் திறம் * நேர்பட விண்ணப்பஞ்செய் *** பொன் திகழ் மாடம் பொலிந்து தோன்றும் * புதுவைக்கோன் விட்டுசித்தன் * ஒன்றினோடு ஒன்பதும் பாட வல்லார் * உலகமளந்தான் தமரே. ",
        },
        'PAT.5.4.steps':
        {
            1: "🙏 #சென்னியோங்கு * தண்திருவேங்கடமுடையாய்! * உலகுதன்னை வாழநின்றநம்பீ! * தாமோதரா! சதிரா! *** என்னையும் என்னுடைமையையும் * உன் சக்கரப்பொறியொற்றிக்கொண்டு * நின்னருளே புரிந்திருந்தேன் * இனிஎன்திருக்குறிப்பே? ",
            2: "பறவையேறு பரம்புருடா! * நீஎன்னைக் கைக்கொண்டபின் * பிறவியென்னும் கடலும்வற்றிப் * பெரும்பதம் ஆகின்றதால் *** இறவு செய்யும் பாவக்காடு * தீக்கொளீ இவேகின்றதால் * அறிவையென்னும் அமுதவாறு * தலைப்பற்றி வாய்க்கொண்டதே. ",
            3: "எம்மனா! என்குலதெய்வமே! * என்னுடையநாயகனே! * நின் உளேனாய்ப் பெற்றநன்மை * இவ்வுலகினில் ஆர் பெறுவார்? *** நம்மன் போலே வீழ்த்தமுக்கும் * நாட்டிலுள்ள பாவமெல்லாம் * சும்மெனாதே கைவிட்டோடித் * தூறுகள் பாய்ந்தனவே. ",
            4: "கடல் கடைந்து அமுதம் கொண்டு * கலசத்தை நிறைத்தாற் போல் * உடலுருகி வாய்திறந்து * மடுத்து உன்னை நிறைத்துக் கொண்டேன் *** கொடுமை செய்யும் கூற்றமும் * என்கோல் ஆடி குறுகப்பெறா * தடவரைத்தோள் சக்கரபாணீ! * சார்ங்கவிற் சேவகனே! ",
            5: "#பொன்னைக் கொண்டு உரைகல் மீதே * நிறமெழ உரைத்தாற்போல் * உன்னைக்கொண்டு என்நாவகம் பால் * மாற்றின்றி உரைத்துக்கொண்டேன் *** உன்னைக் கொண்டு என்னுள் வைத்தேன் * என்னையும் உன்னிலிட்டேன் * என்னப்பா! என்னிருடீகேசா! * என்னுயிர்க் காவலனே! ",
            6: "உன்னுடைய விக்கிரமம் * ஒன்றொழியாமல் எல்லாம் * என்னுடைய நெஞ்சகம்பால் * சுவர்வழி எழுதிக்கொண்டேன் *** மன்னடங்க மழுவலங்கைக் கொண்ட * இராமநம்பீ! * என்னிடை வந்து எம்பெருமான்! * இனியெங்குப் போகின்றதே? ",
            7: "🙏 பருப் பதத்துக் கயல்பொறித்த * பாண்டியர்குலபதிபோல் * திருப்பொலிந்தசேவடி * என் சென்னியின்மேல்பொறித்தாய் *** மருப்பொசித்தாய்! மல்லடர்த்தாய்! * என்றென்று உன்வாசகமே * உருப்பொலிந்த நாவினேனை * உனக்கு உரித்தாகினையே. ",
            8: "அனந்தன்பாலும் கருடன்பாலும் * ஐதுநொய்தாக வைத்து * என்மனந்தனுள்ளே வந்து வைகி * வாழச் செய்தாய் எம்பிரான்! *** நினைந்து என்னுள்ளே நின்று நெக்குக் * கண்கள் அசும்பொழுக * நினைந்திருந்தே சிரமம் தீர்ந்தேன் * நேமிநெடியவனே! ",
            9: "பனிக்கடலில் பள்ளிகோளைப் * பழகவிட்டு * ஓடிவந்து என் மனக்கடலில் வாழவல்ல * மாய மணாளநம்பீ! *** தனிக்கடலே! தனிச்சுடரே! * தனியுலகே என்றென்று * உனக்கிடமாயிருக்க * என்னை உனக்கு உரித்தாக்கினையே. ",
            10: "🙏 தடவரை வாய் மிளிர்ந்து மின்னும் * தவள நெடுங்கொடிபோல் * சுடரொளியாய் நெஞ்சினுள்ளே * தோன்றும் என்சோதிநம்பி! *** வடதடமும் வைகுந்தமும் * மதிள் துவராபதியும் * இடவகைகள் இகழ்ந்திட்டு * என்பால் இடவகை கொண்டனையே. ",
            11: "🙏 வேயர் தங்கள் குலத்துதித்த * விட்டுசித்தன் மனத்தே * கோயில்கொண்ட கோவலனைக் * கொழுங்குளிர் முகில்வண்ணனை *** ஆயரேற்றை அமரர்கோவை * அந்தணர் தம் அமுதத்தினை * சாயைபோலப் பாடவல்லார் தாமும் * அணுக்கர்களே. ",
        },
    };
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};