window.CURRENT_TEXT_DICTIONARY = window.CURRENT_TEXT_DICTIONARY || {};
window.CURRENT_TEXT_DICTIONARY["PMT"] = window.CURRENT_TEXT_DICTIONARY["PMT"] || {};
window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] = window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] || {};

Object.assign(window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"], {
  "1": "தேட்டரும் திறல் தேனினைத் * தென்னரங்கனை * திருமாது வாழ் வாட்டமில் வனமாலை மார்பனை வாழ்த்தி * மால்கொள் சிந்தையராய் * ஆட்டமேவி அலந்தழைத்து * அயற்வெய்தும் மெய்யடியார்கள் தம் * ஈட்டம் கண்டிடக் கூடுமேல் * அது காணும் கண் பயன் ஆவதே *",
  "2": "தோடுலா மலர்மங்கை தோளிணை தோய்ந்ததும் * சுடர் வாளியால் * நீடு மாமரம் செற்றதும் நிரை மேய்த்ததும் * இவையே நினைந்து * ஆடிப்பாடி அரங்கவோ! என்றழைக்கும் * தொண்டரடிப்பொடி ஆட நாம் பெறில் * கங்கை நீர் குடைந்தாடும் * வேட்கை என்னாவதே? *",
  "3": "ஏறடர்த்ததும் ஏனமாய் நிலம் கீண்டதும் * முன் இராமன்ஆய் * மாறடர்த்ததும் மண்ணளந்ததும் * சொல்லிப் பாடி * வன்பொன்னிப்பே ராறு போல் வரும் கண்ணனீர் கொண்டு * அரங்கள் கோயில் திருமுற்றம் * சேறு செய் தொண்டர் சேவடிச் * செழுஞ்சேறு என் சென்னிக்கு அணிவனே *",
  "4": "தோய்த்த தண் தயிர் வெண்ணெய் பாலுடன் உண்டலும் * உடன்ராய்ச்சி கண்டு * ஆர்த்த தோளுடை எம்பிரான் * என் அரங்கனுக்கு அடியார்களாய் * நாத்தழும்பெழ நாரணா என்றழைத்து * மெய் தழும்பத் தொழுது ஏத்தி * இன்புறும் தொண்டர் சேவடி * ஏத்தி வாழ்த்தும் என் நெஞ்சமே *",
  "5": "பொய்சிலைக் குலரேற்றெருத்தம் இறுத்துப் * போரரவீர்த்த கோன் * செய்சிலைச் சுடர் சூழ்ஒளித் * திண்ண மாமதிள் தென்னரங்கனாம் * மெய்சிலைக் கருமேகம் ஒன்று * தம் நெஞ்சில் நின்று திகழப் போய் * மெய்சிலிர்ப்பவர் தம்மையே நினைந்து * என் மனம் மெய் சிலிர்க்குமே *",
  "6": "ஆதி அந்தம் அனந்தம் அற்புதமாய் * வானவர் தம் பிரான் * பாத மாமலர் சூடும் பத்தி இலாத * பாவிகள் உய்ந்திட * தீதில் நன்னெறி காட்டி * எங்கும் திரிந்து அரங்கள் எம்மாலுக்கே * காதல் செய் தொண்டர்க்கு எப்பிறப்பிலும் * காதல் செய்யும் என் நெஞ்சமே *",
  "7": "காரினம் புரை மேனி நற்கதிர் * முத்த வெண்ணகைச் செய்ய வாய் * ஆரமார்பன் அரங்கள் என்னும் * அருபெரும் சுடர் ஒன்றினை * சேரும் நெஞ்சினராகிச் * சேர்ந்து கசிந்திழிந்த கண்ணீர்களால் * வார நிற்பவர் தாளிணைக்கு * ஒரு வாரமாகும் என் நெஞ்சமே *",
  "8": "மாலையற்ற கடல் கிடந்தவன் * வண்டுகிண்டு நறுந்துழாய் * மாலையுற்ற வரைப்பெரும் திருமார்பனை * மலர்க்கண்ணனை * மாலையுற்று எழுந்து ஆடிப்பாடித் * திரிந்து அரங்கள் எம்மாலுக்கே * மாலையுற்றிடும் தொண்டர் வாழ்வுக்கு * மாலையுற்றது என் நெஞ்சமே *",
  "9": "மொய்த்துக் கண்பனி சோர மெய்கள் சிலிர்ப்ப * ஏங்கி இளைத்து நின்று * எய்த்துக் கும்பிடு நட்டம் இட்டெழுந்து * ஆடிப்பாடி இறைஞ்சி * என் அத்தன் அச்சன் அரங்கனுக்கு அடியார்களாகி * அவனுக்கே பித்தராய் அவர் * பித்தர் அல்லர்கள் * மற்றையார் முற்றும் பித்தரே *",
  "10": "அல்லி மாமலர் மங்கை நாதன் * அரங்கள் மெய்யடியார்கள் தம் * எல்லையில் அடிமைத் திறத்தினில் * என்றும் மேவு மனத்தனாம் * கொல்லிகாவலன் கூடல்நாயகன் * கோழிக்கோன் குலசேகரன் * சொல்லின் இன்தமிழ் மாலை வல்லவர் * தொண்டர் தொண்டர்கள் ஆவரே *"
});