window.CURRENT_TEXT_DICTIONARY = window.CURRENT_TEXT_DICTIONARY || {};
window.CURRENT_TEXT_DICTIONARY["PMT"] = window.CURRENT_TEXT_DICTIONARY["PMT"] || {};
window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] = window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] || {};

Object.assign(window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"], {
  "1": "மெய்யில் வாழ்க்கையை * மெய்யெனக் கொள்ளும் * இவ் வையம் தன்னோடும் * கூடுவதில்லை யான் * ஐயனே! * அரங்கா! என்று அழைக்கின்றேன் * மையல் கொண்டொழிந்தேன் * எந்தன் மாலுக்கே *",
  "2": "நூலினேர் இடையார் * திறத்தே நிற்கும் * ஞாலம் தன்னோடும் * கூடுவதில்லை யான் * ஆலியா அழையா * அரங்கா! என்று * மாலெழுந்து ஒழிந்தேன் * எந்தன் மாலுக்கே *",
  "3": "மாறனார் * வரிவெஞ்சிலைக்கு ஆட்செய்யும் * பாரினாரோடும் * கூடுவதில்லை யான் * ஆரமார்பன் * அரங்கள் அனந்தன் * நல் நாரணன் * நரகாந்தகன் பித்தனே *",
  "4": "உண்டியே உடையே * உகந்தோடும் * இம் மண்டலத்தோடும் * கூடுவதில்லை யான் * அண்டவாணன் * அரங்கள் வன்பேய் முலை * உண்ட வாயன் தன் * உன்மத்தன் காண்மினே *",
  "5": "தீதில் நன்னெறி நிற்க * அல்லாது செய் * நீதியாரோடும் * கூடுவதில்லை யான் * ஆதி ஆயன் * அரங்கள் அந்தாமரைப் * பேதைமா * பேதைமா மணவாளன் தன் பித்தனே *",
  "6": "எம்பரத்தர் * அல்லாரோடும் கூடலன் * உம்பர் வாழ்வை * ஒன்றாகக் கருதிலன் * தம்பிரான் அமரர்க்கு * அரங்கா நகர் * எம்பிரானுக்கு * எழுமையும் பித்தனே *",
  "7": "எத்திறத்திலும் * யாரோடும் கூடும் * அச் சித்தம் தன்னைத் * தவிர்த்தனன் செங்கண்மால் * அத்தனே! * அரங்கா! என்று அழைக்கின்றேன் * பித்தனாய் ஒழிந்தேன் எம்பிரானுக்கே *",
  "8": "பேயரே * எனக்கு யாவரும் * யானும் ஓர் பேயனே * எவர்க்கும் இது பேசி என்! * ஆயனே! * அரங்கா! என்று அழைக்கின்றேன் * பேயனாய் ஒழிந்தேன் * எம்பிரானுக்கே *",
  "9": "அங்கை ஆழி * அரங்கள் அடியிணை * தங்கு சிந்தைத் * தனிப் பெரும் பித்தனாய் * கொங்கர்கோன் * குலசேகரன் சொன்ன சொல் * இங்கு வல்லவர்க்கு ஏதம் ஒன்றில்லையே *",
  "10": "மெய் நூல் மாறனார் உண்டி தீதில் எம்பரத்தர் எத்திறத்திலும் பேயரே அங்கை ஊன் *"
});