window.CURRENT_TEXT_DICTIONARY = window.CURRENT_TEXT_DICTIONARY || {};
window.CURRENT_TEXT_DICTIONARY["PMT"] = window.CURRENT_TEXT_DICTIONARY["PMT"] || {};
window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] = window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] || {};

Object.assign(window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"], {
  "1": "ஊனேறு செல்வத்து * உடற்பிறவி யான் வேண்டேன் * ஆனேறேழ் வென்றான் * அடிமைத் திறம் அல்லால் * கூனேறு சங்கம் இடத்தான் தன் * வேங்கடத்து * கோன் ஏரி வாழும் * குருகாய் பிறப்பேனே *",
  "2": "ஆனாத செல்வத்து * அரம்பையர்கள் தற்சூழ * வானாளும் செல்வமும் * மண்ணரசும் யான் வேண்டேன் * தேனார் பூஞ்சோலைத் * திருவேங்கடச் சுனையில் * மீனாய் பிறக்கும் * விதி உடையேன் ஆவேனே *",
  "3": "பின்னிட்ட சடையானும் * பிரமனும் இந்திரனும் * துன்னிட்டுப் புகல் அரிய * வைகுந்த நீள் வாசல் * மின்வட்டச் சுடர் ஆழி * வேங்கடக் கோன் தாணுமிழும் * பொன் வட்டில் பிடித்துடனே * புகப் பெறுவேன் ஆவேனே *",
  "4": "ஒண்பவள வேலை * உலாவு தண் பாற்கடலுள் * கண் துயிலும் மாயோன் * கழலிணைகள் காண்பதற்கு * பண் பகரும் வண்டினங்கள் * பண் பாடும் வேங்கடத்து * செண்பகமாய் நிற்கும் * திருவுடையேன் ஆவேனே *",
  "5": "கம்பமத யானை * கழுத்தகத்தின் மேல் இருந்து * இன்பமரும் செல்வமும் * இவ்வரசும் யான் வேண்டேன் * எம்பெருமான் ஈசன் * எழில் வேங்கட மலை மேல் * தம்பகமாய் நிற்கும் * தவ முடையேன் ஆவேனே *",
  "6": "மின்னனைய நுண்ணிடையார் * உருப்பசியும் மேனகையும் * அன்னவர் தம் பாடலொடும் * ஆடல் அவை ஆதரியேன் * தென்னவென வண்டினங்கள் * பண் பாடும் வேங்கடத்துள் * அன்னனைய பொற்குடவாம் * அருந்தவத்தன் ஆவேனே *",
  "7": "வானாளும் மாமதி போல் * வெண்குடைக் கீழ் * மன்னவர் தம் கோனாகி வீற்றிருந்து * கொண்டாடும் செல்வறியேன் * தேனார் பூஞ்சோலைத் * திருவேங்கட மலை மேல் * கானாறாய் பாயும் * கருத்துடையேன் ஆவேனே *",
  "8": "பிறை ஏறு சடையானும் * பிரமனும் இந்திரனும் * முறையான பெருவேள்விக் * குறை முடிப்பான் மறையானான் * வெறியார் தண்சோலைத் * திருவேங்கட மலை மேல் * நெறியாய்க் கிடக்கும் * நிலை உடையேன் ஆவேனே *",
  "9": "செடியாய வல்வினைகள் * தீர்க்கும் திருமாலே! * நெடியானே! வேங்கடவா! * நின் கோயிலின் வாசல் * அடியாரும் வானவரும் * அரம்பையரும் கிடந்து இயங்கும் * படியாய்க் கிடந்து * உன் பவளவாய் காண்பேனே *",
  "10": "உம்பர் உலகாண்டு * ஒரு குடைக் கீழ் உருப்பசி தன் * அம்பொற்கலை அல்குல் * பெற்றாலும் ஆதரியேன் * செம்பவள வாயான் * திருவேங்கடம் என்னும் * எம்பெருமான் பொன்மலை மேல் * ஏதேனும் ஆவேனே *",
  "11": "மன்னிய தண்சாரல் * வடவேங்கடத்தான் தன் * பொன்னியலும் சேவடிகள் * காண்பான் புரிந்து இறைஞ்சி * கொன்னவிலும் கூர்வேல் * குலசேகரன் சொன்ன * பன்னிய நூல் தமிழ் வல்லார் * பாங்காய பக்தர்களே *"
});