window.CURRENT_TEXT_DICTIONARY = window.CURRENT_TEXT_DICTIONARY || {};
window.CURRENT_TEXT_DICTIONARY["PMT"] = window.CURRENT_TEXT_DICTIONARY["PMT"] || {};
window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] = window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] || {};

Object.assign(window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"], {
  "1": "தருதுயரம் தடாயேல் * உன் சரண் அல்லால் சரண் இல்லை * விரை குழுவும் மலர்ப்பொழில் சூழ் * வித்துவக்கோட்டம்மானே! * அரிசினத்தால் ஈன்ற தாய் அகற்றிடினும் * மற்றவள் தன் அருள் நினைந்தே அழும் குழவி * அதுவே போன்றிருந்தேனே *",
  "2": "கண்டார் இகழ்வனவே * காதலன் தான் செய்திடினும் * கொண்டானை அல்லால் * அறியாக் குலமகள் போல் * விண்தோய் மதிள் புடை சூழ் * வித்துவக்கோட்டம்மா! * நீ கொண்டாளாயாகிலும் * உன் குரைகழலே கூறுவனே *",
  "3": "மீன் நோக்கும் நீள்வயல் சூழ் * வித்துவக்கோட்டம்மா! * என் பால் நோக்காயாகிலும் * உன் பற்றல்லால் பற்றிலேன் * தான் நோக்காது எத்துயரம் * செய்திடினும் * தார்வேந்தன் கோல் நோக்கி வாழும் * குடி போன்றிருந்தேனே *",
  "4": "வாளால் அறுத்துச் சுடினும் * மருத்துவன் பால் * மாளாத காதல் * நோயாளன் போல் மாயத்தால் * மீளாத் துயர் தரினும் * வித்துவக்கோட்டம்மா! * நீ ஆள உனதருளே * பார்ப்பன் அடியேனே *",
  "5": "வெங்கண் திண் களிறு அடர்த்தாய்! * வித்துவக்கோட்டம்மானே! * எங்குப் போய் உய்கேன்? * உன் இணையடியே அடையல் அல்லால் * எங்கும் போய்க் கரை காணாது * எறிகடல் வாய் மீண்டேயும் * வங்கத்தின் கூம்பேறும் * மாப்பறவை போன்றேனே *",
  "6": "செந்தழலே வந்து * அழலைச் செய்திடினும் * செங்கமலம் அந்தரம் சேர் * வெங்கதிரோற்கல்லால் அலராவால் * வெந்துயர் வீட்டাবিடினும் * வித்துவக்கோட்டம்மா! * உன் அந்தமில் சீர்க்கல்லால் * அகம் குழைய மாட்டேனே *",
  "7": "எத்தனையும் வான் மறந்த காலத்தும் * பைங்கூழ்கள் * மைத்தெழுந்த மாமுகிலே * பார்த்திருக்கும் மற்றவை போல் * மெய்த்துயர் வீட்டাবিடினும் * வித்துவக்கோட்டம்மா! * என் சித்தம் மிக உன் பாலே * வைப்பன் அடிலேனே *",
  "8": "தொக்கிலங்குயாறெல்லாம் * பரந்தோடி * தொடுகடலே புக்கன்றிப் புறம் நிற்க * மாட்டாத மற்றவை போல் * மிக்கிலங்கு முகில்நிறத்தாய்! * வித்துவக்கோட்டம்மா! * உன் புக்கிலங்கு சீரல்லால் * புக்கிலன் காண் புண்ணியனே! *",
  "9": "நின்னையே தான் வேண்டி * நீள்செல்வம் வேண்டாதான் தன்னையே * தான் வேண்டும் * செல்வம் போல் மாயத்தால் * மின்னையே சேர் திகிரி * வித்துவக்கோட்டம்மா! * நின்னையே தான் வேண்டி * நிற்பன் அடியேனே *",
  "10": "வித்துவக்கோட்டம்மா! * நீ வேண்டாயே ஆயிடினும் * மற்றாரும் பற்றிலேன் என்று * அவனைத் தாள் நயந்த * கொற்றவேல் தானைக் * குலசேகரன் சொன்ன * நற்றமிழ் பத்தும் வல்லார் * நண்ணார் நரகமே *"
});