window.CURRENT_TEXT_DICTIONARY = window.CURRENT_TEXT_DICTIONARY || {};
window.CURRENT_TEXT_DICTIONARY["PMT"] = window.CURRENT_TEXT_DICTIONARY["PMT"] || {};
window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] = window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"] || {};

Object.assign(window.CURRENT_TEXT_DICTIONARY["PMT"]["ta"], {
  "1": "ஏர்மலர்ப் பூங்குழல் ஆயர் மாதர் * எனிப் பலர் உள்ள இவ்வூரில் * உந்தன் மார்பு தழுவுதற்கு ஆசையின்மை * அறிந்தறிந்தே உந்தன் பொய்யைக் கேட்டு * கூர்மழை போல் பனிக்குதல் எய்திக் * கூசி நடுங்கி யமுனை ஆற்றில் * வார்மணல் குன்றில் புலர நின்றேன் * வாசுதேவா! உன் வரவு பார்த்தே *",
  "2": "கெண்டை ஒண்கண் மடவாள் ஒருத்தி * கீழைக் அகத்துத் தயிர் கடையக் கண்டு * ஒல்லை நானும் கடைவன் என்று * கள்ள விழியை விழித்துப் புக்கு * வண்டமர் பூங்குழல் தாழ்ந்துலாவ * வாள்முகம் வேர்ப்பச் செவ்வாய் துடிப்பா * தண்தயிர் நீ கடைந்திட்ட வண்ணம் * தாமோதரா! மெய்யறிவன் நானே *",
  "3": "கருமலர்க் கூந்தல் ஒருத்தி தன்னைக் * கடைக்கணித்து * ஆங்கே ஒருத்தி தன் பால் மருவி மனம் வைத்து மற்றொருத்திக்கு உரைத்து * ஒரு பேதைக்குப் பொய் குறித்து * புரிகுழல் மங்கை ஒருத்தி தன்னைப் புணர்தி * அவளுக்கும் மெய்யன் அல்லை * மருதிருத்தாய்! உன் வளர்த்தியூடே * வளர்கின்றதால் உந்தன் மாயை தானே *",
  "4": "தாய்முலைப் பாலில் அமுதிருக்கத் * தவழ்ந்து தளர்நடை இட்டுச் சென்று * பேய்முலை வாய் வைத்து நஞ்சை உண்டு * பித்தன் என்றே பிறர் ஏச நின்றாய் * ஆயமிகு காதலோடு யான் இருப்ப * யான்விட வந்த என் தூதியோடே * நீ மிகு போகத்தை நன்குுகந்தாய் * அதுவும் உன் கோரம்புக்கேற்குமன்றே *",
  "5": "மின்னொத்த நுண்ணிடையாளைக் கொண்டு * வீங்கிருள்வாய் எந்தன் வீதியூடே * பொன்னொத்தவாடை குக்கூடலிட்டுப் * போகின்ற போது நான் கண்டு நின்றேன் * கண்ணுற்றவளை நீ கண்ணாலிட்டுக் * கைவிளக்கின்றதும் கண்டே நின்றேன் * என்னுக்கு அவளை விட்டு இங்கு வந்தாய்? * இன்னம் அங்கே நட நம்பி! நீயே *",
  "6": "மற்பொரு தோளுடை வாசுதேவா! * வல்வினையேன் துயில் கொண்டவாறே * இற்றை இரவிடையே மத்தென்னை * இன்னணை மேலிட்டகன்று நீ போய் * அற்றை இரவும் ஓர் பிற்றை நாளும் * அரிவையரோடும் அணைந்து வந்தாய் * எற்றுக்கு நீ என் மருங்கில் வந்தாய்? * எம்பெருமான்! நீ எழுந்தருளே *",
  "7": "பையரவின்னணைப் பள்ளியினாய்! * பண்டையோம் அல்லோம் நாம் * நீ உகக்கும் மையரி ஒண்கண்ணினாரும் அல்லோம் * வைகி எம் சேரி வரவொழி நீ * செய்ய உடையும் திருமுகமும் * செங்கனி வாயும் குழலும் கண்டு * பொய் ஒரு நாள் பட்டதே அமையும * புள்ளுவம் பேசாதே போகு நம்பீ! *",
  "8": "என்னை வருகவெனக் குறித்திட்டு * இனமலர் முல்லையின்பந்தர் நிழல் * மன்னி அவளைப் புணரப் புக்கு * மற்றென்னைக் கண்டு உழறா நெகிழ்ந்தாய் * பொன்னிற ஆடையைக் கையில் தாங்கிப் * பொய் அச்சம் காட்டி நீ போதியenum * இன்னம் என் கையகத்து ஈங்கொரு நாள் * வருதியெல் என் சினம் தீர்வண் நானே *",
  "9": "மங்கல நல்வனமாலை மார்பில் இலங்க * மயில் தழைப்பீலி சூடி * பொங்கிளவாடை அரையில் சாத்திப் * பூங்கொத்துக் காதில் புணரப்பெய்து * கொங்கு நறுங்குழலார்களோடு * குழைந்து குழல் இனிதூதி வந்தாய் * எங்களுக்கு ஒரு நாள் வந்தூத * உன் குழல் இன்னிசை போதராதே *",
  "10": "அல்லிமலர்த் திருமங்கை கேள்வன் தன்னை * நயந்து இளவாய்ச்சிமார்கள் * எல்லிப் பொழுதினில் ஏமத்தூடி * எல்கி உரைத்த உரை அதனை * கொல்லி நகர்க்கிறை கூடற்கோமான் * குலசேகரன் இன்னிசையில் மேவி * சொல்லிய இன்தமிழ் மாலை பத்தும் * சொல்ல வல்லார்க்கு இல்லை துன்பம் தானே *",
  "11": "ஏர் கெண்டை கரு தாய் மின் மற்பொரு பை என்னை மங்கலம் அல்லி ஆலை *"
});