window.MARKER_DATABASE = window.MARKER_DATABASE || {};

// Global function to trigger the merge on-demand
window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'PAT.1.1.steps':
        {
            1: "வண்ண மாடங்கள் சூழ் * திருக்கோட்டியூர் * கண்ணன் கேசவன் * நம்பி பிறந்தினில் *** எண்ணெய் சுண்ணம் * எதிரெதிர் தூவிடக் * கண்ணன் முற்றம் * கலந்து அளராயிற்றே. ",
            2: "ஓடுவார் விழுவார் * உகந்தாலிப்பார் * நாடுவார் நம்பிரான் * எங்குத்தான் என்பார் *** பாடுவார்களும் * பல்பறை கொட்டநின்று * ஆடுவார்களும் * ஆயிற்று ஆய்ப்பாடியே. ",
            3: "பேணிச் சீருடைப் * பிள்ளை பிறந்தினில் * காணத்தாம் புகுவார் * புக்குப்போதுவார் *** ஆணொப்பார் * இவன் நேரில்லைகாண் * திரு வோணத்தான் * உலகாளும் என்பார்களே. ",
            4: "உறியை முற்றத்து * உருட்டி நின்றாடுவார் * நறுநெய் பால்தயிர் * நன்றாகத் தூவுவார் *** செறிமென் கூந்தல் * அவிழத் திளைத்து * எங்கும் அறிவழிந்தனர் * ஆய்ப்பாடி ஆயரே. ",
            5: "கொண்டதாளுறி * கோலக் கொடுமழு * தண்டினர் * பறியோலைச் சயனத்தர் *** விண்டமுல்லை * அரும்பன்ன பல்லினர் * அண்டர் மிண்டிப் புகுந்து நெய்யாடினார். ",
            6: "கையும் காலும் நிமிர்த்துக் * கடார நீர் * பையவாட்டிப் * பசுஞ்சிறு மஞ்சளால் *** ஐயநாவழித் தாளுக்கு * அங்காந்திட * வையம் ஏழும் கண்டாள் * பிள்ளை வாயுளே. ",
            7: "வாயுள் வையகம் கண்ட * மட நல்லார் * ஆயர் புத்திரன் அல்லன் * அருந்தெய்வம் *** பாயசீருடைப் * பண்புடைப் பாலகன் * மாயன் என்று * மகிழ்ந்தனர் மாதரே. ",
            8: "பத்துநாளும் கடந்த * இரண்டாநாள் * எத்திசையும் * சயமரம் கோடித்து *** மத்த மாமலை * தாங்கிய மைந்தனை * உத்தானம் செய்து * உகந்தனர் ஆயரே. ",
            9: "கிடக்கில் தொட்டில் * கிழிய உதைத்திடும் * எடுத்துக் கொள்ளில் * மருங்கையிறுத்திடும் *** ஒடுக்கிப்புல்கில் * உதரத்தே பாய்ந்திடும் * மிடுக்கிலாமையால் * நான் மெலிந்தேன் நங்காய். ",
            10: "செந்நெலார் வயல்சூழ் * திருக்கோட்டியூர் * மன்னு நாரணன் * நம்பி பிறந்தமை *** மின்னுநூல் * விட்டுசித்தன் விரித்த * இப் பன்னுபாடல் வல்லார்க்கு * இல்லை பாவமே. ",
        },
        'PAT.1.2.steps':
        {
            1: "சீதக்கடலுள் * அமுதன்ன தேவகி * கோதைக் குழலாள் * அசோதைக்குப் போத்தந்த *** பேதைக் குழவி * பிடித்துச் சுவைத்துண்ணும் * பாதக் கமலங்கள் காணீரே * பவள வாயீர்! வந்து காணீரே. ",
            2: "முத்தும் மணியும் * வயிரமும் நன்பொன்னும் * தத்திப் பதித்துத் * தலைப் பெய்தாற்போல் *** எங்கும்  பத்து விரலும் * மணிவண்ணன் பாதங்கள் * ஒத்திட்டு இருந்தவா காணீரே * ஒண்ணுதலீர்! வந்து காணீரே. ",
            3: "பணைத்தோள் இளவாய்ச்சி * பால் பாய்ந்த கொங்கை * அணைத்தார உண்டு * கிடந்தஇப்பிள்ளை *** இணைக்காலில் வெள்ளித்தளை நின்றிலங்கும் * கணைக்கால்இருந்தவா காணீரே * காரிகையீர்! வந்து காணீரே. ",
            4: "உழந்தாள் நறுநெய் * ஓரோர்தடாவுண்ண * இழந்தாள் எரிவினால் * ஈர்த்து எழில்மத்தின் *** பழந்தாம்பாலோச்சப் * பயத்தால்தவழ்ந்தான் * * முழந்தாள்இருந்தவாகாணீரே * முகிழ்முலையீர்! வந்து காணீரே. ",
            5: "பிறங்கிய பேய்ச்சி * முலை சுவைத்து உண்டிட்டு * உறங்குவான்போலே * கிடந்த இப்பிள்ளை *** மறங்கொள் இரணியன் * மார்பை முன்கீண்டான் * குறங்குவளை வந்து காணீரே * குவிமுலையீர்! வந்து காணீரே. ",
            6: "மத்தக்களிற்று * வசுதேவர்தம்முடை * சித்தம் பிரியாத * தேவகிதன்வயிற்றில் *** அத்தத்தின் பத்தாநாள் * தோன்றிய அச்சுதன் * முத்தம் இருந்தவா காணீரே * முகிழ்நகையீர்! வந்து காணீரே. ",
            7: "இருங்கை மதகளிறு * ஈர்க்கின்றவனை * பருங்கிப் பறித்துக் கொண்டு * ஓடுபரமன்தன் *** நெருங்குபவளமும் * நேர்நாணும்முத்தும் * மருங்கும்இருந்தவாகாணீரே * வாணுதலீர்! வந்துகாணீரே. ",
            8: "வந்தமதலைக் * குழாத்தை வலிசெய்து * தந்தக் களிறுபோல் * தானே விளையாடும் *** நந்தன் மதலைக்கு * நன்றுமழகிய * உந்திஇருந்தவாகாணீரே * ஒளியிழையீர்! வந்துகாணீரே. ",
            9: "அதிரும் கடல்நிறவண்ணனை * ஆய்ச்சி மதுரமுலையூட்டி * வஞ்சித்து வைத்து * பதரப்படாமே *** பழந்தாம்பாலார்த்த * உதரம்இருந்தவா காணீரே * ஒளிவளையீர்! வந்துகாணீரே. ",
            10: "பெருமாவுரலில் * பிணிப்புண்டிருந்து * அங்கு இருமா மருதம் * இறுத்தஇப்பிள்ளை *** குருமாமணிப்பூண் * குலாவித்திகழும் * திருமார்புஇருந்தவாகாணீரே * சேயிழையீர்! வந்துகாணீரே. ",
            11: "நாள்களோர் நாலைந்து * திங்களளவிலே * தாளை நிமிர்த்துச் * சகடத்தைச் சாடிப்போய் *** வாள்கொள் வளையெயிற்று * ஆருயிர்வவ்வினான் * தோள்கள் இருந்தவா காணீரே * சுரிகுழலீர்! வந்துகாணீரே. ",
            12: "மைத்தடங்கண்ணி * யசோதைவளர்க்கின்ற * செய்த்தலை நீல நிறத்துச் * சிறுப்பிள்ளை *** நெய்த்தலை நேமியும் * சங்கும் நிலாவிய * கைத்தலங்கள் வந்து காணீரே * கனங்குழையீர்! வந்துகாணீரே. ",
            13: "வண்டமர்பூங்குழல் * ஆய்ச்சிமகனாகக் * கொண்டு வளர்க்கின்ற * கோவலக்குட்டற்கு *** அண்டமும் நாடும் * அடங்க விழுங்கிய * கண்டம் இருந்தவா காணீரே * காரிகையீர்! வந்துகாணீரே. ",
            14: "எந்தொண்டை வாய்ச்சிங்கம் * வாவென்று எடுத்துக்கொண்டு * அந்தொண்டை வாய் * அமுது ஆதரித்து *** ஆய்ச்சியர்  தம்தொண்டை வாயால் * தருக்கிப்பருகும் * இச் செந்தொண்டை வாய்வந்து காணீரே * சேயிழையீர்! வந்துகாணீரே. ",
            15: "நோக்கி யசோதை * நுணுக்கிய மஞ்சளால் * நாக்கு வழித்து * நீராட்டும் இந்நம்பிக்கு *** வாக்கும் நயனமும் * வாயும் முறுவலும் * மூக்கும் இருந்தவா காணீரே * மொய்குழலீர்! வந்துகாணீரே. ",
            16: "விண்கொளமரர்கள் * வேதனைதீர * முன் மண்கொள் வசுதேவர் * தம் மகனாய் வந்து *** திண்கொள் அசுரரைத் * தேய வளர்கின்றான் * கண்கள் இருந்தவா காணீரே * கனவளையீர்! வந்துகாணீரே. ",
            17: "பருவம் நிரம்பாமே * பாரெல்லாம்உய்ய * திருவின் வடிவொக்கும் * தேவகி பெற்ற *** உருவு கரிய * ஒளிமணிவண்ணன் * புருவம் இருந்தவா காணீரே * பூண்முலையீர்! வந்துகாணீரே. ",
            18: "மண்ணும் மலையும் * கடலும் உலகேழும் * உண்ணுந்திறத்து * மகிழ்ந்துண்ணும் பிள்ளைக்கு *** வண்ணமெழில்கொள் * மகரக்குழையிவை * திண்ணம் இருந்தவா காணீரே * சேயிழையீர்! வந்துகாணீரே. ",
            19: "முற்றிலும் தூதையும் * முன்கைம்மேல்பூவையும் * சிற்றிலிழைத்துத் * திரிதருவோர்களை *** பற்றிப்பறித்துக்கொண்டு * ஓடும்பரமன்தன் * நெற்றிஇருந்தவாகாணீரே * நேரிழையீர்! வந்துகாணீரே. ",
            20: "அழகிய பைம்பொன்னின் * கோல் அங்கைக்கொண்டு * கழல்கள் சதங்கை * கலந்துஎங்குமார்ப்ப *** மழகன்றினங்கள் * மறித்துத்திரிவான் * குழல்கள்இருந்தவாகாணீரே * குவிமுலையீர்! வந்துகாணீரே. ",
            21: "சுருப்பார்குழலி * யசோதைமுன்சொன்ன * திருப்பாதகேசத்தைத் * தென்புதுவைப்பட்டன் *** விருப்பாலுரைத்த * இருபதோடொன்றும் உரைப்பார்போய் * வைகுந்தத்து ஒன்றுவர்தாமே. ",
        },
        'PAT.1.3.steps':
        {
            1: "மாணிக்கம்கட்டி * வயிரம்இடைகட்டி * ஆணிப்பொன்னால்செய்த * வண்ணச்சிறுத்தொட்டில் *** பேணிஉனக்குப் * பிரமன்விடுதந்தான் * மாணிக்குறளனே! தாலேலோ * வையமளந்தானே! தாலேலோ. ",
            2: "உடையார்கனமணியோடு * ஒண் மாதுளம்பூ * இடைவிரவிக்கோத்த * எழில் தெழ்கினோடு *** விடையேறுகாபாலி * ஈசன்விடுதந்தான் * உடையாய்! அழேல்அழேல்தாலேலோ * உலகமளந்தானே! தாலேலோ. ",
            3: "என்தம்பிரானார் * எழில்திருமார்வர்க்கு * சந்தமழகிய * தாமரைத்தாளர்க்கு *** இந்திரன்தானும் * எழிலுடைக்கிண்கிணி * தந்துஉவனாய்நின்றான்தாலேலோ * தாமரைக்கண்ணனே! தாலேலோ. ",
            4: "சங்கின்வலம்புரியும் * சேவடிக்கிண்கிணியும் * அங்கைச்சரிவளையும் * நாணும்அரைத்தொடரும் *** அங்கண்விசும்பில் * அமரர்கள்போத்தந்தார் * செங்கண்கருமுகிலே! தாலேலோ * தேவகிசிங்கமே! தாலேலோ. ",
            5: "எழிலார்திருமார்வுக்கு * ஏற்குமிவையென்று * அழகியஐம்படையும் * ஆரமும்கொண்டு *** வழுவில்கொடையான் * வயிச்சிரவணன் * தொழுதுவனாய் நின்றான் தாலேலோ * தூமணிவண்ணனே! தாலேலோ. ",
            6: "ஓதக்கடலின் * ஒளிமுத்தின் ஆரமும் * சாதிப்பவளமும் * சந்தச்சரிவளையும் *** மாதக்கவென்று * வருணன்விடுதந்தான் * சோதிச்சுடர்முடியாய்! தாலேலோ * சுந்தரத்தோளனே! தாலேலோ. ",
            7: "கானார் நறுந்துழாய் * கைசெய்த கண்ணியும் * வானார் செழுஞ்சோலைக் * கற்பகத்தின் வாசிகையும் *** தேனார்மலர்மேல் * திருமங்கை போத்தந்தாள் * கோனே! அழேல்அழேல்தாலேலோ * குடந்தைக்கிடந்தானே! தாலேலோ. ",
            8: "கச்சொடுபொற்சுரிகை * காம்பு கனகவளை * உச்சிமணிச்சுட்டி * ஒண்தாள்நிரைப்பொற்பூ *** அச்சுதனுக்கென்று * அவனியாள்போத்தந்தாள் * நச்சுமுலையுண்டாய்! தாலேலோ * நாராயணா! அழேல்தாலேலோ. ",
            9: "மெய்திமிரும் நானப் * பொடியோடு மஞ்சளும் * செய்ய தடங்கண்ணுக்கு * அஞ்சனமும் சிந்துரமும் *** வெய்ய கலைப்பாகி * கொண்டுஉவளாய் நின்றாள் * அய்யா! அழேல்அழேல்தாலேலோ * அரங்கத்தணையானே! தாலேலோ. ",
            10: "வஞ்சனையால் வந்த * பேய்ச்சி முலையுண்ட * அஞ்சனவண்ணனை * ஆய்ச்சி தாலாட்டிய *** செஞ்சொல் மறையவர்சேர் * புதுவைப்பட்டன்சொல் * எஞ்சாமை வல்லவர்க்கு * இல்லைஇடர்தானே. ",
        },
        'PAT.1.4.steps':
        {
            1: "தன்முகத்துச்சுட்டி * தூங்கத் தூங்கத் தவழ்ந்துபோய் * பொன்முகக் கிண்கிணியார்ப்பப் * புழுதியளைகின்றான் *** என்மகன் கோவிந்தன் * கூத்தினை இளமாமதீ! * நின்முகம் கண்ணுளவாகில் * நீஇங்கேநோக்கிப்போ. ",
            2: "என்சிறுக்குட்டன் * எனக்கோர் இன்னமுது எம்பிரான் * தன்சிறுக்கைகளால் * காட்டிக் காட்டி அழைக்கின்றான் *** அஞ்சன வண்ணேனாடு * ஆடலாட உறுதியேல் * மஞ்சில் மறையாதே * மாமதீ! மகிழ்ந்தோடிவா. ",
            3: "சுற்றும் ஒளிவட்டம் * சூழ்ந்து சோதி பரந்தெங்கும் * எத்தனை செய்யினும் * என்மகன் முகம்நேரொவ்வாய் *** வித்தகன் வேங்கடவாணன் * உன்னை விளிக்கின்ற * கைத்தலம் நோவாமே * அம்புலீ! கடிதோடிவா. ",
            4: "சக்கரக்கையன் * தடங்கண்ணால் மலரவிழித்து * ஒக்கலைமேலிருந்து * உன்னையே சுட்டிக்காட்டும்காண் *** தக்கதறிதியேல் * சந்திரா! சலம்செய்யாதே * மக்கட்பெறாத * மலடன் அல்லையேல் வா கண்டாய். ",
            5: "அழகியவாயில் * அமுதவூறல் தெளிவுறா * மழலைமுற்றாத இளஞ்சொல்லால் * உன்னைக் கூவுகின்றான் *** குழகன்சிரீதரன் * கூவக்கூவ நீபோதியேல் * புழை இலவாகாதே * நின்செவி புகர் மாமதீ! ",
            6: "தண்டொடுசக்கரம் * சார்ங்கம் ஏந்தும் தடக்கையன் * கண்துயில் கொள்ளக்கருதிக் * கொட்டாவி கொள்கின்றான் *** உண்ட முலைப்பாலறா கண்டாய் * உறங்காவிடில் * விண்தனில் மன்னிய * மாமதீ! விரைந்தோடிவா. ",
            7: "பாலகனென்று * பரிபவம்செய்யேல் * பண்டொருநாள் ஆலினிலை வளர்ந்த * சிறுக்கனவன் இவன் *** மேலெழப் பாய்ந்து * பிடித்துக்கொள்ளும் வெகுளுமேல் * மாலைமதியாதே * மாமதீ! மகிழ்ந்தோடிவா. ",
            8: "சிறியனென்று என் * இளஞ் சிங்கத்தை இகழேல்கண்டாய் * சிறுமையின் வார்த்தையை * மாவலியிடைச்சென்றுகேள் *** சிறுமைப் பிழை கொள்ளில் * நீயும்உன் தேவைக்குரியை காண் * நிறைமதீ! நெடுமால் * விரைந்து உன்னைக்கூவுகின்றான். ",
            9: "தாழியில் வெண்ணெய் * தடங்கையார விழுங்கிய * பேழைவயிற்று எம்பிரான் * கண்டாய் உன்னைக்கூவுகின்றான் *** ஆழிகொண்டு உன்னை எறியும் * ஐயுறவு இல்லைகாண் * வாழவுறுதியேல் * மாமதீ! மகிழ்ந்தோடிவா. ",
            10: "மைத்தடங்கண்ணி * யசோதை தன் மகனுக்கு * இவை ஒத்தனசொல்லி * உரைத்த மாற்றம் *** ஒளிபுத்தூர் வித்தகன் விட்டுசித்தன் * விரித்ததமிழிவை * எத்தனையும் சொல்ல வல்லவர்க்கு * இடரில்லையே. ",
        },
        'PAT.1.5.steps':
        {
            1: "உய்யஉலகு படைத்துண்ட மணிவயிறா! * ஊழிதோறூழி பலஆலினிலை அதன்மேல் * பையஉயோகு துயில்கொண்ட பரம்பரனே! * பங்கய நீள்நயனத்து அஞ்சனமேனியனே! *** செய்யவள் நின்னகலம் சேமமெனக்கருதிச் * செல்வு பொலிமகரக் காது திகழ்ந்திலக * ஐய! எனக்கு ஒருகால் ஆடுகசெங்கீரை * ஆயர்கள்போரேறே! ஆடுகஆடுகவே. ",
            2: "கோளரியின் உருவங்கொண்டு அவுணனுடலம் * குருதி குழம்பியெழக் கூருகிரால் குடைவாய்! * மீளஅவன் மகனை மெய்ம்மை கொளக்கருதி * மேலையமரர்பதி மிக்கு வெகுண்டுவர *** காளநன்மேகமவை கல்லொடு கால்பொழியக் * கருதி வரைக்குடையாக் காலிகள்காப்பவனே! * ஆள! எனக்கு ஒருகால் ஆடுகசெங்கீரை * ஆயர்கள்போரேறே! ஆடுகஆடுகவே. ",
            3: "நம்முடைநாயகனே! நான்மறையின்பொருளே! * நாவியுள் நற்கமல நான்முகனுக்கு * ஒருகால் தம்மனையானவனே! தரணிதலமுழுதும் * தாரகை இன்னுலகும் தடவிஅதன்புறமும் *** விம்மவளர்ந்தவனே! வேழமும்ஏழ்விடையும் * விரவியவேலைதனுள்வென்றுவருமவனே! * அம்ம! எனக்குஒருகால்ஆடுகசெங்கீரை * ஆயர்கள்போரேறே! ஆடுகஆடுகவே. ",
            4: "வானவர்தாம்மகிழ வன்சகடம் உருள * வஞ்சமுலைப்பேயின் நஞ்சமதுஉண்டவனே! * கானக வல்விளவின் காயுதிரக்கருதிக் * கன்றதுகொண்டெறியும் கருநிறஎன்கன்றே! *** தேனுகனும் முரனும் திண்திறல்வெந்நரகன் * என்பவர்தாம் மடியச் செருவதிரச்செல்லும் * ஆனை! எனக்குஒருகால்ஆடுகசெங்கீரை * ஆயர்கள்போரேறே! ஆடுகஆடுகவே. ",
            5: "மத்தளவும் தயிரும் வார்குழல் நன்மடவார் * வைத்தன நெய் களவால் வாரிவிழுங்கி * ஒருங்கு ஒத்தஇணைமருதம் உன்னியவந்தவரை * ஊருகரத்தினொடும் உந்தியவெந்திறலோய்! *** முத்தினிள முறுவல் முற்ற வருவதன்முன் * முன்னமுகத்தணியார் மொய்குழல்களலைய * அத்த! எனக்கு ஒருகால் ஆடுகசெங்கீரை * ஆயர்கள்போரேறே! ஆடுகஆடுகவே. ",
            6: "காயமலர்நிறவா! கருமுகில்போலுருவா! * கானக மாமடுவில் காளியன் உச்சியிலே * தூயநடம் பயிலும் சுந்தர என்சிறுவா! * துங்கமதக்கரியின் கொம்புபறித்தவனே! *** ஆயமறிந்து பொருவான் எதிர்வந்தமல்லை * அந்தரமின்றி அழித்தாடிய தாளிணையாய்! * ஆய! எனக்கு ஒருகால் ஆடுகசெங்கீரை * ஆயர்கள்போரேறே! ஆடுகஆடுகவே. ",
            7: "துப்புடை ஆயார்கள் தம்சொல்வழுவாது ஒருகால் * தூயகருங்குழல் நல்தோகைமயிலனைய * நப்பினைதன் திறமா நல்விடை ஏழவிய * நல்ல திறலுடைய நாதனும் ஆனவனே! *** தப்பின பிள்ளைகளைத் தனமிகுசோதிபுகத் * தனியொரு தேர்கடவித் தாயொடுகூட்டிய * என் அப்ப! எனக்கு ஒருகால் ஆடுகசெங்கீரை * ஆயர்கள்போரேறே! ஆடுகஆடுகவே. ",
            8: "உன்னையும் ஒக்கலையில் கொண்டு தமில்மருவி * உன்னொடு தங்கள் கருத்தாயின செய்துவரும் * கன்னியரும் மகிழக் கண்டவர் கண்குளிரக் * கற்றவர் தெற்றிவரப் பெற்ற எனக்குஅருளி *** மன்னுகுறுங்குடியாய்! வெள்ளறையாய்! * மதிள்சூழ் சோலைமலைக்கரசே! கண்ணபுரத்தமுதே! * என்னவலம்களைவாய்! ஆடுகசெங்கீரை * ஏழுலகும்முடையாய்! ஆடுகஆடுகவே. ",
            9: "பாலொடு நெய்தயிர் ஒண்சாந்தொடு சண்பகமும் * பங்கயம் நல்ல கருப்பூரமும் நாறிவர * கோலநறும்பவளச் செந்துவர்வாயினிடைக் * கோமள வெள்ளிமுளைப்போல் சிலபல்லிலக *** நீலநிறத்தழகார் ஐம்படையின்நடுவே * நின்கனி வாயமுதம் இற்றுமுறிந்துவிழ * ஏலுமறைப்பொருளே! ஆடுகசெங்கீரை * ஏழுலகும்முடையாய்! ஆடுகஆடுகவே. ",
            10: "செங்கமலக்கழலில் சிற்றிதழ்போல்விரலில் * சேர்திகழ் ஆழிகளும்கிண்கிணியும் * அரையில் தங்கிய பொன்வடமும் தாளநன்மாதுளையின் * பூவொடு பொன்மணியும் மோதிரமும் கிறியும் *** மங்கலஐம்படையும் தோல்வளையும்குழையும் * மகரமும் வாளிகளும் சுட்டியும்ஒத்திலக * எங்கள்குடிக்கரசே! ஆடுகசெங்கீரை * ஏழுலகும்முடையாய்! ஆடுகஆடுகவே. ",
            11: "அன்னமும் மீனுருவும் ஆளரியும் குறளும் * ஆமையுமானவனே! ஆயர்கள்நாயகனே! * என்அவலம்களைவாய்! ஆடுகசெங்கீரை * ஏழுலகும்முடையாய்! ஆடுக ஆடுகவென்று *** அன்னநடைமடவாள் அசோதை உகந்தபரிசு * ஆனபுகழ் புதுவைப்பட்டன் உரைத்ததமிழ் * இன்னிசை மாலைகள் இப்பத்தும் வல்லார் * உலகில் எண்திசையும் புகழ்மிக்கு இன்பமது எய்துவரே. ",
        },
        'PAT.1.6.steps':
        {
            1: "மாணிக்கக்கிண்கிணியார்ப்ப * மருங்கின்மேல் * ஆணிப்பொன்னால்செய்த * ஆய்பொன்னுடைமணி *** பேணிப்பவளவாய் முத்திலங்க * பண்டு காணிகொண்டகைகளால்சப்பாணி * கருங்குழல்குட்டனே! சப்பாணி. ",
            2: "பொன்னரைநாணொடு * மாணிக்கக்கிண்கிணி * தன்னரையாடத் * தனிச்சுட்டிதாழ்ந்தாட *** என்னரைமேல்நின்றிழிந்து * உங்கள் ஆயர்தம் * மன்னரைமேல்கொட்டாய்சப்பாணி * மாயவனே! கொட்டாய்சப்பாணி. ",
            3: "பன்மணிமுத்து * இன்பவளம் பதித்தன்ன * என்மணிவண்ணன்! * இலங்குபொற்றேட்டின்மேல் *** நின்மணிவாய்முத்திலங்க * நின்னம்மைதன் * அம்மணிமேல்கொட்டாய்சப்பாணி * ஆழியங்கையனே! சப்பாணி. ",
            4: "தூநிலாமுற்றத்தே * போந்துவிளையாட * வானிலாஅம்புலீ! * சந்திரா! வாவென்று *** நீநிலாநின்புகழா * நின்றஆயர்தம் * கோநிலாவக் கொட்டாய்சப்பாணி * குடந்தைக்கிடந்தானே! சப்பாணி. ",
            5: "புட்டியில்சேறும் * புழுதியும்கொண்டுவந்து * அட்டியமுக்கி * அகம்புக்கறியாமே *** சட்டித்தயிரும் * தடாவினில்வெண்ணெயும்உண் * பட்டிக்கன்றே! கொட்டாய்சப்பாணி * பற்பநாபா! கொட்டாய்சப்பாணி. ",
            6: "தாரித்துநூற்றுவர் * தந்தைசொல்கொள்ளாது * போருய்த்துவந்து * புகுந்தவர்மண்ணாள *** பாரித்தமன்னர்படப் * பஞ்சவர்க்கு * அன்று தேருய்த்தகைகளால்சப்பாணி * தேவகிசிங்கமே! சப்பாணி. ",
            7: "பரந்திட்டுநின்ற * படுகடல்தன்னை * இரந்திட்டகைம்மேல் * எறிதிரைமோத *** கரந்திட்டுநின்ற * கடலைக்கலங்க * சரந்தொட்டகைகளால்சப்பாணி * சார்ங்கவிற்கையனே! சப்பாணி. ",
            8: "குரக்கினத்தாலே * குரைகடல்தன்னை * நெருக்கிஅணைகட்டி * நீள்நீரிலங்கை *** அரக்கர்அவிய * அடுகணையாலே * நெருக்கியகைகளால்சப்பாணி * நேமியங்கையனே! சப்பாணி. ",
            9: "அளந்திட்டதூணை * அவன்தட்ட * ஆங்கே வளர்ந்திட்டு * வாளுகிர்ச்சிங்கவுருவாய் *** உளந்தொட்டிரணியன் * ஒண்மார்வகலம் * பிளந்திட்டகைகளால்சப்பாணி * பேய்முலையுண்டானே! சப்பாணி. ",
            10: "அடைந்திட்டுஅமரர்கள் * ஆழ்கடல்தன்னை * மிடைந்திட்டுமந்தரம் * மத்தாகநாட்டி *** வடம்சுற்றி * வாசுகிவன்கயிறாக * கடைந்திட்டகைகளால்சப்பாணி * கார்முகில்வண்ணனே! சப்பாணி. ",
            11: "ஆட்கொள்ளத்தோன்றிய * ஆயர்தன் கோவினை * நாட்கமழ்பூம்பொழில் * வில்லிபுத்தூர்ப்பட்டன் *** வேட்கையால்சொன்ன * சப்பாணிஈரைந்தும் * வேட்கையினால்சொல்லுவார் * வினைபோமே. ",
        },
        'PAT.1.7.steps':
        {
            1: "தொடர் சங்கிலிகை சலார்பிலாரென்னத் * தூங்கு பொன்மணியொலிப்ப * படுமும் மதப்புனல்சோர வாரணம்பைய * நின்றுஊர்வதுபோல் *** உடன்கூடிக் கிண்கிணியாரவாரிப்ப * உடைமணி பறைகறங்க * தடந்தாளிணைகொண்டு சார்ங்கபாணி * தளர்நடைநடவானோ. ",
            2: "செக்கரிடை நுனிக்கொம்பில் தோன்றும் * சிறுபிறை முளைப்போல் * நக்கசெந்துவர் வாய்த் திண்ணை மீதே * நளிர்வெண் பல் முளையிலக *** அக்கு வடமுடுத்து ஆமைத் தாலிபூண்ட * அனந்தசயனன் * தக்க மாமணிவண்ணன் வாசுதேவன் * தளர்நடைநடவானோ. ",
            3: "மின்னுக் கொடியும் ஓர்வெண்திங்களும் * சூழ்பரி வேடமுமாய் * பின்னல் துலங்கும் அரசிலையும் * பீதகச் சிற்றாடையொடும் *** மின்னில் பொலிந்ததோர் கார்முகில்போலக் * கழுத்தினில் காறையொடும் * தன்னில் பொலிந்த இருடீகேசன் * தளர்நடைநடவானோ. ",
            4: "கன்னல்குடம் திறந்தால் ஒத்து ஊறிக் * கணகண சிரித்துவந்து * முன்வந்து நின்று முத்தம்தரும் * என் முகில்வண்ணன் திருமார்வன் *** தன்னைப் பெற்றேற்குத் தன்வாயமுதம்தந்து * என்னைத் தளிர்ப்பிக்கின்றான் * தன் எற்று மாற்றலர் தலைகள் மீதே * தளர்நடைநடவானோ. ",
            5: "முன்னலோர் வெள்ளிப் பெருமலைக்குட்டன் * மொடுமொடு விரைந்தோட * பின்னைத் தொடர்ந்ததோர் கருமலைக்குட்டன் * பெயர்ந் தடியிடுவதுபோல் *** பன்னியுலகம் பரவியோவாப் புகழ்ப் * பலதேவனென்னும் * தன் நம்பியோடப்பின் கூடச்செல்வான் * தளர்நடைநடவானோ. ",
            6: "ஒருகாலில்சங்கு ஒருகாலில்சக்கரம் * உள்ளடி பொறித்தமைந்த * இருகாலும்கொண்டு அங்கங்கு எழுதினாற்போல் * இலச்சினை படநடந்து *** பெருகா நின்ற இன்பவெள்ளத்தின்மேல் * பின்னையும் பெய்துபெய்து * கருகார்க் கடல்வண்ணன் காமர்தாதை * தளர்நடைநடவானோ. ",
            7: "படர் பங்கயமலர் வாய்நெகிழப் * பனிபடு சிறு துளிபோல் * இடங்கொண்ட செவ்வாயூறி யூறி * இற்றிற்று வீழநின்று *** கடுஞ் சேக்கழுத்தின் மணிக் குரல்போல் * உடைமணி கணகணென * தடந்தாளினை கொண்டு சார்ங்கபாணி * தளர்நடைநடவானோ. ",
            8: "பக்கம் கருஞ் சிறுப்பாறை மீதே * அருவிகள் பகர்ந்தனைய * அக்குவடம் இழிந்தேறித் தாழ * அணி அல்குல்புடைபெயர *** மக்களுலகினில் பெய்தறியா * மணிக் குழவியுருவின் * தக்க மாமணிவண்ணன் வாசுதேவன் * தளர்நடைநடவானோ. ",
            9: "வெண்புழுதிமேல் பெய்து கொண்டு அளைந்ததோர் * வேழத்தின் கருங்கன்று போல் * தெண் புழுதியாடித் திரிவிக்கிரமன் * சிறுபுகர் படவியர்த்து *** ஒண் போதலர் கமலச்சிறுக்கால் * உறைத்து ஒன்றும்நோவாமே * தண்போது கொண்ட தவிசின்மீதே * தளர்நடைநடவானோ. ",
            10: "திரைநீர்ச் சந்திரமண்டலம் போல் * செங்கண்மால்கேசவன் * தன்  திருநீர் முகத்துத் துலங்கு சுட்டி * திகழ்ந்தெங்கும் புடைபெயர *** பெருநீர்த் திரையெழு கங்கையிலும் * பெரியதோர் தீர்த்த பலம் தருநீர் * சிறுச் சண்ணம் துள்ளம்சோரத் * தளர்நடைநடவானோ. ",
            11: "ஆயர்குலத்தினில் வந்துதோன்றிய * அஞ்சனவண்ணன் தன்னை * தாயர்மகிழ ஒன்னார்தளரத் * தளர்நடை நடந்ததனை *** வேயர்புகழ்விட்டுசித்தன் * சீரால் விரித்தன உரைக்க வல்லார் * மாயன்மணிவண்ணன் தாள்பணியும் * மக்களைப்பெறுவர்களே. ",
        },
        'PAT.1.8.steps':
        {
            1: "பொன்னியல்கிண்கிணி * சுட்டிபுறம்கட்டி * தன்னியலோசை * சலஞ்சலன் என்றிட *** மின்னியல் மேகம் * விரைந்தெதிர் வந்தாற்போல் * என்னிடைக்கோட்டரா அச்சோவச்சோ * எம்பெருமான்! வாரா அச்சோவச்சோ. ",
            2: "செங்கமலப்பூவில் * தேனுண்ணும் வண்டேபோல் * பங்கிகள்வந்து * உன் பவளவாய் மொய்ப்ப *** சங்கு வில் வாள் தண்டு * சக்கரமேந்திய * அங்கைகளாலேவந்து அச்சோவச்சோ * ஆரத்தழுவா வந்துஅச்சோவச்சோ. ",
            3: "பஞ்சவர்தூதனாய்ப் * பாரதம்கைசெய்து * நஞ்சுமிழ் நாகம் * கிடந்த நல்பொய்கை புக்கு *** அஞ்சப்பணத்தின்மேல் * பாய்ந்திட்டுஅருள்செய்த * அஞ்சனவண்ணனே! அச்சோவச்சோ * ஆயர்பெருமானே! அச்சோவச்சோ. ",
            4: "நாறிய சாந்தம் * நமக்கிறைநல்கென்ன * தேறிஅவளும் * திருவுடம்பில்பூச *** ஊறியகூனினை * உள்ளேயொடுங்க * அன்று ஏறவுருவினாய்! அச்சோவச்சோ * எம்பெருமான்! வாராஅச்சோவச்சோ. ",
            5: "கழல்மன்னர்சூழக் * கதிர்போல்விளங்கி * எழலுற்று மீண்டே * இருந்துஉன்னைநோக்கும் *** சுழலைப்பெரிதுடைத் * துச்சோதனனை * அழல விழித்தானே! அச்சோவச்சோ * ஆழியங்கையனே! அச்சோவச்சோ. ",
            6: "போரொக்கப்பண்ணி * இப்பூமிப்பொறைதீர்ப்பான் * தேரொக்கவூர்ந்தாய்! * செழுந்தார் விசயற்காய் *** காரொக்கும்மேனிக் * கரும்பெருங்கண்ணனே! * ஆரத் தழுவா வந்துஅச்சோவச்சோ * ஆயர்கள்போரேறே! அச்சோவச்சோ. ",
            7: "மிக்கபெரும்புகழ் * மாவலிவேள்வியில் * தக்கதி தன்றென்று * தானம்விலக்கிய *** சுக்கிரன்கண்ணைத் * துரும்பால்கிளறிய * சக்கரக்கையனே! அச்சோவச்சோ * சங்கமிடத்தானே! அச்சோவச்சோ. ",
            8: "என்னிதுமாயம்? * என்னப்பன்அறிந்திலன் * முன்னையவண்ணமே * கொண்டு அளவாயென்ன *** மன்னுநமுசியை * வானில்சுழற்றிய * மின்னுமுடியனே! அச்சோவச்சோ * வேங்கடவாணனே! அச்சோவச்சோ. ",
            9: "கண்டகடலும் * மலையும்உலகேழும் * முண்டத்துக் காற்றா * முகில்வண்ணா ஓ! என்று *** இண்டைச் சடைமுடி * ஈசன் இரக்கொள்ள * மண்டை நிறைத்தானே! அச்சோவச்சோ * மார்வில்மறுவனே! அச்சோவச்சோ. ",
            10: "துன்னியபேரிருள் * சூழ்ந்து உலகைமூட * மன்னியநான்மறை * முற்றும்மறைந்திட *** பின்னிவ்வுலகினில் * பேரிருள்நீங்க * அன்று அன்னமதானானே! அச்சோவச்சோ * அருமறைதந்தானே! அச்சோவச்சோ. ",
            11: "நச்சுவார்முன்னிற்கும் * நாராயணன்தன்னை * அச்சோவருகவென்று * ஆய்ச்சியுரைத்தன *** மச்சணிமாடப் * புதுவைகோன்பட்டன்சொல் * நிச்சலும்பாடுவார் * நீள்விசும்பாள்வரே. ",
        },
        'PAT.1.9.steps':
        {
            1: "வட்டுநடுவே * வளர்கின்ற * மாணிக்க மொட்டுநுனையில் * முளைக்கின்றமுத்தேபோல் *** சொட்டுச்சொட்டென்னத் * துளிக்கத்துளிக்க * என் குட்டன்வந்துஎன்னைப்புறம்புல்குவான் * கோவிந்தன்என்னைப்புறம்புல்குவான். ",
            2: "கிங்கிணிகட்டிக் * கிறிகட்டி கையினில் * கங்கணமிட்டுக் * கழுத்தில்தொடர்கட்டி *** தன்கணத்தாலே * சதிராநடந்துவந்து * என்கண்ணன்என்னைப்புறம்புல்குவான் * எம்பிரான்என்னைப்புறம்புல்குவான். ",
            3: "கத்தக்கதித்துக் * கிடந்தபெருஞ்செல்வம் * ஒத்துப்பொருந்திக்கொண்டு * உண்ணாதுமண்ணாள்வான் *** கொத்துத்தலைவன் * குடிகெடத்தோன்றிய * அத்தன்வந்துஎன்னைப்புறம்புல்குவான் * ஆயர்களேறுஎன்புறம்புல்குவான். ",
            4: "நாந்தகமேந்திய * நம்பிசரணென்று * தாழ்ந்த தனஞ்சயற்காகி * தரணியில்  வேந்தர்களுட்க *** விசயன்மணித்திண்தேர் * ஊர்ந்தவன்என்னைப்புறம்புல்குவான் உம்பர்கோன்என்னைப்புறம்புல்குவான். ",
            5: "வெண்கலப் பத்திரம் கட்டி * விளையாடி * கண்பலசெய்த * கருந்தழைக்காவின்கீழ் *** பண்பலபாடிப் * பல்லாண்டிசைப்ப * பண்டு மண் பல கொண்டான் புறம்புல்குவான் * வாமனன்என்னைப்புறம்புல்குவான். ",
            6: "சத்திரமேந்தித் * தனியொருமாணியாய் * உத்தரவேதியில் * நின்றஒருவனை *** கத்திரியர்காணக் * காணிமுற்றும்கொண்ட * பத்திராகாரன் புறம்புல்குவான் * பாரளந்தான்என்புறம்புல்குவான். ",
            7: "பொத்த வுரலைக் கவிழ்த்து * அதன்மேலேறி * தித்தித்தபாலும் * தடாவினில்வெண்ணெயும் *** மெத்தத் திருவயிறு * ஆர விழுங்கிய * அத்தன்வந்துஎன்னைப்புறம்புல்குவான் * ஆழியான்என்னைப்புறம்புல்குவான். ",
            8: "மூத்தவை காண * முது மணற் குன்றேறி * கூத்துஉவந்தாடிக் * குழலால் இசைபாடி *** வாய்த்த மறையோர் வணங்க * இமையவர் ஏத்த வந்து என்னைப்புறம்புல்குவான் * எம்பிரான்என்னைப்புறம்புல்குவான். ",
            9: "கற்பகக் காவு * கருதிய காதலிக்கு * இப்பொழுது ஈவதென்று * இந்திரன் காவினில் *** நிற்பனசெய்து * நிலாத் திகழ் முற்றத்துள் * உய்த்தவன்என்னைப்புறம்புல்குவான் * உம்பர்கோன்என்னைப்புறம்புல்குவான். ",
            10: "ஆய்ச்சி அன்றாழிப்பிரான் * புறம்புல்கிய * வேய்த்தடந்தோளிசொல் * விட்டுசித்தன்மகிழ்ந்து *** ஈத்ததமிழிவை * ஈரைந்தும்வல்லவர் * வாய்த்தநன்மக்களைப்பெற்று * மகிழ்வரே. ",

        }
    };
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};