window.CURRENT_TEXT_DICTIONARY = window.CURRENT_TEXT_DICTIONARY || {};
window.CURRENT_TEXT_DICTIONARY["RN"] = window.CURRENT_TEXT_DICTIONARY["RN"] || {};
window.CURRENT_TEXT_DICTIONARY["RN"]["ta"] = window.CURRENT_TEXT_DICTIONARY["RN"]["ta"] || {};

Object.assign(window.CURRENT_TEXT_DICTIONARY["RN"]["ta"], {
  "11": "சீரிய நான்மறைச் செம்பொருள் * செந்தமிழால் அளித்த பார் இயலும் புகழப் * பாண் பெருமாள் *** சரணாம் பதுமத் தார் இயல் சென்னி இராமாநுசன் தன்னைச் சார்ந்தவர் தம் * காரிய வண்மை என்னால் சொல்லொணாது இக்கடல் இடத்தே *",
  "12": "இடம் கொண்ட கீர்த்தி மழிசைக்கு இறைவன் * இணை அடிப்போது அடங்கும் * இதயத்து இராமாநுசன் *** அம் பொன் பாதம் என்றும் கடம் கொண்டு இறைஞ்சும் திரு முனிவர்க்கு அன்றி காதல் செய்யாத் * திடம் கொண்ட ஞானியர்க்கே * அடியேன் அன்பு செய்வதுவே *",
  "13": "செய்யும் பசுந் துளபத் தொழில் மாலையும் * செந்தமிழில் பெய்யும் * மறைத் தமிழ் மாலையும் *** பேராத சீர் அரங்கத்து ஐயன் கழற்கு அணியும் பரன் தாள் அன்றி * ஆதரியா மெய்யன் * இராமாநுசன் சரணே கதி வேறு எனக்கே *",
  "14": "கதிக்குப் பதறி * வெம் கானமும் கல்லும் கடலும் எல்லாம் கொதிக்கத் * thavam செய்யும் கொள்கை அற்றேன் *** கொல்லி காவலன் சொல் பதிக்கும் கலைக் கவி பாடும் பெரியவர் பாதங்களே * துதிக்கும் பரமன் * இராமாநுசன் என்னைச் சோர்விலனே *",
  "15": "சோராத காதல் பெருஞ்சுழிப்பால் * தொல்லை மாலை ஒன்றும் பாராது அவனைப் * பல்லாண்டு என்று காப்பிடும் *** பான்மையன் தாள் பேராத உள்ளத்து இராமாநுசன் தன் பிறங்கிய சீர் * சாரா மனிசரைச் சேரேன் எனக்கு என்ன தாழ்வு இனியே? *",
  "16": "தாழ்வு ஒன்று இல்லா மறை தாழ்ந்து * தலமுழுதும் கலியே ஆள்கின்ற நாள் வந்து * அளித்தவன் காண்மின் *** அரங்கர் மௌலி சூழ்கின்ற மாலையைச் சூடிக் கொடுத்தவள் தொல் அருளால் * வாழ்கின்ற வள்ளல் * இராமாநுசன் என்னும் மா முனியே *",
  "17": "முனியார் துயரங்கள் முந்திலும் * இன்பங்கள் மொய்த்திடினும் கனியார் மனம் * கண்ணமங்கை நின்றானை *** கலை பரவும் தனி ஆனையை தண் தமிழ் செய்த நீலன் தனக்கு * உலகில் இனியானை * எங்கள் இராமாநுசனை வந்து எய்தினரே *",
  "18": "எய்தற்கு அரிய மறைகளை * ஆயிரம் இன் தமிழால் செய்தற்கு உலகில் வரும் * சடகோபனைச் *** சிந்தையுள்ளே பெய்தற்கு இசையும் பெரியவர் சீரை உயிர்கள் எல்லாம் * உய்தற்கு உதவும் * இராமாநுசன் எம் உறுதுணையே *",
  "19": "உறு பெருஞ்செல்வமும் தந்தையும் தாயும் * உயர் குருவும் வெறி தரு * பூமகள் நாதனும் *** மாறன் விளங்கிய சீர் நெறி தரும் செந்தமிழ் ஆரணமே என்று இந் நீள் நிலத்தோர் * அறிதர நின்ற * இராமாநுசன் எனக்கு ஆர் அமுதே *",
  "20": "ஆரப் பொழில் தென் குருகைப்பிரான் * அமுதத் திருவாய் ஈரத் தமிழின் * இசை உணர்ந்தோர்கட்கு *** இனியவர் தம் சீரைப் பயின்று உய்யும் சீலம்கொள் நாதமுனியை * நெஞ்சால் வாரிப் பருகும் * இராமாநுசன் என் தன் மா நிதியே *"
});