window.CURRENT_TEXT_DICTIONARY = window.CURRENT_TEXT_DICTIONARY || {};
window.CURRENT_TEXT_DICTIONARY["RN"] = window.CURRENT_TEXT_DICTIONARY["RN"] || {};
window.CURRENT_TEXT_DICTIONARY["RN"]["ta"] = window.CURRENT_TEXT_DICTIONARY["RN"]["ta"] || {};

Object.assign(window.CURRENT_TEXT_DICTIONARY["RN"]["ta"], {
  "21": "நிதியைப் பொழியும் முகில் என்று * நீசர் தம் வாசல் பற்றித் * துதி கற்று உலகில் துவள்கின்றிலேன் இனி *** தூய் நெறி சேர் எதிகட்கு இறைவன் யமுனைத்துறைவன் இணை அடியாம் * கதி பெற்றுடைய * இராமாநுசன் என்னைக் காத்தனனே *",
  "22": "கார்த்திகையானும் கரிமுகத்தானும் * கனலும் முக்கண் மூர்த்தியும் * மோடியும் வெப்பும் முதுகிட்டு *** மூவுலகும் பூத்தவனே! என்று போற்றிட வாணன் பிழை பொறுத்த * தீர்த்தனை ஏத்தும் * இராமாநுசன் என்தன் சேம வைப்பே *",
  "23": "வைப்பாய வான் பொருள் என்று * நல் அன்பர் மனத்தகத்தே * எப்போதும் வைக்கும் இராமாநுசனை *** இரு நிலத்தில் ஒப்பார் இலாத உறு வினையேன் வஞ்ச நெஞ்சில் வைத்து * முப்போதும் வாழ்த்துவன் * என்னாம் இது அவன் மொய்ப் புகழ்க்கே? *",
  "24": "மொய்த்த என் தீவினையால் * பல் உடல்தொறும் மூத்து * அதனால் எய்த்து ஒழிந்தேன் * முன நாள்கள் எல்லாம் *** இன்று கண்டு உயர்ந்தேன் பொய்த் தவம் போற்றும் புலைச் சமயங்கள் நிலத்து அவியக் * கைத்த மெய்ஞ்ஞானத்து * இராமாநுசன் என்னும் கார் தன்னையே *",
  "25": "கார் ஏய் கருணை இராமாநுச! * இக் கடலிடத்தில் ஆரே அறிபவர் * நின் அருளின் தன்மை *** அல்லலுக்கு நேரே உறைவிடம் நான் வந்து நீ என்னை உய்த்தபின் * உன் சீரே உயிர்க்கு உயிராய் * அடியேற்கு இன்று தித்திக்குமே *",
  "26": "திக்கு உற்ற கீர்த்தி இராமாநுசனை * என் செய் வினையாம் மெய்க் குற்றம் நீக்கி * விளங்கிய மேகத்தை *** மேவும் நல்லோர் எக்குற்றவாளர் எது பிறப்பு ஏது இயல்வு ஆக நின்றோர் * அக்குற்றம் அப்பிறப்பு * அவ்வியல்வே நம்மை ஆட்கொள்ளுமே *",
  "27": "கொள்ளக் குறைவு அற்று இலங்கி * கொழுந்து விட்டு ஓங்கிய உன் வள்ளல் தனத்தினால் * வல்வினையேன் மனம் நீ புகுந்தாய் *** வெள்ளைச் சுடர் விடும் உன் பெரு மேன்மைக்கு இழுக்கு இது என்று * தள்ளுற்று இரங்கும் * இராமாநுச! என் தனி நெஞ்சமே *",
  "28": "நெஞ்சில் கறை கொண்ட கஞ்சனைக் காய்ந்த நிமலன் * நங்கள் பஞ்சித் திருவடிப் * பின்னை தன் காதலன் *** பாதம் நண்ணா வஞ்சர்க்கு அரிய இராமாநுசன் * புகழ் அன்றி என் வாய் கொஞ்சிப் பரவகில்லாது * என்ன வாழ்வு இன்று கூடியதே! *",
  "29": "கூட்டும் விதி என்று கூடுங்கொலோ? * தென் குருகைப்பிரான் பாட்டு என்னும் * வேதப் பசுந்தமிழ் தன்னை *** தன் பத்தி என்னும் வீட்டின் கண் வைத்த இராமாநுசன் * புகழ் மெய் உணர்ந்தோர் ஈட்டங்கள் தன்னை * என் நாட்டங்கள் கண்டு இன்பம் எய்திடவே *",
  "30": "இன்பம் தரு பெரு வீடு வந்து எய்திலென்? * எண்ணிறந்த துன்பம் தரு * நிரயம் பல சூழிலென்? *** தொல் உலகேல் மன் பல் உயிர்கட்கு இறையவன் மாயன் என மொழிந்த * அன்பன் அனகன் * இராமாநுசன் என்னை ஆண்டனனே *"
});