window.MARKER_DATABASE = window.MARKER_DATABASE || {};

// Global function to trigger the merge on-demand
window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'PTM.10.1.steps': {
            1: "🙏 ஒருநல் சுற்றம் * எனக்குயிர் ஒண்பொருள் * வருநல் தொல்கதி * ஆகிய மைந்தனை *** நெருநல் கண்டது * நீர்மலை இன்றுபோய் * கருநெல் சூழ் * கண்ண மங்கையுள் காண்டுமே ",
            2: "🙏 பொன்னை மாமணியை * அணி ஆர்ந்ததோர் மின்னை * வேங்கடத்து உச்சியில் கண்டுபோய் *** என்னை ஆளுடை ஈசனை * எம்பிரான் தன்னை * யாம் சென்று காண்டும் * தண்காவிலே. ",
            3: "வேலை ஆலிலைப் * பள்ளி விரும்பிய * பாலை ஆரமுதத்தினைப் * பைந்துழாய் *** மாலை ஆலியில் * கண்டு மகிழ்ந்து போய் * ஞால முன்னியைக் காண்டும் * நாங்கூரிலே ",
            4: "துளக்கமில் சுடரை * அவுணனுடல் * பிளக்கும் மைந்தனைப் *** பேரில் வணங்கிப்போய் * அளப்பில் ஆரமுதை * அமரர்க்கு அருள் விளக்கினை * சென்று வெள்ளறைக் காண்டுமே ",
            5: "சுடலையில் * சுடு நீறன் அமர்ந்தது ஓர் * நடலை தீர்த்தவனை * நறையூர் கண்டு *** என் உடலையுள் புகுந்து * உள்ளம் உருக்கியுண் * விடலையைச் சென்று காண்டும் * மெய்யத்துளே ",
            6: "வானை ஆரமுதம் * தந்த வள்ளலை * தேனை நீள்வயல் *** சேறையில் கண்டுபோய் * ஆனை வாட்டி அருளும் * அமரர்தம் கோனை * யாம் குடந்தைச்சென்று காண்டுமே ",
            7: "கூந்தலார் மகிழ் * கோவலனாய் * வெண்ணெய் மாந்தழுந்தையில் * கண்டு மகிழ்ந்துபோய் *** பாந்தள் பாழியில் * பள்ளி விரும்பிய * வேந்தனைச் சென்று காண்டும் * வெஃகாவுளே ",
            8: "பத்தர் ஆவியைப் * பால்மதியை * அணித் தொத்தை *** மாலிருஞ் சோலைத் தொழுதுபோய் * முத்தினை மணியை * மணி மாணிக்க வித்தினை * சென்று விண்ணகர் காண்டுமே ",
            9: "கம்ப மாகளிறு * அஞ்சிக் கலங்க * ஓர் கொம்பு கொண்ட * குரைகழல் கூத்தனை *** கொம்புலாம் பொழில் * கோட்டியூர்க் கண்டுபோய் * நம்பனைச் சென்று கண்டும் * நாவாயுளே ",
            10: "🙏 பெற்றமாளியைப் * பேரில் மணாளனை * கற்ற நூல் * கலிகன்றி உரைசெய்த *** சொல்திறமிவை * சொல்லிய தொண்டர்கட்கு * அற்ற மில்லை * அண்டம் அவர்க்கு ஆட்சியே ",
        },
        'PTM.10.2.steps': {
            1: "🙏 இரக்கமின்றி எங்கோன் செய்த தீமை * இம்மையே எமக்கு எய்திற்றுக் காணீர் * பரக்கயாம் இன்று உரைத்தென் இராவணன் பட்டனன் * இனி யாவர்க்கு உரைக்கோம் *** குரக்கு நாயகர்காள்! இளங்கோவே * கோல வல்விலி இராம பிரானே * அரக்கர் ஆடழைப்பார் இல்லை * நாங்கள் அஞ்சினோம் தடம் பொங்கத்தம் பொங்கோ. ",
            2: "பத்து நீள்முடியும் அவற்றிரட்டிப் * பாழித் தோளும் படைத்தவன் செல்வம் * சித்தம் மங்கையர் பால்வைத்துக் கெட்டான் * செய்வது ஒன்றறியா அடியோங்கள் *** ஒத்த தோள் இரண்டும் ஒரு முடியும் * ஒருவர் தம் திறத்தோம் அன்றி வாழ்ந்தோம் * அத்த! எம் பெருமான்! எம்மைக் கொல்லேல் * அஞ்சினோம் தடம் பொங்கத்தம் பொங்கோ ",
            3: "தண்ட காரணியம் புகுந்து * அன்று தையலைத் தகவிலி எங்கோமான் * கொண்டு போந்து கெட்டான் * எமக்கு இங்கோர் குற்றமில்லை கொல்லேல் குலவேந்தே *** பெண்டிரால் கெடும் இக்குடி தன்னைப் * பேசுகின்றதென்? தாசரதீ * ,உன் அண்ட வாணர் உகப்பதே செய்தாய் * அஞ்சினோம் தடம் பொங்கத்தம் பொங்கோ ",
            4: "எஞ்சலில் இலங்கைக்கிறை * எங்கோன்தன்னை முன்பணிந்து எங்கள்கண் முகப்பே * நஞ்சுதான் அரக்கர் குடிக்கென்று * நங்கையை அவன் தம்பியே சொன்னான் *** விஞ்சை வானவர் வேண்டிற்றே பட்டோம் * வேரிவார் பொழில் மாமயிலன்ன * அஞ்சிலோதியைக் கொண்டு நடமின் * அஞ்சினோம் தடம் பொங்கத்தம் பொங்கோ ",
            5: "செம்பொன் நீள்முடி எங்கள் இராவணன் * சீதை என்பதோர் தெய்வம் கொணர்ந்து * வம்புலாம் கடி காவில் சிறையா வைத்ததே * குற்றம் ஆயிற்றுக் காணீர் *** கும்பேனாடு நிகும்பனும் பட்டான் * கூற்றம் மானிடமாய் வந்து தோன்றி * அம்பினால் எம்மைக் கொன்றிடுகின்றது * அஞ்சினோம் தடம் பொங்கத்தம் பொங்கோ ",
            6: "ஓத மாகடலைக் கடந்தேறி * உயர்க்கொள் மாக் கடிகாவை இறுத்து * காதல் மக்களும் சுற்றமும் கொன்று * கடி இலங்கை மலங்க எரித்துத் *** தூது வந்த குரங்குக்கே * உங்கள் தோன்றல் தேவியை விட்டு கொடாதே * ஆதர் நின்று படுகின்றது அந்தோ! * அஞ்சினோம் தடம் பொங்கத்தம் பொங்கோ ",
            7: "தாழமின்றி முந்நீர் அஞ்ஞான்று * தகைந்ததே கண்டு வஞ்சிநுண் மருங்குல் * மாழை மான்மட நோக்கியை விட்டு * வாழ்கிலா மதியில் மனத்தானை *** ஏழையை இலங்கைக்கு இறை தன்னை * எங்களை ஒழியக் கொலை அவனை * சூழு மாநினை மாமணி வண்ணா! * சொல்லினோம் தடம் பொங்கத்தம் பொங்கோ ",
            8: "மனங்கொண்டேறும் மண்டோதரி முதலா * அங்கயற் கண்ணினார்கள் இருப்ப * தனங்கொள் மென்முலை நோக்க மொழிந்து * தஞ்சமே சில தாபதரென்று *** புனங்கொள் மென்மயிலைச் சிறை வைத்த * புன்மையாளன் நெஞ்சில் புக எய்த * அனங்கன் அன்ன திண்தோள் எம்மிராமற்கு * அஞ்சினோம் தடம் பொங்கத்தம் பொங்கோ ",
            9: "புரங்கள் மூன்றுமோர் மாத்திரைப் போதில் * பொங்கெரிக்கு இரை கண்டவன் அம்பின் * சரங்களே கொடிதாய் அடுகின்ற * சாம்பவான் உடன் நிற்கத் தொழுதோம் *** இரங்கு நீ எமக்கெந்தை பிரானே! * இலங்கு வெங்கதிரோன் தன் சிறுவா * குரங்குகட்கரசே! எம்மைக் கொல்லேல்! * கூறினோம் தடம் பொங்கத்தம் பொங்கோ ",
            10: "🙏 அங்கு அவ்வானவர்க்கு ஆகுலம் தீர * அணி இலங்கை அழித்தவன் தன்னை * பொங்கு மாவலவன் கலி கன்றி * புகன்ற பொங்கத்தம் கொண்டு *** இவ்வுலகில் எங்கும் பாடி நின்று ஆடுமின் தொண்டீர்! * இம்மையே இடர் இல்லை * இறந்தால் தங்குமூர் அண்டமே கண்டு கொண்மின் * சாற்றினோம் தடம் பொங்கத்தம் பொங்கோ! ",
        },
        'PTM.10.3.steps': {
            1: "🙏 ஏத்துகின்றோம் நாத்தழும்ப * இராமன் திருநாமம் * சோத்த நம்பீ! சுக்கிரீவா! * உம்மைத் தொழுகின்றோம் *** வார்த்தை பேசீர் எம்மை * உங்கள் வானரம் கொல்லாமே * கூத்தர் போல ஆடுகின்றோம் * குழமணி தூரமே ",
            2: "எம்பிரானே! என்னை ஆள்வாய் * என்றென்று அலற்றாதே * அம்பின் வாய்ப்பட்டு ஆற்றகில்லாது * இந்திரசித்து அழிந்தான் *** நம்பி அனுமா! சுக்கிரீவ! * அங்கதனே! நளனே * கும்பகர்ணன் பட்டுப்போனான் * குழமணி தூரமே ",
            3: "ஞாலம் ஆளும் உங்கள் கோமான் * எங்கள் இராவணற்கு * காலனாகி வந்தவா * கண்டு அஞ்சிக் கருமுகில்போல் *** நீலன் வாழ்க சுடேணன் வாழ்க * அங்கதன் வாழ்கவென்று * கோலமாக ஆடுகின்றோம் * குழமணி தூரமே ",
            4: "மணங்கள் நாறும் வார்குழலார் * மாதர்கள் ஆதரத்தை * புணர்ந்த சிந்தைப் புன்மையாளன் * பொன்ற வரிசிலையால் *** கணங்களுண்ண வாளியாண்ட * காவலனுக்கு இளையோன் * குணங்கள் பாடி ஆடுகின்றோம் * குழமணி தூரமே ",
            5: "வென்றி தந்தோம் மானம் வேண்டோம் * தானம் எமக்காக * இன்று தம்மின் எங்கள் வாணாள் * எம்பெருமான் தமர்காள் *** நின்று காணீர் கண்களார * நீர் எம்மைக் கொல்லாதே * குன்று போல ஆடுகின்றோம் * குழமணி தூரமே ",
            6: "கல்லின் முந்நீர் மாற்றி வந்து * காவல் கடந்து * இலங்கை அல்லல் செய்தான் உங்கள் கோமான் * எம்மை அமர்க்களத்து *** வெல்ல கில்லாது அஞ்சினோங்காண் * வெங்கதிரோன் சிறுவா * கொல்ல வேண்டா ஆடுகின்றோம் * குழமணி தூரமே ",
            7: "மாற்றமாவது இத்தனையே * வம்மின் அரக்கருள்ளÖர் * சீற்றம் நும்மேல் தீர வேண்டில் * சேவகம் பேசாதே *** ஆற்றல் சான்ற தொல்பிறப்பில் * அனுமனை வாழ்கவென்று * கூற்ற மன்னார் காண ஆடீர் * குழமணி தூரமே ",
            8: "கவள யானை பாய்புரவித் * தேரோடு அரக்கரெல்லாம் துவள * வென்ற வென்றியாளன் * தன்தமர் கொல்லாமே *** தவள மாடம் நீள்அயோத்திக் * காவலன் தன்சிறுவன் * குவளை வண்ணன் காண ஆடீர் * குழமணி தூரமே ",
            9: "ஏடொத்தேந்தும் நீளிலைவேல் * எங்கள் இராவணனார் ஓடிப் போனார் * நாங்கள் எய்தோம் * உய்வதோர் காரணத்தால் *** சூடிப் போந்தோம் உங்கள் கோமன் ஆணை * தொடரேன்மின் * கூடிக்கூடி ஆடுகின்றோம் * குழமணி தூரமே ",
            10: "🙏 வென்ற தொல்சீர்த் தென்னிலங்கை * வெஞ்சமத்து * அன்றரக்கர் குன்ற மன்னார் ஆடி உய்ந்த * குழமணி தூரத்தை *** கன்றி நெய்ந்நீர் நின்ற வேற்கைக் * கலியன் ஒலிமாலை * ஒன்றுமொன்றும் ஐந்தும் மூன்றும் * பாடி நின்று ஆடுமினே ",
        },
        'PTM.10.4.steps': {
            1: "சந்த மலர்க்குழல் தாழத் * தான் உகந்தோடித் தனியே வந்து * என் முலைத் தடந்தன்னை வாங்கி * நின் வாயில் மடுத்து *** நந்தன் பெறப்பெற்ற நம்பீ! * நான் உகந்துண்ணும் அமுதே * எந்தை பெருமனே! உண்ணாய் * என் அம்மம் சேமம் உண்ணாயே ",
            2: "வங்க மறிகடல் வண்ணா! * மாமுகிலே ஒக்கும் நம்பீ * செங்கண் நெடிய திருவே * செங்கமலம் புரை வாயா *** கொங்கை சுரந்திட உன்னைக் * கூவியும் காணாது இருந்தேன் * எங்கிருந்து ஆயர்களோடும் * என் விளையாடுகின்றாயே ",
            3: "திருவில் பொலிந்த எழிலார் * ஆயர்தம் பிள்ளைகளோடு * தெருவில் திளைக்கின்ற நம்பீ * செய்கின்ற தீமைகள் கண்டிட்டு *** உருகிஎன் கொங்கையின் தீம்பால் * ஓட்டந்து பாய்ந்திடுகின்ற * மருவிக் குடங்கால் இருந்து * வாய்முலை உண்ண நீ வாராய் ",
            4: "மக்கள் பெறுதவம் போலும் * வையத்து வாழும் மடவார் * மக்கள் பிறர்கண்ணுக்கு ஒக்கும் * முதல்வா மதக்களிறன்னாய் *** செக்கர் இளம்பிறை தன்னை வாங்கி * நின் கையில் தருவன் * ஒக்கலை மேலிருந்து அம்மம் உகந்து * இனிது உண்ண நீ வாராய் ",
            5: "மைத்த கருங்குஞ்சி மைந்தா! * மாமருதூடு நடந்தாய் * வித்தகனே விரையாதே * வெண்ணெய் விழுங்கும் விகிர்தா *** இத்தனை போதன்றி என்தன் * கொங்கை சுரந்திருக்க கில்லா * உத்தமனே! அம்மம் உண்ணாய் * உலகளந்தாய்! அம்மம் உண்ணாய் ",
            6: "பிள்ளைகள் செய்வன செய்யாய் * பேசின் பெரிதும் வலியை * கள்ளம் மனத்தில் உடையை * காணவே தீமைகள் செய்தி *** உள்ளம் உருகி என் கொங்கை * ஓட்டந்து பாய்ந்திடுகின்ற * பள்ளிக் குறிப்புச் செய்யாதே * பாலமுது உண்ணநீ வாராய் ",
            7: "தன்மகனாக வன் பேய்ச்சி * தான்முலை உண்ணக் கொடுக்க * வன்மகனாய் அவள் ஆவிவாங்கி * முலையுண்ட நம்பி *** நன்மகள் ஆய்மகளோடு * நானில மங்கை மணாளா * என்மகனே! அம்மம் உண்ணாய் * என் அம்மம் சேமம் உண்ணாயே ",
            8: "உந்தம் அடிகள் முனிவர் * உன்னைநான் என்கையில் கோலால் * நொந்திட மோதவும் கில்லேன் * நுங்கள்தம் ஆநிரை எல்லாம் *** வந்து புகுதரும் போது * வானிடைத் தெய்வங்கள் காண * அந்தியம் போது அங்கு நில்லேல் * ஆழியங் கையனே! வாராய் ",
            9: "பெற்றத் தலைவன் எங்கோமான் * பேரருளாளன் மதலாய் * சுற்றக் குழாத்து இளங்கோவே! * தோன்றிய தொல்புகழாளா *** கற்றினந் தோறும் மறித்துக் * கானம் திரிந்த களிறே * எற்றுக்கென் அம்மம் உண்ணாதே * எம்பெருமான் இருந்தாயே ",
            10: "🙏 இம்மை இடர்க்கெட வேண்டி * ஏந்தெழில் தோள்கலி கன்றி * செம்மைப் பனுவல்நூல் கொண்டு * செங்கண் நெடியவன் தன்னை *** அம்மம் உண்ணென்று உரைக்கின்ற * பாடல் இவை ஐந்தும் ஐந்தும் * மெய்ம்மை மனத்து வைத்தேத்த * விண்ணவர் ஆகலுமாமே ",
        },
        'PTM.10.5.steps': {
            1: "🙏 பூங்கோதை ஆய்ச்சி * கடைவெண்ணை புக்குண்ண * ஆங்கவள் ஆர்த்துப் * புடைக்கப் புடையுண்டு *** ஏங்கி இருந்து * சிணுங்கி விளையாடும் * ஓங்கோத வண்ணனே! சப்பாணி * ஒளிமணி வண்ணனே! சப்பாணி . ",
            2: "தாயர் மனங்கள் தடிப்பத் * தயிர்நெய்யுண்டே எம்பிராக்கள் * இருநிலத்து எங்கள்தம் *** ஆயர் அழக * அடிகள் * அரவிந்த வாயவனே! கொட்டாய் சப்பாணி! * மால்வண்ணனே! கொட்டாய் சப்பாணி. ",
            3: "தாமோர் உருட்டித் * தயிர்நெய் விழுங்கிட்டு * தாமோ தவழ்வரென்று * ஆய்ச்சியர் தாம்பினால் *** தாமோதிரக்கையால் * ஆர்க்கத் தழும்பிருந்த * தாமோதரா! கொட்டாய் சப்பாணி! * தாமரைக் கண்ணனே! சப்பாணி ",
            4: "பெற்றார் தளைகழலப் * பேர்ந்தங் கயலிடத்து * உற்றார் ஒருவரும் இன்றி * உலகினில் *** மற்றரும் அஞ்சப்போய் * வஞ்சப்பெண் நஞ்சுண்ட * கற்றாயனே! கொட்டாய் சப்பாணி! * கார்வண்ணனே!கொட்டாய் சப்பாணி ",
            5: "சோத்தென நின்னைத் * தொழுவன் வரம் தர * பேய்ச்சி முலையுண்ட பிள்ளாய் *** பெரியன ஆய்ச்சியர் * அப்பம் தருவர் * அவர்க்காகச் சாற்றியோர் ஆயிரம் சப்பாணி! * தடங்கைகளால் கொட்டாய் சப்பாணி ",
            6: "கேவலம் அன்று * உன்வயிறு வயிற்றுக்கு * நான் வலவப்பம் தருவன் *** கருவிளைப் பூவலர் நீள்முடி * நந்தன்றன் போரேறே * கோவலனே! கொட்டாய் சப்பாணி! * குடமாடீ! கொட்டாய் சப்பாணி. ",
            7: "புள்ளினை வாய்பிளந்து * பூங்குருந்தம் சாய்த்து * துள்ளி விளையாடித் * தூங்குறி வெண்ணெயை *** அள்ளிய கையால் * அடியேன் முலைநெருடும் * பிள்ளைப்பிரான்! கொட்டாய் சப்பாணி! * பேய்முலை உண்டானே! சப்பாணி. ",
            8: "யாயும் பிறரும் * அறியாத யாமத்து * மாய வலவைப் * பெண் வந்து முலைதர *** பேயென்று அவளைப் * பிடித்து உயிரை உண்ட * வாயவனே! கொட்டாய் சப்பாணி! * மால்வண்ணனே! கொட்டாய் சப்பாணி. ",
            9: "கள்ளக் குழவியாய்க் * காலால் சகடத்தை * தள்ளி உதைத்திட்டுத் * தாயாய் வருவாளை *** மெள்ளத் தொடர்ந்து * பிடித்து ஆருயிருண்ட * வள்ளலே! கொட்டாய் சப்பாணி! * மால்வண்ணனே! கொட்டாய் சப்பாணி. ",
            10: "🙏 காரார் புயல்கைக் * கலிகன்றி மங்கையர்கோன் * பேராளன் நெஞ்சில் * பிரியாது இடங்கொண்ட சீராளா *** செந்தாமரைக் கண்ணா! * தண்துழாய்த் * தாராளா கொட்டாய் சப்பாணி! * தடமார்வா கொட்டாய் சப்பாணி. ",
        },
        'PTM.10.6.steps': {
            1: "🙏 எங்கானும் ஈதொப்பதோர் மாயமுண்டே? * நரநாரணனாய் உலகத்து அறநூல் * சிங்காமை விரித்தவன் எம்பெருமான் * அதுவன்றியும் செஞ்சுடரும் நிலனும் *** பொங்கார் கடலும் பொருப்பும் நெருப்பும் நெருக்கிப் புக * பொன்மிடறு அத்தனைபோது * அங்காந்தவன் காண்மின் இன்று ஆய்ச்சியரால் * அளைவெண்ணெய் உண்டு ஆப்புண்டிருந்தவனே. ",
            2: "குன்றொன்று மத்தா அரவம் அளவிக் * குரைமாகடலைக் கடைந்திட்டு * ஒருகால் நின்று உண்டை கொண்டோட்டி வன்கூன் நிமிர * நினைத்த பெருமான் அது அன்றியும்முன் *** நன்றுண்ட தொல்சீர் மகரக் கடலேழ் * மலையேழ் உலகேழ் ஒழியாமை நம்பி * அன்றுண்டவன் காண்மின் இன்று ஆய்ச்சியரால் * அளைவெண்ணெய் உண்டு ஆப்புண்டிருந்தவனே ",
            3: "உளைந்திட்டு எழுந்த மதுகைடவர்கள் * உலப்பில் வலியால் அவர்பால் * வயிரம் விளைந்திட்டது என்றெண்ணி விண்ணோர் பரவ * அவர் நாளொழித்த பெருமான் முனநாள் *** வளைந்திட்ட வில்லாளி வல் வாளெயிற்று * மலைபோல் அவுணன் உடல் வள்ளுகிரால் * அளைந்திட்டவன்காண்மின் இன்று ஆய்ச்சியரால் * அளைவெண்ணெய் உண்டு ஆப்புண்டிருந்தவனே. ",
            4: "தளர்ந்திட்டு இமையோர் சரண் தாவெனத் * தான் சரணாய் முரணாயவனை * உகிரால் பிளந்திட்டு அமரர்க்கு அருள் செய்து உகந்த * பெருமான் திருமால் விரிநீர் உலகை *** வளர்ந்திட்ட தொல்சீர் விறல் மாவலியை * மண்கொள்ள வஞ்சித்து ஒருமாண் குறளாய் * அளந்திட்டவன் காண்மின் இன்று ஆய்ச்சியரால் * அளைவெண்ணெய் உண்டு ஆப்புண்டிருந்தவனே ",
            5: "நீண்டான் குறளாய் நெடுவானளவும் * அடியார் படும் ஆழ் துயராய எல்லாம் * தீண்டாமை நினைந்து இமையோர் அளவும் * செல வைத்த பிரான் அதுவன்றியும்முன் *** வேண்டாமை நமன் தமர் என்தமரை * வினவப் பெறுவார் அலர்,என்று * உலகேழ் ஆண்டானவன் காண்மின் இன்று ஆய்ச்சியரால் * அளைவெண்ணெய் உண்டு ஆப்புண்டிருந்தவனே ",
            6: "பழித்திட்ட இன்பப் பயன் பற்றறுத்துப் * பணிந்தேத்த வல்லார் துயராய வெல்லாம் * ஒழித்திட்டு அவரைத் தனக்காக்க வல்ல * பெருமான் திருமால் அதுவன்றியும்முன் *** தெழித்திட்டு எழுந்தே எதிர்நின்று மன்னன் * சினத்தோள் அவை ஆயிரமும் மழுவால் * அழித்திட்டவன் காண்மின் இன்று ஆய்ச்சியரால் * அளைவெண்ணெய் உண்டு ஆப்புண்டிருந்தவனே. ",
            7: "படைத்திட்டது இவ்வையம் உய்ய முனநாள் * பணிந்தேத்த வல்லார் துயராய வெல்லாம் * துடைத்திட்டு அவரைத் தனக்காக்க வென்னத் * தெளியா அரக்கர் திறலபோய் அவிய *** மிடைத்திட்டு எழுந்த குரங்கைப் படையா * விலங்கல் புகப்பாய்ச்சி விம்ம * கடலை அடைத்திட்டவன்காண்மின் இன்று ஆய்ச்சியரால் * அளைவெண்ணெய் உண்டு ஆப்புண்டிருந்தவனே ",
            8: "நெறித்திட்ட மென்கூழை நல்நேரிழையோடு * உடனாய வில்லென்ன வல்லே அதனை * இறுத்திட்டு அவளின்பம் அன்போடு அணைந்திட்டு * இளங்கொற்றவனாய்த் துளங்காத முந்நீர் *** செறித்திட்டு இலங்கை மலங்க அரக்கன் * செழுநீள் முடிதோளொடு தாள் துணிய * அறுத்திட்டவன்காண்மின் இன்று ஆய்ச்சியரால் * அளைவெண்ணெய் உண்டு ஆப்புண்டிருந்தவனே. ",
            9: "சுரிந்திட்ட செங்கேழ் உளைப்பொங் கரிமாத் * தொலையப் பிரியாது சென்றெய்தி எய்தாது * இரிந்திட்டு இடங்கொண்டு அடங்காத தன்வாய் * இருகூறுசெய்த பெருமான் முனநாள் *** வரிந்திட்ட வில்லால் மரமேழும் எய்து * மலைபோல் உருவத்து ஒரிராக்கதி மூக்கு * அரிந்திட்டவன் காண்மின் இன்று ஆய்ச்சியரால் * அளைவெண்ணெய் உண்டு ஆப்புண்டிருந்தவனே ",
            10: "🙏 நின்றார் முகப்புச் சிறிதும் நினையான் * வயிற்றை நிறைப்பான் உறிப்பால் தயிர்நெய் * அன்றாய்ச்சியர் வெண்ணெய் விழுங்கி * உரலோடு ஆப்புண்டிருந்த பெருமான் அடிமேல் *** நன்றாய தொல்சீர் வயல் மங்கையர்கோன் * கலியன் ஒலிசெய் தமிழ்மாலை வல்லார் * என்றானும் எய்தார் இடர் இன்பம் எய்தி * இமையோர்க்கும் அப்பால் செலவெய்துவாரே ",
        },
        'PTM.10.7.steps': {
            1: "🙏 மானமுடைத்து உங்கள் ஆயர் குலம் அதனால் * பிறர் மக்கள் தம்மை * ஊனமுடையன செய்யப் பெறாயென்று * இரப்பன் உரப்ப கில்லேன் *** நானும் உரைத்திலேன் நந்தன் பணித்திலன் * நங்கைகாள்! நானென் செய்கேன்? * தானுமோர் கன்னியும் கீழை யகத்துத் * தயிர்கடை கின்றான் போலும்! ",
            2: "காலை எழுந்து கடைந்த இம்மோர்விற்கப் போகின்றேன் * கண்டே போனேன் * மாலை நறுங்குஞ்சி நந்தன் மகனல்லால் * மற்று வந்தாரும் இல்லை *** மேலை அகத்து நங்காய்! வந்து காண்மின்கள் * வெண்ணெயேயன்று இருந்த * பாலும் பதின்குடம் கண்டிலேன் * பாவியேன் என்செய்கேன் என்செய்கேனோ! ",
            3: "தெள்ளிய வாய்ச்சிறியான் நங்கைகாள்! * உறி மேலைத் தடாநிறைந்த * வெள்ளி மலையிருந்தாலொத்த வெண்ணெயை * வாரி விழுங்கி யிட்டு *** கள்வன் உறங்குகின்றான் வந்து காண்மின்கள் * கையெல்லாம் நெய் * வயிறு பிள்ளை பரமன்று இவ்வேழுலகும் கொள்ளும் * பேதையேன் என்செய்கேனோ! ",
            4: "மைந்நம்பு வேல்கண்நல்லாள் * முன்னம் பெற்ற வளைவண்ண நன்மா மேனி * தன்நம்பி நம்பியும் இங்கு வளர்ந்தது * அவன் இவை செய்தறியான் *** பொய்ந்நம்பி புள்ளுவன் கள்வம் * பொதியறை போகின்றவா தவழ்ந்திட்டு * இந்நம்பி நம்பியா ஆய்ச்சியர்க்கு உய்வில்லை * என்செய்கேன் என்செய்கேனோ! ",
            5: "தந்தை புகுந்திலன் நான் இங்கு இருந்திலேன் * தோழிமார் ஆருமில்லை * சந்த மலர்க்குழலாள் * தனியே விளையாடுமிடம் குறுகி *** பந்து பறித்துத் துகில்பற்றிக் கீறிப் * படிறன் படிறு செய்யும் * நந்தன் மதலைக்கு இங்கென்கடவோம்? நங்காய்! * என்செய்கேன் என்செய்கேனோ! ",
            6: "மண்மகள் கேள்வன் மலர்மங்கை நாயகன் * நந்தன் பெற்ற மதலை * அண்ணல் இலைக்குழல் ஊதிநம் சேரிக்கே * அல்லிற்றான் வந்த பின்னை *** கண்மலர் சோர்ந்து முலைவந்து விம்மிக் * கமலச் செவ்வாய் வெளுப்ப * என்மகள் வண்ணம் இருக்கின்ற வாநங்காய்! * என்செய்கேன் என்செய்கேனோ! ",
            7: "ஆயிரம் கண்ணுடை இந்திரனாருக் கென்று * ஆயர் விழவெடுப்ப * பாசன நல்லன பண்டிகளால் * புகப் பெய்த அதனை எல்லாம் *** போயிருந்து அங்கொரு பூத வடிவுகொண்டு * உன்மகன் இன்று நங்காய் * மாயன் அதனை எல்லாம் முற்ற * வாரி வளைத்து உண்டிருந்தான் போலும்! ",
            8: "தோய்த்த தயிரும் நறுநெய்யும் பாலும் * ஓரோர்க்குடம் துற்றிடுமென்று * ஆய்ச்சியர் கூடி அழைக்கவும் * நானிதற்கெள்கி இவனை நங்காய் *** சோத்தம் பிரான்! இவை செய்யப் பெறாய்! என்று * இரப்பன் உரப்பகில்லேன் * பேய்ச்சி முலையுண்ட பின்னை * இப்பிள்ளையைப் பேசுவது அஞ்சுவேனே! ",
            9: "ஈடும் வலியும் உடைய * இந் நம்பி பிறந்த ஏழு திங்களில் * ஏடலர் கண்ணியினானை வளர்த்தி * யமுனை நீராடப் போனேன் *** சேடன் திருமறு மார்வன் * கிடந்து திருவடியால் * மலை போல ஓடும் சகடத்தைச் சாடிய பின்னை * உரப்புவது அஞ்சுவேனே! ",
            10: "அஞ்சுவன் சொல்லி அழைத்திட நங்கைகாள்! * ஆயிர நாழி நெய்யைப் * பஞ்சியல் மெல்லடிப் பிள்ளைகள் உண்கின்ற * பாகந்தான் வையார்களே *** கஞ்சன் கடியன் கறவெட்டு நாளில் * என்கை வலத்தாது மில்லை * நெஞ்சத்திருப்பன செய்து வைத்தாய் நம்பீ! * என்செய்கேன் என்செய்கேனோ ! ",
            11: "அங்ஙனம் தீமைகள் செய்வர்களோ நம்பீ! * ஆயர் மடமக்களைப் * பங்கய நீர்குடைந்தாடுகின்றார்கள் * பின்னே சென்றொளித்திருந்து *** அங்கு அவர் பூந்துகில் வாரிக்கொண்டிட்டு * அரவேரிடையார் இரப்ப * மங்கை நல்லீர்! வந்து கொண்மின் என்று * மரம் ஏறி இருந்தாய் போலும் ",
            12: "அச்சம் தினைத்தனை இல்லை இப்பிள்ளைக்கு * ஆண்மையும் சேவகமும் * உச்சியில் முத்தி வளர்த்தெடுத்தேனுக்கு * உரைத்திலன் தானின்று போய் *** பச்சிலைப் பூங்கடம் பேறி * விசைகொண்டு பாய்ந்து புக்கு * ஆயிரவாய் நச்சழல் பொய்கையில் நாகத்தினோடு * பிணங்கி நீ வந்தாய் போலும்! ",
            13: "தம்பர மல்லன ஆண்மைகளைத் * தனியேநின்று தாம் செய்வாரோ? எம்பெருமான்! உன்னைப் பெற்ற வயிறுடையேன் * இனி யானென் செய்கேன்? *** அம்பரம் ஏழும் அதிரும் இடிகுரல் * அங்கனற் செங்கணுடை * வம்பவிழ் கானத்து மால்விடையோடு * பிணங்கி நீ வந்தாய் போலும்! ",
            14: "🙏 அன்ன நடை மட ஆய்ச்சி வயிறடித்து அஞ்ச * அருவரை போல் * மன்னு கருங்களிற்று ஆருயிர் வவ்விய * மைந்தனை மாகடல் சூழ் *** கன்னிநன் மாமதிள் மங்கையர் காவலன் * காமரு சீர்க்கலிகன்றி * இன்னிசை மாலைகள் ஈரேழும் வல்லவர்க்கு * ஏதும் இடர் இல்லையே. ",
        },
        'PTM.10.8.steps': {
            1: "🙏 காதில் கடிப்பிட்டுக் * கலிங்கம் உடுத்து * தாதுநல்ல * தண்ணந் துழாய் கொடணிந்து *** போது மறுத்துப் * புறமே வந்து நின்றீர் * ஏதுக்கு இதுவென்? * இதுவென்? இதுவென்னோ! ",
            2: "துவராடை உடுத்து * ஒருசெண்டு சிலுப்பி * கவராக முடித்துக் * கலிக்கச்சுக் கட்டி *** சுவரார் கதவின் புறமே * வந்து நின்றீர் * இவரார்? இதுவென்? * இதுவென்? இதுவென்னோ! ",
            3: "கருளக் கொடி ஒன்றுடையீர்! * தனிப்பாகீர் * உருளச் சகடம் அது * உறக்கில் நிமிர்த்தீர் *** மருளைக் கொடுபாடி வந்து * இல்லம் புகுந்தீர் * இருளத்து இதுவென்? * இதுவென்? இதுவென்னோ! ",
            4: "நாமம் பலவும் உடை * நாரண நம்பீ * தாமத் துளவம் * மிக நாறிடுகின்றீர் *** காமனெனப்பாடி வந்து * இல்லம் புகுந்தீர் * ஏமத்து இதுவென்? * இதுவென்? இதுவென்னோ! ",
            5: "சுற்றும் குழல்தாழச் * சுரிகை அணைத்து * மற்றும் பல * மாமணி பொன்கொடணிந்து *** முற்றம் புகுந்து * முறுவல்செய்து நின்றீர் * எற்றுக்கு இதுவென்? * இதுவென்? இதுவென்னோ! ",
            6: "ஆனாயரும் * ஆனிரையும் அங்கொழியக் * கூனாயதோர் * கொற்ற வில்லொன்று கையேந்திப் *** போனார் இருந்தாரையும் * பார்த்துப் புகுதீர் * ஏேனார்கள் முன்னென்? * இதுவென்? இதுவென்னோ! ",
            7: "மல்லே பொருத திரள்தோள் * மணவாளÖர் * அல்லே அறிந்தோம்நும் *** மனத்தின் கருத்தை * சொல்லாது ஒழியீர் * சொன்ன போதினால் வாரீர் எல்லே இதுவென்? * இதுவென்? இதுவென்னோ! ",
            8: "புக்காடரவம் * பிடித்தாட்டும் புனிதீர் * இக்காலங்கள் * யாம் உமக்கு ஏதொன்றும் அல்லோம் *** தக்கார் பலர் * தேவிமார் சாலவுடையீர் * எக்கே! இதுவென்? * இதுவென்? இதுவென்னோ! ",
            9: "ஆடி அசைந்து * ஆய்மடவாரொடு நீபோய் * கூடிக் குரவை பிணை * கோமளப் பிள்ளாய் *** தேடித் திருமாமகள் * மண்மகள் நிற்ப * ஏடி! இதுவென்? * இதுவென்? இதுவென்னோ! ",
            10: "🙏 அல்லிக் கமலக் கண்ணனை * அங்கு ஓராய்ச்சி * எல்லிப் பொழுதூடிய * ஊடல் திறத்தை *** கல்லின் மலிதோள் * கலியன் சொன்ன மாலை * சொல்லித் துதிப்பார் அவர் * துக்கம் இலரே ",
        },
        'PTM.10.9.steps': {
            1: "🙏 புள்ளுருவாகி நள்ளிருள் வந்த * பூதனை மாள * இலங்கை ஒள்ளெரி மண்டி உண்ணப் பணித்த * ஊக்கம் அதனை நினைந்தோ,? *** கள்ளவிழ் கோதை காதலும் * எங்கள் காரிகை மாதர் கருத்தும் * பிள்ளைதன் கையில் கிண்ணமே ஒக்கப் * பேசுவது எந்தை பிரானே! ",
            2: "மன்றில் மலிந்து கூத்து வந்தாடி * மால்விடை ஏழும் அடர்த்து * ஆயர் அன்று நடுங்க ஆனிரை காத்த * ஆண்மை கொலோ அறியேன் நான் *** நின்ற பிரானே! நீள்கடல் வண்ணா! * நீஇவள் தன்னை நின் கோயில் * முன்றில் எழுந்த முருங்கையில் தேனா * முன் கைவளை கவர்ந்தாயே. ",
            3: "ஆர்மலி யாழி சங்கொடு பற்றி * ஆற்றலை ஆற்றல் மிகுத்துக் * கார்முகில் வண்ணா! கஞ்சனை முன்னம் * கடந்தநின் கடுந்திறல் தானோ *** நேரிழை மாதை நித்திலத் தொத்தை * நெடுங்கடல் அமுதனை யாளை * ஆரெழில் வண்ணா! அங்கையில் வட்டாம் * இவளெனக் கருதுகின்றாயே. ",
            4: "மல்கிய தோளும் மானுரி யதளும் * உடையவர் தமக்குமோர் பாகம் * நல்கிய நலமோ? நரகனை தொலைத்த * கரதலத்து அமைதியின் கருத்தோ? *** அல்லியங் கோதை அணிநிறம் கொண்டு வந்து * முந்னே நின்று போகாய் * சொல்லியென் நம்பீ! இவளை நீ உங்கள் * தொண்டர் கைத் தண்டென்றவாறே ",
            5: "செருவழியாத மன்னர்கள் மாளத் * தேர்வலங் கொண்டு அவர் செல்லும் * அருவழி வானம் அதர்படக் கண்ட * ஆண்மைகொலோ அறியேன் நான் *** திருமொழி எங்கள் தேமலர்க் கோதை * சீர்மையை நினைந்திலை அந்தோ * பெருவழி நாவற் கனியினும் எளியள் * இவளெனப் பேசுகின்றாயே ",
            6: "அரக்கியர் ஆகம் புல்லென வில்லால் * அணிமதிள் இலங்கையர் கோனை * செருக்கழித்து அமரர் பணிய முன்னின்ற * சேவகமோ? செய்ததின்று *** முருக்கிதழ் ஆய்ச்சி முன்கை வெண்சங்கம் * கொண்டு முன்னே நின்று போகாய் * எருக்கிலைக்காக எறிமழுவோச்சல் * என்செய்வது எந்தை பிரானே! ",
            7: "ஆழியந் திண்தேர் அரசர் வந்திறைஞ்ச * அலைகடல் உலகம்முன் ஆண்ட * பாழியந் தோளோர் ஆயிரம் வீழப் * படைமழுப் பற்றிய வலியோ? *** மாழைமென்னோக்கி மணிநிறங் கொண்டு வந்து * முந்னே நின்று போகாய் * கோழிவெண் முட்டைக்கு என்செய்வது எந்தாய்! * குறுந்தடி நெடுங்கடல் வண்ணா! ",
            8: "பொருந்தலன் ஆகம் புள்ளு வந்தேற * வள்ளுகிரால் பிளந்து * அன்று பெருந்தகைக்கு இரங்கி வாலியை முனிந்த * பெருமைகொலோ செய்தது இன்று *** பெருந்தடங் கண்ணி சுரும்புறு கோதை * பெருமையை நினைந்திலை பேசில் * கருங்கடல் வண்ணா! கவுள்கொண்ட நீராம் * இவளெனக் கருதுகின்றாயே ",
            9: "நீரழல் வானாய் நெடுநிலம் காலாய் * நின்றநின் நீர்மையை நினைந்தோ? * சீர்க்கெழு கோதை என்னலதிலள் என்று * அன்னதோர் தேற்றன்மை தானோ? *** பார்க்கெழு பவ்வத்தார் அமுதனைய * பாவையைப் பாவம் செய்தேனுக்கு * ஆரழல் ஓம்பும் அந்தணன் தோட்டமாக * நின் மனத்து வைத்தாயே ",
            10: "🙏 வேட்டத்தைக் கருதாது அடியிணை வணங்கி * மெய்ம்மை நின்று எம்பெருமானை * வாள்திறல் தானை மங்கையர் தலைவன் * மானவேல் கலியன்வாய் ஒலிகள் *** தோட்டலர் பைந்தார்ச் சுடர்முடியானைப் * பழமொழியால் பணிந்து உரைத்த * பாட்டிவை பாடப் பத்திமை பெருகிச் * சித்தமும் திருவோடு மிகுமே ",
        },
        'PTM.10.10.steps': {
            1: "திருத்தாய் செம்போத்தே,! * திருமாமகள் தன்கணவன் *** மருத்தார் தொல்புகழ் * மாதவனை வர * திருத்தாய் செம்போத்தே! ",
            2: "கரையாய் காக்கைப்பிள்ளாய் * கருமாமுகில் போல்நிறத்தன் *** உரையார் தொல்புகழ் * உத்தமனை வர * கரையாய் காக்கைப்பிள்ளாய்! ",
            3: "கூவாய் பூங்குயிலே * குளிர்மாரி தடுத்துகந்த *** மாவாய் கீண்ட * மணிவண்ணனை வர * கூவாய் பூங்குயிலே! ",
            4: "கொட்டாய் பல்லிக்குட்டி * குடமாடி உலகளந்த *** மட்டார் பூங்குழல் * மாதவனை வர * கொட்டாய் பல்லிக்குட்டி! ",
            5: "🙏 சொல்லாய் பைங்கிளியே * சுடராழி வலனுயர்த்த *** மல்லார் தோள் * வட வேங்கடவன்வர * சொல்லாய் பைங்கிளியே! ",
            6: "கோழி கூவென்னுமால் * தோழி! நானெஞ்செய்கேன் *** ஆழி வண்ணர் * வரும்பொழுது ஆயிற்று * கோழி கூவென்னுமால். ",
            7: "காமற்கு என்கடவேன் * கருமாமுகில் வண்ணற்கல்லால் *** பூமேல் ஐங்கணை * கோத்துப் புகுந்தெய்ய * காமற்கு என்கடவேன்! ",
            8: "🙏 இங்கே போதுங்கொலோ * இனவேல்நெடுங் கண்களிப்ப *** கொங்கார் சோலைக் * குடந்தைக் கிடந்தமால் * இங்கே போதுங்கொலோ! ",
            9: "இன்னார் என்றறியேன் * அன்னே! ஆழியொடும் *** பொன்னார் சார்ங்கம் உடைய அடிகளை * இன்னார் என்றறியேன். ",
            10: "🙏 தொண்டீர்! பாடுமினோ * சுரும்பார்ப்பொழில் மங்கையர்கோன் *** ஒண்தார் வேல்கலியன் ஒலி மாலைகள் * தொண்டீர்! பாடுமினோ ",
        },

    };
    // Non-destructive runtime merging engine
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};
