window.MARKER_DATABASE = window.MARKER_DATABASE || {};

// Global function to trigger the merge on-demand
window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'PTM.1.1.steps': {
            1: "🙏 வாடினேன்வாடி வருந்தினேன்மனத்தால் * பெருந்துயர் இடும்பையில் பிறந்து * கூடினேன் கூடி இளையவர் தம்மோடு * அவர்த்தரும் கலவியேகருதி *** ஓடினேனோடி உய்வதோர்ப்பொருளால் * உணர்வெனும் பெரும்பதந்தெரிந்து * நாடினேன்நாடி நான்கண்டுகொண்டேன் * நாராயணா என்னும் நாமம்.  ",
            2: "🙏 ஆவியே! அமுதே! எனநினைந்துருகி * அவரவர் பணைமுலைதுணையா * பாவியேன் உணராது எத்தனைபகலும் * பழுதுபோய் ஒழிந்தன நாள்கள் *** தூவிசேரன்னம் துணையொடும்புணரும் * சூழ்புனல் குடந்தையே தொழுது * என் நாவினாலுய்ய நான் கண்டுகொண்டேன் * நாராயணா என்னும் நாமம்.  ",
            3: "சேமமேவேண்டித் தீவினைபெருக்கித் * தெரிவைமார் உருவமேமருவி * ஊமனார் கண்ட கனவிலும்பழுதாய் * ஒழிந்தன கழிந்த அந்நாள்கள் *** காமனார் தாதை நம்முடையடிகள் * தம்மடைந்தார் மனத்திருப்பர் * நாமம் நானுய்ய நான்கண்டு கொண்டேன் * நாராயணா என்னும் நாமம்.  ",
            4: "வென்றியே வேண்டி வீழ்பொருட்கிரங்கி * வேற்கணார் கலவியே கருதி * நின்றவா நில்லா நெஞ்சினையுடையேன் * என்செய்கேன்? நெடுவிசும்பணவும் *** பன்றியாய் அன்றுபாரகங்கீண்ட * பாழியான் ஆழியானருளே * நன்று நானுய்ய நான்கண்டு கொண்டேன் * நாராயணா என்னும் நாமம்.  ",
            5: "கள்வனேனானேன் படிறுசெய்திருப்பேன் * கண்டவா திரிதந்தேனேலும் * தெள்ளியேனானேன் செல்கதிக்கமைந்தேன் * சிக்கெனத் திருவருள்பெற்றேன் *** உள்ளெலாமுருகிக் குரல் தழுத்தொழிந்தேன் * உடம்பெலாம் கண்ணநீர்சோர * நள்ளிருளளவும் பகலும் நானழைப்பன் * நாராயணா என்னும் நாமம்.  ",
            6: "🙏 எம்பிரான் எந்தை என்னுடைச்சுற்றம் * எனக்கரசு என்னுடைவாணாள் * அம்பினால் அரக்கர் வெருக்கொளநெருக்கி * அவருயிர்செகுத்த எம்அண்ணல் *** வம்புலாம்சோலைமாமதிள் * தஞ்சை மாமணிக்கோயிலேவணங்கி * நம்பிகாள்! உய்யநான் கண்டு கொண்டேன் * நாராயணா என்னும் நாமம்.  ",
            7: "இற்பிறப்பறியீர் இவரவரென்னீர் * இன்னதோர்த்தன்மை என்றுணரீர் * கற்பகம்புலவர் களைகணென்று உலகில் * கண்டவா தொண்டரைப்பாடும் *** சொற்ÛபொருளாளÖர் சொல்லுகேன்வம்மின் * சூழ்புனல் குடந்தையேதொழுமின் * நற்பொருள்காண்மின் பாடி நீருய்ம்மின் * நாராயணா என்னும் நாமம்.  ",
            8: "கற்றிலேன் கலைகள் ஐம்புலன் கருதும் * கருத்துளே திருத்தினேன் மனத்தை * பெற்றிலேன் அதனால் பேதையேன் நன்மை * பெருநிலத்தார் உயிர்க்கெல்லாம் *** செற்றமேவேண்டித் திரிதருவேன் தவிர்ந்தேன் * செல்கதிக்கு உய்யுமாறெண்ணி * நல்துணையாகப்பற்றினேன் அடியேன் * நாராயணா என்னும் நாமம்.  ",
            9: "🙏 குலம்தரும் செல்வம் தந்திடும் * அடியார் படுதுயராயினவெல்லாம் * நிலந்தரஞ்செய்யும் நீள்விசும்பருளும் * அருளொடு பெருநிலமளிக்கும் *** வலந்தரும் மற்றுந்தந்திடும் * பெற்ற தாயினுமாயினசெய்யும் * நலந்தருஞ்சொல்லை நான் கண்டுகொண்டேன் * நாராயணா என்னும் நாமம்.  ",
            10: "🙏 மஞ்சுலாஞ்சோலை வண்டறை மாநீர் * மங்கையார்வாள் கலிகன்றி * செஞ்சொலாலெடுத்த தெய்வ நன்மாலை * இவைகொண்டு சிக்கெனத்தொண்டீர்! *** துஞ்சும்போது அழைமின் துயர்வரில் நினைமின் * துயரிலீர் சொல்லிலும் நன்றாம் * நஞ்சுதான் கண்டீர் நம்முடைவினைக்கு * நாராயணா என்னும் நாமம்.  ",
        },
        'PTM.1.2.steps': {
            1: "🙏 வாலிமாவலத்து ஒருவனதுடல்கெட * வரிசிலைவளைவித்து * அன்றுஏலநாறு தண்தடம்பொழில் இடம்பெற * இருந்தநல் இமயத்துள் *** ஆலிமாமுகில் அதிர்த்தர அருவரை * அகடுறமுகடேறி * பீலிமாமயில்நடஞ்செயும்தடஞ்சுனைப் * பிரிதிசென்றடை நெஞ்சே.  ",
            2: "கலங்கமாக்கடல் அரிகுலம்பணிசெய்ய * அருவரையணைகட்டி * இலங்கைமாநகர் பொடிசெய்த அடிகள்தாம் * இருந்தநல் இமயத்து *** விலங்கல்போல் வனவிறல் இருஞ்சினத்தன * வேழங்கள்துயர்க்கூர * பிலங்கொள்வாளெயிற்று அரியவைதிரிதரு * பிரிதிசென்றடை நெஞ்சே!  ",
            3: "துடிகொள்நுண்ணிடை சுரிகுழல் துளங்கெயிற்று * இளங்கொடிதிறத்து * ஆயர் இடிகொள் வெங்குரலினவிடை அடர்த்தவன் * இருந்த நல்லிமயத்து *** கடிகொள்வேங்கையின் நறுமலரமளியின் * மணியறை மிசைவேழம் * பிடியினோடு வண்டிசைசொலத் துயில்கொளும் * பிரிதிசென்றடை நெஞ்சே!  ",
            4: "மறங்கொளாளரி உருவென வெருவர * ஒருவனது அகல்மார்வம் திறந்து * வானவர் மணிமுடி பணிதர * இருந்தநல் இமயத்து *** இறங்கியேனங்கள் வளைமருப்பிடந்திடக் * கிடந்தருகெரிவீசும் * பிறங்குமா மணியருவியொடு இழிதரு * பிரிதிசென்றடை நெஞ்சே!  ",
            5: "கரைசெய்மாக் கடல்கிடந்தவன் * கனைகழல் அமரர்கள்தொழுதேத்த * அரைசெய் மேகலை அலர்மகள் அவளொடும் * அமர்ந்தநல் இமயத்து *** வரைசெய்மாக்களிற் இளவெதிர் வளர்முளை * அளைமிகு தேன்தோய்த்து * பிரசவாரிதன் இளம்பிடிக்கு அருள்செயும் * பிரிதிசென்றடை நெஞ்சே!  ",
            6: "பணங்களாயிரமுடய நல்லவரவணைப் பள்ளிகொள் * பரமாவென்று * இணங்கிவானவர் மணிமுடிபணிதர * இருந்தநல் இமயத்து *** மணங்கொள்மாதவி நெடுங்கொடிவிசும்புற * நிமிர்ந்தவைமுகில்பற்றி * பிணங்குபூம்பொழில் நுழைந்து வண்டிசைசொலும் * பிரிதிசென்றடை நெஞ்சே!  ",
            7: "கார்கொள்வேங்கைகள் கனவரைதழுவிய * கறிவளர்க்கொடிதுன்னி * போர்கொள்வேங்கைகள் புனவரைதழுவிய * பூம்பொழில் இமயத்துள் *** ஏர்கொள்பூஞ்சுனைத் தடம்படிந்து இனமலர் * எட்டுமிட்டிமையோர்கள் * பேர்களாயிரம் பரவிநின்று அடிதொழும் * பிரிதிசென்றடை நெஞ்சே!  ",
            8: "இரவுகூர்ந்து இருள்பெருகிய வரைமுழை * இரும்பசி அதுகூர * அரவமாவிக்கு மகன்பொழில்தழுவிய * அருவரையிமயத்து *** பரமனாதியெம் பனிமுகில் வண்ணனென்று * எண்ணிநின்று இமையோர்கள் * பிரமேனாடு சென்றடிதொழும் பெருந்தகைப் * பிரிதிசென்றடை நெஞ்சே!  ",
            9: "ஓதியாயிரநாமங்கள் உணர்ந்தவர்க்கு * உறுதுயரடையாமல் * ஏதமின்றி நின்றருளும் நம்பெருந்தகை * இருந்தநல் இமயத்து *** தாதுமல்கிய பிண்டிவிண்டு அலர்கின்ற * தழல்புரை எழில்நோக்கி * பேதைவண்டுகள் எரியென வெருவரு * பிரிதிசென்றடை நெஞ்சே!  ",
            10: "🙏 கரியமாமுகிற் படலங்கள் கிடந்து * அவைமுழங்கிட * களிறென்று பெரியமாசுணம் வரையெனப்பெயர்தரு * பிரிதி எம்பெருமானை *** வரிகொள் வண்டறை பைம்பொழில் மங்கையர் * கலியனது ஒலிமாலை * அரிய இன்னிசைபாடும் நல்லடியவர்க்கு * அருவினை அடையாவே *   ",
        },
        'PTM.1.3.steps': {
            1: "🙏 முற்றமூத்துக் கோல்துணையா * முன்னடி நோக்கி வளைந்து * இற்றகால்போல் தள்ளிமெள்ள * இருந்தங்கு இளையாமுன் *** பெற்றதாய்போல் வந்தபேய்ச்சி * பெருமுலையூடு * உயிரை வற்றவாங்கியுண்டவாயான் * வதரிவணங்குதுமே.  ",
            2: "முதுகுபற்றிக் கைத்தலத்தால் * முன்னொருகோல் ஊன்றி * விதிர்விதிர்த்துக் கண்சுழன்று * மேற்கிளை கொண்டிருமி *** இதுவென்னப்பர் மூத்தவாறென்று * இளையவர் ஏசாமுன் * மதுவுண்வண்டு பண்கள்பாடும் * வதரிவணங்குதுமே.  ",
            3: "உறிகள்போல் மெய்நரம்பெழுந்து * ஊன்தளர்ந்து உள்ளமெள்கி * நெறியைநோக்கிக் கண்சுழன்று * நின்றுநடுங்காமுன் *** அறிதியாகில் நெஞ்சம் அன்பால் * ஆயிரநாமம் சொல்லி * வெறிகொள்வண்டு பண்கள்பாடும் * வதரிவணங்குதுமே.  ",
            4: "பீளைசோரக் கண்இடுங்கிப் * பித்தெழ மூத்திருமி * தாள்கள்நோவ தம்மில்முட்டித் * தள்ளி நடவாமுன் *** காளையாகிக் கன்றுமேய்த்துக் * குன்றெடுத்துஅன்றுநின்றான் * வாளைபாயும்தண்தடஞ்சூழ் * வதரிவணங்குதுமே.  ",
            5: "பண்டு காமரானவாறும் * பாவையர் வாயமுதம் உண்டவாரும் * வாழ்ந்த வாரும் * ஒக்கவுரைத்திருமி *** தண்டுகாலா ஊன்றியூன்றித் * தள்ளிநடவாமுன் * வண்டுபாடும் தண்துழாயான் * வதரிவணங்குதுமே.  ",
            6: "எய்த்தசொல்லோடு இளைத்து ஏங்கி * இருமியிளைத்து * உடலம் பித்தர்ப்போல சித்தம் வேறாய்ப் * பேசியயராமுன் *** அத்தன் எந்தை ஆதிமூர்த்தி * ஆழ்கடலைக் கடைந்த * மைத்தசோதி எம்பெருமான் * வதரிவணங்குதுமே.  ",
            7: "பப்பவப்பர் மூத்தவாறு * பாழ்ப்பது சீத்திரளையொப்ப * ஐக்கள்போத உந்த * உன்தமர் காண்மினென்று *** செப்புநேர்மென் கொங்கை நல்லார் * தாம்சிரியாத முன்னம் * வைப்பும் நங்கள் வாழ்வுமானான் * வதரிவணங்குதுமே.  ",
            8: "ஈசிபோமின் ஈங்கிரேன்மின் * இருமியிளைத்தீர் * உள்ளம் கூசியிட்டீர் என்றுபேசும் * குவளையங் கண்ணியர்ப்பால் *** நாசமான பாசம் விட்டு * நன்னெறி நோக்கலுறில் * வாசம் மல்கு தண்துழாயான் * வதரிவணங்குதுமே.  ",
            9: "புலன்கள்நைய மெய்யில்மூத்துப் * போந்திருந்து உள்ளமெள்கி * கலங்கவைக்கள் போதவுந்திக் * கண்ட பிதற்றாமுன் *** அலங்கலாய தண்துழாய்கொண்டு * ஆயிரநாமம் சொல்லி * வலங்கொள் தொண்டர் பாடியாடும் * வதரிவணங்குதுமே.  ",
            10: "🙏 வண்டு தண்தேன் உண்டுவாழும் * வதரிநெடுமாலை * கண்டல்வேலி மங்கைவேந்தன் * கலியன் ஒலிமாலை *** கொண்டு தொண்டர் பாடியாடக் * கூடிடில் நீள்விசும்பில் * அண்டமல்லால் மற்றவர்க்கு * ஓராட்சி அறியோமே.  ",
        },
        'PTM.1.4.steps': {
            1: "🙏 ஏனமுனாகி இருநிலமிடந்து * அன்றிணையடி இமையவர்வணங்க * தானவனாகம் தரணியில்புரளத் * தடஞ்சிலைகுனித்த என்தலைவன் *** தேனமர்சோலைக் கற்பகம்பயந்த * தெய்வநன் நறுமலர்க்கொணர்ந்து * வானவர்வணங்கும் கங்கையின்கரைமேல் * வதரியாச்சிராமத்துள்ளானே.  ",
            2: "கானிடையுருவைச் சுடுசரம்துரந்து * கண்டுமுன் கொடுந்தொழிலுரவோன் * ஊனுடையகலத்து அடுகணைகுளிப்ப * உயிர்க்கவர்ந்துகந்த எம்மொருவன் *** தேனுடைக்கமலத்து அயனொடுதேவர் * சென்றுசென்று இறைஞ்சிட * பெருகுவானிடைமுதுநீர்க் கங்கையிங்கரைமேல் * வதரியாச்சிராமத்துள்ளானே.  ",
            3: "இலங்கையும்கடலும் அடலருந்துப்பின் * இருநிதிக்கிறைவனும் * அரக்கர் குலங்களும் கெடமுன் கொடுந்தொழில்புரிந்த கொற்றவன் * கொழுஞ்சுடர்சுழன்ற *** விலங்கலில் உரிஞ்சிமேல்நின்றவிசும்பில் * வெண்துகிற்கொடி எனவிரிந்து * வலந்தருமணிநீர்க் கங்கையின் கரைமேல் * வதரியாச்சிராமத்துள்ளானே.   ",
            4: "துணிவினி உனக்குச் சொல்லுவன்மனமே! * தொழுதெழு தொண்டர்கள்தமக்கு * பிணியொழித்தமரர் பெருவிசும்பருளும் * பேரருளாளன் எம்பெருமான் *** அணிமலர்க்குழலார் அரம்பையர்த்துகிலும் * ஆரமும்வாரிவந்து * அணிநீர் மணிகொழித்திழிந்த கங்கையின்கரைமேல் * வதரியாச்சிராமத்துள்ளானே. ",
            5: "பேயிடைக்கிருந்துவந்த மற்றவள்தன் * பெருமுலைசுவைத்திட * பெற்றதாயிடைக்கு இருத்தலஅஞ்சுவனென்று தளர்ந்திட * வளர்ந்தவெந்தலைவன் *** சேய்முகட்டு உச்சியண்டமுஞ்சுமந்த * செம்பொன்செய் விலங்கலி இலங்கு * வாய்முகட்டிழிந்த கங்கையின்கரைமேல் * வதரியாச்சிராமத்துள்ளானே.  ",
            6: "தேரணங்கல்குல் செழுங்கையற்கண்ணி திறத்து * ஒருமறத்தொழில்புரிந்து * பாரணங்கிமிலேறு ஏழுமுன்னடர்த்த * பனிமுகில்வண்ணன் எம்பெருமான் *** காரணந்தன்னால் கடும்புனல்கயத்த * கருவரை பிளவெழக்குத்தி * வாரணங்கொணர்ந்த கங்கையின்கரைமேல் * வதரியாச்சிராமத்துள்ளானே.  ",
            7: "வெந்திறல்களிறும் வேலைவாயமுதும் * விண்ணொடு விண்ணவர்க்கரசும் * இந்திரற்கருளி எமக்குமீந்தருளும் * எந்தையெம்மடிகள் எம்பெருமான் *** அந்தரத்தமரர் அடியிணைவணங்க * ஆயிரமுகத்தினாலருளி * மந்தரத்திழிந்த கங்கையின்கரைமேல் * வதரியாச்சிராமத்துள்ளானே.  ",
            8: "மான்முனிந்தொருகால் வரிசிலைவளைத்த * மன்னவன் பொன்னிறத்துரவோன் * ஊன்முனிந்த அவனதுடல்இருபிளவா * உகிர்நுதிமடுத்து *** அயனரனைத் தான்முனிந்திட்ட * வெந்திறல்சாபம் தவிர்த்தவன் * தவம்புரிந்துயர்நட மாமுனிகொணர்ந்த கங்கையின்கரைமேல் * வதரியாச்சிராமத்துள்ளானே.  ",
            9: "கொண்டல்மாருதங்கள் குலவரைதொகுநீர்க்கு * உரைகடல் உலகுடன் அனைத்தும் * உண்ட மாவயிற்றோன் ஒண்சுடரேய்ந்த * உம்பரும் ஊழியுமானான் *** அண்டமூடறுத்து அன்றந்தரத்திழிந்து * அங்கவனியாள் அலமர * பெருகும்மண்டுமாமணிநீர்க் கங்கையின் கரைமேல் * வதரியாச்சிராமத்துள்ளானே.  ",
            10: "🙏 வருந்திரை மணிநீர்க் கங்கையின் கரைமேல் * வதரியாச்சிராமத்துள்ளானை * கருங்கடல்முந்நீர் வண்ணனையெண்ணிக் * கலியன்வாய் ஒலி செய்த பனுவல் *** வரஞ்செய்த ஐந்துமைந்தும்வல்லார்கள் * வானவர் உலகுடன் மருவி * இருங்கடல் உலகமாண்டு வெண்குடைக்கீழ் * இமையவர் ஆகுவர்தாமே.  ",
        },
        'PTM.1.5.steps': {
            1: "🙏 கலையும்கரியும் பரிமாவும் * திரியும்கானம் கடந்துபோய் * சிலையும்கணையும் துணையாகச்சென்றான் * வென்றிச்செறுக்களத்து *** மலைகொண்டு அலைநீரணைகட்டி * மதிள்நீரிலங்கை வாளரக்கர் தலைவன் * தலைபத்தறுத்துகந்தான் * சாளக்கிராமம் அடைநெஞ்சே!  ",
            2: "கடம்சூழ்கரியும் பரிமாவும் * ஒலிமாந்தேரும் காலாளும் * உடஞ்சூழ்ந்தெழுந்த கடியிலங்கை * பொடியவடிவாய்ச் சரம்துரந்தான் *** இடம்சூழ்ந்தெங்கும் இருவிசும்பில் * இமையோர்வணங்க மணம்கமழும் * தடம்சூழ்ந்தெங்கும் அழகாய * சாளக்கிராமம் அடைநெஞ்சே!   ",
            3: "உலவுதிரையும் குலவரையும் * ஊழிமுதலா எண்திக்கும் * நிலவும்சுடரும் இருளுமாய் நின்றான் * வென்றிவிறலாழி வலவன் *** வானோர் தம்பெருமான் * மருவாவரக்கர்க்கு எஞ்ஞான்றும் சலவன் * சலம்சூழ்ந்தழகாய * சாளக்கிராமம் அடைநெஞ்சே!  ",
            4: "ஊராங்குடந்தை உத்தமன் * ஒருகாலிருகால் சிலைவளைய * தேராவரக்கர் தேர்வெள்ளம் செற்றான் * வற்றாவருபுனல்சூழ் பேரான் *** பேராயிரமுடையான் * பிறங்குசிறை வண்டறைகின்ற தாரான் * தாராவயல்சூழ்ந்த * சாளக்கிராமம் அடைநெஞ்சே!  ",
            5: "அடுத்தார்த்தெழுந்தாள் பிலவாய்விட்டலற * அவள்மூக்கு அயில்வாளால் விடுத்தான் * விளங்குசுடராழி * விண்ணோர்ப்பெருமான் நண்ணார்முன் *** கடுத்தார்த்தெழுந்த பெருமழையைக் * கல்லொன்றேந்தி இனநிரைக்காத்தடுத்தான் * தடம்சூழ்ந்தழகாய * சாளக்கிராமம் அடைநெஞ்சே!  ",
            6: "தாயாய்வந்த பேயுயிரும் * தயிரும்விழுதும் உடனுண்ட வாயான் * தூயஅரியுருவிற் குறளாய்ச்சென்று * மாவலையை ஏயானிரப்ப *** மூவடிமண் இன்றே தாவென்று * உலகேழும் தாயான் * காயாமலர்வண்ணன் * சாளக்கிராமம் அடைநெஞ்சே!  ",
            7: "ஏேனார் அஞ்ச வெஞ்சமத்துள் * அரியாய்ப் பரியவிரணியனை * ஊனாரகலம் பிளவெடுத்த * ஒருவன்தானே இருசுடராய் *** வானாய்த் தீயாய் மாருதமாய் * மலையாய் அலைநீருலகனைத்தும் தானாய் * தானுமானான்தன் * சாளக்கிராமம் அடைநெஞ்சே!  ",
            8: "வெந்தார் என்பும் சுடுநீறும் * மெய்யில்பூசிக் கையகத்து * ஓர்சந்தார் தலைகொண்டு உலகேழும் திரியும் * பெரியோன்தாஞ்சென்று *** என்எந்தாய்! சாபம்தீரென * இலங்கமுதநீர்த் திருமார்பில் தந்தான் * சந்தார் பொழில்சூழ்ந்த * சாளக்கிராமம் அடைநெஞ்சே!  ",
            9: "தொண்டாமினமும் இமையோரும் * துணைநூல்மார்பின் அந்தணரும் * அண்டா எமக்கே அருளாய்என்று * அணையும்கோயில் அருகெல்லாம் *** வண்டார்ப்பொழிலின் பழனத்து * வயலின் அயலே கயல்பாய * தண்டாமரைகள் முகமலர்த்தும் * சாளக்கிராமம் அடைநெஞ்சே!  ",
            10: "🙏 தாராவாரும் வயல்சூழ்ந்த * சாளக்கிராமத்து அடிகளை * காரார்ப்புறவின் மங்கைவேந்தன் * கலியனொலி செய்தமிழ்மாலை *** ஆரார் உலகத்து அறிவுடையார் * அமரர்நன்னாட்டு அரசாள * பேராயிரமும் ஓதுமின்கள் * அன்றி இவையே பிதற்றுமினே.   ",
        },
        'PTM.1.6.steps': {
            1: "🙏 வாணிலாமுறுவல் சிறுநுதல் பெருந்தோள் * மாதரார் வனமுலைப் பயனே பேணினேன் * அதனைப் பிழையெனக்கருதிப் * பேதையேன் பிறவிநோயறுப்பான் *** ஏணிலேன் இருந்தேன் எண்ணினேன் எண்ணி * இளையவர்க்கலவியின் திறத்தை நாணினேன் * வந்துஉன்திருவடியடைந்தேன் * நைமிசாரணியத்துள் எந்தாய்!  ",
            2: "சிலம்படியுருவிற் கருநெடுங்கண்ணார் * திறத்தனாய்!அறத்தையேமறந்து * புலம்படிந்துண்ணும் போகமேபெருக்கிப் * போக்கினேன் பொழுதினைவாளா *** அலம்புரிதடக்கை ஆயனே!மாயா! * வானவர்க்கரசனே! * வானோர் நலம்புரிந்திறைஞ்சும் திருவடியடைந்தேன் * நைமிசாரணியத்துளெந்தாய்!  ",
            3: "சூதினைப்பெருக்கிக் களவினைத் துணிந்து * சுரிகுழல் மடந்தையர்திறத்து * காதலேமிகுத்துக்கண்டவா * திரிந்ததொண்டனேன் நமன்தமர்செய்யும் *** வேதனைக்கு ஒடுங்கிநடுங்கினேன் * வேலைவெண்திரை அலமரக்கடைந்த நாதனே * வந்துஉன் திருவடியடைந்தேன் * நைமிசாரணியத்துள் எந்தாய்!  ",
            4: "வம்புலாங்கூந்தல் மனைவியைத்துறந்து * பிறர்பொருள் தாரம் என்றிவற்றை * நம்பினார் இறந்தால் * நமன்தமர்ப்பற்றி எற்றிவைத்து *** எரிஎழுகின்ற செம்பினால்இயன்ற பாவையைப் * பாவீ! தழுவெனமொழிவதற்க்குஅஞ்சி * நம்பனே! வந்துஉன்திருவடியடைந்தேன் * நைமிசாரணியத்துள் எந்தாய்!  ",
            5: "இடும்பையால் அடர்ப்புண்டு இடுமினோதுஉற்றென்னு * இரந்தவர்க்கு இல்லையேயென்று * நெடுஞ்சொலால்மறுத்த நீசனேன்அந்தோ! * நினைக்கிலேன் வினைப்பயன் தன்னை *** கடுஞ்சொலார் கடியார் காலனார் தமரால் * படுவதோர் கொடுமிறைக்குஅஞ்சி * நடுங்கிநான்வந்துஉன்திருவடியடைந்தேன் * நைமிசாரணியத்துள் எந்தாய்!  ",
            6: "கோடியமனத்தால் சினத்தொழில்புரிந்து * திரிந்துநாயினத்தொடுந்திளைத்திட்டு * ஓடியும்உழன்றும் உயிர்களேகொன்றேன் * உணர்விலேன் ஆதலால் *** நமனார்ப்பாடியைப்பெரிதும் பரிசழித்திட்டேன் * பரமனே! பாற்கடல்கிடந்தாய்! * நாடிநான்வந்து உன்திருவடியடைந்தேன் * நைமிசாரணியத்துள் எந்தாய்!  ",
            7: "நெஞ்சினால்நினைந்தும் வாயினால்மொழிந்தும் * நீதியல்லாதன செய்தும் * துஞ்சினார்செல்லும் தொல்நெறிகேட்டே * துளங்கினேன் விளங்கனிமுனிந்தாய்! *** வஞ்சனேன் அடியேன் நெஞ்சினில்பிரியா * வானவா! தானவர்க்கென்றும் நஞ்சனே! * வந்துஉன்திருவடியடைந்தேன் * நைமிசாரணியத்துள் எந்தாய்!  ",
            8: "ஏவினார்க்கலியார் நலிகவென்று * என்மேல் எங்ஙனே வாழுமாறு? * ஐவர்கோவினார்செய்யும் கொடுமையைமடித்தேன் * குறுங்குடி நெடுங்கடல்வண்ணா! *** பாவினார்இஞ்சொல் பன்மலர்க்கொண்டு * உன்பாதமேபரவி நான்பணிந்து * என்நாவினால்வந்துஉன்திருவடியடைந்தேன் * நைமிசாரணியத்துள் எந்தாய்!  ",
            9: "ஊனிடைச்சுவர்வைத்து என்புதூண்நாட்டி * உரோமம்வேய்ந்து ஒன்பதுவாசல் * தானுடைக்குரம்பைப் பிரியும்போது * உந்தன்சரணமேசரணம் என்றுஇருந்தேன் *** தேனுடைக்கமலத் திருவினுக்கரசே! * திரைகொள்மா நெடுங்கடற்கிடந்தாய்! * நானுடைத் தவத்தால் திருவடியடைந்தேன் * நைமிசாரணியத்துளெந்தாய்!  ",
            10: "🙏 ஏதம்வந்து அணுகா வண்ணநாமெண்ணி * எழுமினோ தொழுதுமென்று * இமையோர் நாதன்வந்துஇறைஞ்சும் * நைமிசாரணியத்தெந்தையைச் சிந்தையுள்வைத்து *** காதலேமிகுத்த கலியன்வாயொலிசெய் * மாலைதாம் கற்றுவல்லார்கள் * ஓதநீர்வையகம்ஆண்டு வெண்குடைக்கீழ் * உம்பரும்ஆகுவர் தாமே.  ",
        },
        'PTM.1.7.steps': {
            1: "🙏 அங்கண் ஞாலமஞ்ச * அங்கோராளரியாய் * அவுணன் பொங்கவாகம் வள்ளுகிரால் * போழ்ந்த புனிதனிடம் *** பைங்கணானைக் கொம்புகொண்டு * பத்திமையால் * அடிக்கீழ்ச் செங்கணாளியிட்டிறைஞ்சும் * சிங்கவேள்குன்றமே.  ",
            2: "அலைத்தபேழ்வாய் * வாளெயிற்றோர்க் கோளரியாய் * அவுணன் கொலைக்கையாளன் நெஞ்சிடந்த * கூருகிறாளனிடம் *** மலைத்தசெல்சாத்தெறிந்தபூசல் * வன்துடிவாய்கடுப்ப * சிலைக்கைவேடர் தெழிப்பறாத * சிங்கவேள்குன்றமே.  ",
            3: "ஏய்ந்தபேழ்வாய் * வாளெயிற்றோர்க்கோளரியாய் * அவுணன் வாய்ந்தவாகம் வள்ளுகிரால் * வகிர்ந்தவம்மானதனிடம் *** ஓய்ந்தமாவும் உடைந்தகுன்றும் * அன்றியும் நின்றழலால் * தேய்ந்தவேயுமல்லதில்லாச் * சிங்கவேள்குன்றமே.  ",
            4: "எவ்வும் வெவ்வேல் பொன்பெயரோன்& ஏதலினின்னுயிரை வவ்வி * ஆகம்வள்ளுகிரால் * வகிர்ந்தவம்மானதிடம் *** கவ்வுநாயும்கழுகும் * உச்சிபோதொடுகால்சுழன்று * தெய்வமல்லால் செல்லவொண்ணாச் * சிங்கவேள்குன்றமே.  ",
            5: "மென்றபேழ்வாய் * வாளெயிற்றோர்க்கோளரியாய் * அவுணன் பொன்றவாகம்வள்ளுகிரால் * போழ்ந்த புனிதனிடம் *** நின்றசெந்தீ மொண்டுசூறை * நீள்விசும்பூடிரிய * சென்றுகாண்டற்கரியகோயில் * சிங்கவேள்குன்றமே.  ",
            6: "எரிந்தபைங்கணிலங்குபேழ்வாய் * எயிற்றொடுஇதுஎவ்வுருவென்று * இரிந்துவானோர் கலங்கியோட * இருந்தவம்மானதிடம் *** நெரிந்தவேயின் முழையுள்நின்று * நீணெறிவாயுழுவை * திரிந்தவானைச்சுவடுபார்க்கும் * சிங்கவேள்குன்றமே.  ",
            7: "முனைத்தசீற்றம் விண்சுடப்போய் * மூவுலகும் பிறவும் * அனைத்துமஞ்சஆளரியாய் * இருந்தவம்மானதிடம் *** கனைத்ததீயும் கல்லுமல்லா * வில்லுடைவேடருமாய் * தினைத்தனையும் செல்லவொண்ணாச் * சிங்கவேள்குன்றமே.   ",
            8: "நாத்தழும்ப நான்முகனும் * ஈசனுமாய் முறையால் ஏத்த * அங்கோராளரியாய் * இருந்தவம்மானதிடம் *** காய்த்தவாகை நெற்று ஒலிப்பக் * கல்லதர்வேய்ங்கழைபோய் * தேய்த்ததீயால் விண்சிவக்கும் * சிங்கவேள்குன்றமே.  ",
            9: "நல்லைநெஞ்சே! நாம் தொழுதும் * நம்முடை நம்பெருமான் * அல்லிமாதர் புல்கநின்ற *** ஆயிரம் தோளனிடம்நெல்லிமல்கிக் கல்லுடைப்பப் * புல்லிலையார்த்து * அதர்வாய்ச் சில்லிசில்லென்று ஒல்லறாத * சிங்கவேள்குன்றமே.  ",
            10: "🙏 செங்கணாளி இட்டிறைஞ்சும் * சிங்கவேள்குன்றுடைய * எங்களÖசன் எம்பிரானை * இருந்தமிழ் நூற்புலவன் *** மங்கையாளன் மன்னுதொல்சீர் * வண்டறைதார்க் கலியன் * செங்கையாளன் செஞ்சொல்மாலை * வல்லவர் தீதிலரே.  ",
        },
        'PTM.1.8.steps': {
            1: "🙏 கொங்கலர்ந்த மலர்க்குருந்தம் ஒசித்த * கோவலன் எம்பிரான் * சங்குதங்கு தடங்கடல் * துயில்கொண்ட தாமரைக் கண்ணினன் *** பொங்குபுள்ளினை வாய்பிளந்த * புராணர் தம்மிடம் * பொங்குநீர்ச் செங்கயல் திளைக்கும்சுனைத் * திருவேங்கடம் அடை நெஞ்சமே!  ",
            2: "🙏 பள்ளியாவது பாற்கடல்அரங்கம் * இரங்கவன்பேய்முலை * பிள்ளையாய்உயிருண்ட எந்தை * பிரானவன் பெருகுமிடம் *** வெள்ளியான் கரியான் * மணிநிறவண்ணன் என்றெண்ணி * நாடொறும் தெள்ளியார்வணங்கும்மலை * திருவேங்கடம் அடைநெஞ்சமே!  ",
            3: "நின்றமாமருது இற்றுவீழ * நடந்த நின்மலன் நேமியான் * என்றும்வானவர் கைதொழும் * இணைத்தாமரையடி எம்பிரான் *** கன்றிமாரி பொழிந்திடக் * கடிதானிரைக்கு இடர்நீக்குவான் * சென்றுகுன்றமெடுத்தவன் * திருவேங்கடம் அடைநெஞ்சமே!  ",
            4: "பார்த்தற்காய் அன்றுபாரதம் கைசெய்திட்டு * வென்றபரஞ்சுடர் * கோத்துஅங்குஆயர்தம்பாடியில் * குரவைபிணைந்த எம்கோவலன் *** ஏத்துவார் தம்மனத்துள்ளான் * இடவெந்தைமேவிய எம்பிரான் * தீர்த்தநீர்த் தடஞ்சோலைசூழ் * திருவேங்கடம் அடைநெஞ்சமே!  ",
            5: "வண்கையான் அவுணர்க்குநாயகன் * வேள்வியில்சென்றுமாணியாய் * மண்கையால் இரந்தான் * மராமரமேழும் எய்தவலத்தினான் *** எண்கையான் இமயத்துள்ளான் * இருஞ்சோலை மேவியவெம்பிரான் * திண்கைம்மா துயர்த்தீர்த்தவன் * திருவேங்கடம் அடைநெஞ்சமே!  ",
            6: "எண்திசைகளும் ஏழுலகமும் வாங்கிப் * பொன்வயிற்றில்பெய்து * பண்டுஓராலிலைப் பள்ளிகொண்டவன் * பான்மதிக்கு இடர்த்தீர்த்தவன் *** ஒண்திறல் அவுணன் உரத்துகிர் வைத்தவன் * ஒள்ளெயிற்றொடு * திண்திறலரியாயவன் * திருவேங்கடம் அடைநெஞ்சமே!  ",
            7: "பாருநீர் எரிகாற்றினொடு * ஆகாசமும் இவையாயினான் * பேருமாயிரம் பேசநின்ற * பிறப்பிலி பெருகுமிடம் *** காரும்வார் பனிநீள்விசும்பிடைச் * சோருமா முகில்தோய்தர * சேரும்வார்ப்பொழில்சூழ் * எழில்திருவேங்கடம் அடைநெஞ்சமே!  ",
            8: "அம்பரமனல் கால்நிலம் * சலமாகிநின்ற அமரர்க்கோன் * வம்புலா மலர்மேல் * மலிமடமங்கை தன்கொழுநன்அவன் *** கொம்பினன்ன இடைமடக்குறமாதர் * நீளிதணந்தொறும் * செம்புநம்மவைகாவல்கொள் * திருவேங்கடம் அடைநெஞ்சமே!  ",
            9: "🙏 பேசுமின்திருநாமம்எட்டெழுத்தும் * சொல்லிநின்று பின்னரும் * பேசுவார்த்தம்மை உய்யவாங்கிப் * பிறப்பறுக்கும் பிரானிடம் *** வாசமாமலர் நாறுவார்ப்பொழில் * சூழ்தரும் உலகுக்கெல்லாம் * தேசமாய்த் திகழும்மலை * திருவேங்கடம் அடைநெஞ்சமே!  ",
            10: "🙏 செங்கயல் திளைக்கும் சுனைத் * திருவேங்கடத்துறைசெல்வனை * மங்கையர்த்தலைவன் கலிகன்றி * வண்தமிழ்ச் செஞ்சொல்மாலைகள் *** சங்கையின்றித்தரித்து உரைக்கவல்லார்கள் * தஞ்சமதாகவே * வங்கமாகடல்வையம் காவலராகி * வானுலகாள்வரே!  ",
        },
        'PTM.1.9.steps': {
            1: "🙏 தாயேதந்தையென்றும் * தாரமே கிளைமக்களென்றும் * நோயேபட்டொழிந்தேன் * உன்னைக்காண்பதோர் ஆசையினால் *** வேயேய்பூம்பொழில்சூழ் * விரையார் திருவேங்கடவா! * நாயேன் வந்துஅடைந்தேன் * நல்கிஆளென்னைக்கொண்டருளே.  ",
            2: "மானேய் கண்மடவார் * மயக்கில்பட்டு மாநிலத்து * நானே நானாவித * நரகம்புகும் பாவம்செய்தேன் *** தேனேய் பூம்பொழில்சூழ் * திருவேங்கடமாமலை * என்ஆனாய் வந்தடைந்தேன் * அடியேனைஆட்கொண்டருளே.  ",
            3: "கொன்றேன் பல்லுயிரைக் * குறிக்கோள் ஒன்றிலாமையினால் * என்றேனும் இரந்தார்க்கு * இனிதாக உரைத்தறியேன் *** குன்றேய் மேகமதிர் * குளிர்மாமலை வேங்கடவா! * அன்றே வந்தடைந்தேன் * அடியேனைஆட்கொண்டருளே.  ",
            4: "குலந்தானெத்தனையும் * பிறந்தே இறந்தெய்த்தொழிந்தேன் * நலந்தான்ஒன்றுமிலேன் * நல்லதோர்அறம்செய்துமிலேன் *** நிலம்தோய் நீள்முகில்சேர் * நெறியார் திருவேங்கடவா! * அலந்தேன் வந்தடைந்தேன் * அடியேனை ஆட்கொண்டருளே.   ",
            5: "எப்பாவம்பலவும் * இவையேசெய்து இளைத்தொழிந்தேன் * துப்பா! நின்னடியே * தொடர்ந்தேத்தவும் கிற்கின்றிலேன் *** செப்பார் திண்வரைசூழ் * திருவேங்கடமாமலை * என்அப்பா! வந்தடைந்தேன் * அடியேனைஆட்கொண்டருளே.  ",
            6: "மன்னாய் நீரெரிகால் * மஞ்சுலாவும் ஆகாசமுமாம் * புண்ணாராக்கைதன்னுள் * புலம்பித்தளர்ந்து எய்த்தொழிந்தேன் *** விண்ணார் நீள்சிகர * விரையார் திருவேங்கடவா! * அண்ணா! வந்தடைந்தேன் * அடியேனைஆட்கொண்டருளே.  ",
            7: "தெரியேன் பாலகனாய்ப் * பலதீமைகள் செய்துமிட்டேன் * பெரியேனாயினபின் * பிரர்க்கே உழைத்துஏழையானேன் *** கரிசேர் பூம்பொழில்சூழ் * கனமாமலை வேங்கடவா! * அரியே! வந்தடைந்தேன் * அடியேனைஆட்கொண்டருளே.  ",
            8: "நோற்றேன் பல்பிறவி * உன்னைக்காண்பதோர் ஆசையினால் * ஏற்றேன் இப்பிறப்பே * இடருற்றனன் எம்பெருமான்! *** கோல்தேன் பாய்ந்தொழுகும் * குளிர்சோலைசூழ் வேங்கடவா! * ஆற்றேன் வந்தடைந்தேன் * அடியேனை ஆட்கொண்டருளே.  ",
            9: "பற்றேல் ஒன்றுமிலேன் * பாவமேசெய்து பாவியானேன் * மற்றேல் ஒன்றரியேன் *** மாயனே! எங்கள்மாதவனே! * கல்தேன் பாய்ந்தொழுகும் * கமலச்சுனை வேங்கடவா!அற்றேன் வந்தடைந்தேன் * அடியேனைஆட்கொண்டருளே.  ",
            10: "🙏 கண்ணாய் ஏழுலகுக்கு உயிராய * எங்கார்வண்ணனை * விண்ணோர்த்தாம்பரவும் * பொழில்வேங்கட வேதியனை *** திண்ணார்மாடங்கள்சூழ் * திருமங்கையர்க்கோன்கலியன் * பண்ணார்ப்பாடல்பத்தும் * பயில்வார்க்கில்லை பாவங்களே.  பத்தாம் பத்து – கண்ணார்கடல்சூழ் ",
        },
        'PTM.1.10.steps': {
            1: "🙏 கண்ணார் கடல்சூழ் * இலங்கைக்கு இறைவன்தன் * திண்ணாகம் பிளக்கச் * சலம்செல உய்த்தாய்! *** விண்ணோர்த்தொழும் * வேங்கட மாமலைமேய * அண்ணா! அடியேன் * இடரைக்களையாயே.  ",
            2: "இலங்கைப்பதிக்கு * அன்றுஇறையாய * அரக்கர்க்குலம்கெட்டு அவர்மாளக் * கொடிப்புள்திரித்தாய்! *** விலங்கல்குடுமித் * திருவேங்கடம்மேய * அலங்கல் துளபமுடியாய்! * அருளாயே.  ",
            3: "நீரார்க்கடலும் * நிலனும் முழுதுண்டு * ஏராலம்இளந்தளிர்மேல் * துயில் எந்தாய்! *** சீரார் * திருவேங்கடமாமலைமேய * ஆராவமுதே! * அடியேற்கருளாயே.  ",
            4: "உண்டாய் உறிமேல் * நறுநெய் அமுதாக * கொண்டாய் குறலாய் *** நிலம்ஈரடியாலே * விண்தோய் சிகரத் * திருவேங்கடம்மேயஅண்டா! * அடியேனுக்கு அருள்புரியாயே.  ",
            5: "தூணாய் அதனூடு * அரியாய்வந்துதோன்றி * பேணாஅவுணன்உடலம் * பிளந்திட்டாய்! *** சேணார் திருவேங்கட * மாமலைமேய * கோணாகணையாய்! * குறிக்கொள் எனைநீயே.  ",
            6: "மன்னா * இம்மனிசப்பிறவியை நீக்கி * தன்னாகித் * தன்னினருள் செய்யும்தலைவன் *** மின்னார் முகில்சேர் * திருவேங்கடம்மேய * என்னானை என்னப்பன் * என்னெஞ்சிலுளானே.  ",
            7: "மானே மடநோக்கி * திறத்து எதிர்வந்த * ஆனேழ்விடைசெற்ற * அணிவரைத்தோளா! *** தேனே! * திருவேங்கடமாமலை மேய * கோனே! என்மனம் * குடிகொண்டிருந்தாயே.  ",
            8: "சேயன்அணியன் * எனசிந்தையுள் நின்றமாயன் * மணிவாளொளி * வெண்டரளங்கள் *** வேய்விண்டுதிர் * வேங்கடமாமலைமேய * ஆயனடிஅல்லது * மற்றுஅறியேனே.  ",
            9: "வந்தாய் என்மனம் புகுந்தாய் * மன்னிநின்றாய் * நந்தாத கொழுஞ்சுடரே * எங்கள் நம்பீ! *** சிந்தாமணியே * திருவேங்கடம்மேய எந்தாய்! * இனியான் உன்னை * என்றும் விடேனே.  ",
            10: "🙏 வில்லார்மலி * வேங்கடமாமலைமேய * மல்லார் திரள்தோள் * மணிவண்ணனம்மானை *** கல்லார் திரள்தோள் * கலியன் சொன்னமாலை * வல்லாரவர் * வானவராகுவர்த்தாமே.   ",
        }
    };
    // Non-destructive runtime merging engine
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};
