window.MARKER_DATABASE = window.MARKER_DATABASE || {};
window.mergeLanguageTexts = function () {
  const text_bundle_ta = {

    'PMT.0.steps': {
      1: "உடையவர் அருளிச் செய்த: இன்னமுதம் ஊட்டுகேன் இங்கே வா பைங்கிளியே ! * தென்னரங்கம் பாட வல்ல சீர்ப் பெருமாள் * பொன்னஞ் சிலைசேர் நுதலியர் வேள் சேரலர் கோன் * எங்கள் குலசேகரன் என்றே கூறு.",
      2: "மணக்கால் நம்பி அருளிச் செய்த: ஆரம் கெடப் பரன் அன்பர் கொள்ளாரென்று * அவர்களுக்கே வாரங்கொடு குடப்பாம்பில் கையிட்டவன் * மாற்றலரை வீரம் கெடுத்த செங்கோல் கொல்லி காவலன் வில்லவர் கோன் * சேரன் குலசேகரன் முடி வேந்தர் சிகாமணியே."
    },
    'PMT.1.steps': {
      1: "* இருள் இரியச் சுடர் மணிகள் இமைக்கும் நெற்றி * இனத் துத்தி அணி பணம் ஆயிரங்கள் ஆர்ந்த * அரவரசப் பெருஞ்சோதி அனந்தன் என்னும் * அணி விளங்கும் உயர் வெள்ளை அணையை மேவி *** திருவரங்கப் பெரு நகருள் தெண்ணீர்ப் பொன்னி * திரைக்கையால் அடி வருடப் பள்ளி கொள்ளும் * கரு மணியைக் கோமளத்தைக் கண்டு கொண்டு * என் கண் இணைகள் என்று கொலா களிக்கும் நாளே? * ",
      2: "* வாய் ஓர் ஈரைஞ்ஞூறு துதங்கள் ஆர்ந்த * வளை உடம்பின் அழல் நாகம் உமிழ்ந்த செந்தீ * வீயாத மலர்ச் சென்னி விதானமே போல் * மேன்மேலும் மிக எங்கும் பரந்ததன் கீழ் *** காயாம்பூ மலர்ப் பிறங்கல் அன்ன மாலை * கடி அரங்கத்து அரவணையிற் பள்ளிகொள்ளும் * மாயோனை மணத்தூணே பற்றி நின்று * என் வாயார என்றுகொலோ வாழ்த்தும் நாளே? * ",
      3: "எம் மாண்பின் அயன் நான்கு நாவினாலும் * எடுத்து ஏத்தி ஈரிரண்டு முகமும் கொண்டு * எம்மாடும் எழிற்கண்கள் எட்டினோடும் * தொழுது ஏத்தி இனிது இறைஞ்ச நின்ற *** செம்பொன் அம்மான்தன் மலர்க் கமலக் கொப்பூழ் தோன்ற * அணி அரங்கத்து அரவணையிற் பள்ளிகொள்ளும் * அம்மான்தன் அடியிணைக் கீழ் அலர்கள் இட்டு * அங்கு அடியவரோடு என்றுகொலோ அணுகும் நாளே? * ",
      4: "மாவினை வாய் பிளந்து உகந்த மாலை * வேலை வண்ணனை என் கண்ணனை வன் குன்றம் ஏந்தி * ஆவினை அன்று உயக் கொண்ட ஆயர் ஏற்றை * அமரர்கள் தம் தலைவனை அந் தமிழின் இன்பப் பாவினை *** அவ் வடமொழியை பற்று-அற்றார்கள் * பயில் அரங்கத்து அரவணையிற் பள்ளிகொள்ளும் * கோவினை நா உற வழுத்தி என்தன் கைகள் * கொய்ம்மலர் தூய் என்றுகொலோ கூப்பும் நாளே? * ",
      5: "இணையில்லா இன்னிசை யாழ் கெழுமி * இன்பத் தும்புருவும் நாரதனும் இறைஞ்சி ஏத்த * துணையில்லாத் தொல் மறை நூல் தோத்திரத்தால் * தொல் மலர்க்கண் அயன் வணங்கி ஓவாது ஏத்த *** மணி மாட மாளிகைகள் மல்கு செல்வ * மதிள் அரங்கத்து அரவணையிற் பள்ளிகொள்ளும் * மணிவண்ணன் அம்மானைக் கண்டுகொண்டு * என் மலர்ச் சென்னி என்றுகொலோ வணங்கும் நாளே * ",
      6: "அளி மலர்மேல் அயன் அரன் இந்திரனோடு * ஏனை அமரர்கள் தம் குழுவும் அரம்பையரும் மற்றும் * தெளி மதி சேர் முனிவர்கள் தம் குழுவும் முந்தித் * திசை திசையில் மலர் தூவிச் சென்று சேரும் *** களி மலர் சேர் பொழில் அரங்கத்து உரகம் ஏறிக் * கண்வளரும் கடல்வண்ணர் கமலக் கண்ணும் * ஒளி மதி சேர் திருமுகமும் கண்டுகொண்டு * என் உள்ளம் மிக என்றுகொலோ உருகும் நாளே? * ",
      7: "மறம் திகழும் மனம் ஒழித்து வஞ்சம் மாற்றி * வன் புலன்கள் அடக்கி இடர்ப் பாரத் துன்பம் துறந்து * இரு முப்பொழுது ஏத்தி எல்லை இல்லாத் தொல் நெறிக்கண் * நிலை நின்ற தொண்டரான *** அறம் திகழும் மனத்தவர் தம் கதியை பொன்னி * அணி அரங்கத்து அரவணையிற் பள்ளிகொள்ளும் * நிறம் திகழும் மாயோனை கண்டு என் கண்கள் * நீர் மல்க என்றுகொலோ நிற்கும் நாளே? * ",
      8: "கோல் ஆர்ந்த நெடுஞ்சார்ங்கம் கூனற் சங்கம் * கொலையாழி கொடுந்தண்டு கொற்ற ஒள் வாள் * கால் ஆர்ந்த கதிக் கருடன் என்னும் * வென்றிக் கடும்பறவை இவை அனைத்தும் புறஞ்சூழ் காப்ப *** சேல் ஆர்ந்த நெடுங்கழனி சோலை சூழ்ந்த * திருவரங்கத்து அரவணையிற் பள்ளிகொள்ளும் * மாலோனைக் கண்டு இன்பக் கலவி எய்தி * வல்வினையேன் என்றுகொலோ வாழும் நாளே? * ",
      9: "தூராத மனக்காதல் தொண்டர் தங்கள் குழாம் குழுமித் * திருப்புகழ்கள் பலவும் பாடி * ஆராத மனக் களிப்போடு அழுத கண்ணீர் * மழை சோர நினைந்து உருகி ஏத்தி *** நாளும் சீர் ஆர்ந்த முழவு-ஓசை பரவை காட்டும் * திருவரங்கத்து அரவணையிற் பள்ளிகொள்ளும் * போர் ஆழி அம்மானைக் கண்டு துள்ளிப் * பூதலத்தில் என்றுகொலோ புரளும் நாளே? * ",
      10: "* வன்பெரு வானகம் உய்ய அமரர் உய்ய மண் உய்ய * மண் உலகில் மனிசர் உய்ய * துன்பமிகு துயர் அகல அயர்வொன்று இல்லாச் சுகம் வளர * அகமகிழும் தொண்டர் வாழ *** அன்பொடு தென்திசை நோக்கிப் பள்ளி கொள்ளும் * அணி அரங்கன் திருமுற்றத்து அடியார் தங்கள் * இன்பமிகு பெருங்குழுவு கண்டு * யானும் இசைந்து உடனே என்று கொலோ இருக்கும் நாளே? * ",
      11: "* திடர் விளங்கு கரைப் பொன்னி நடுவுபாட்டுத் * திருவரங்கத்து அரவணையிற் பள்ளிகொள்ளும் * கடல் விளங்கு கருமேனி அம்மான்தன்னைக் * கண்ணாரக் கண்டு உகக்கும் காதல்தன்னால் *** குடை விளங்கு விறல் தானைக் கொற்ற ஒள் வாள் * கூடலர்கோன் கொடைக் குலசேகரன் சொற் செய்த * நடை விளங்கு தமிழ் மாலை பத்தும் வல்லார் * நலந்திகழ் நாரணன் அடிக்கீழ் நண்ணுவாரே * ",
      12: "அடிவரவு: இருள் வாய் * எம்மாண்பின் மாவினை * இணை அளி * மறம் கோல் * தூராத வன்பெரு * திடர் தேட்டு * "
    },
    'PMT.2.steps': {
      1: "* தேட்டருந்திறல் தேனினைத் * தென்னரங்கனைத் * திருமாதுவாழ்வாட்டமில் வனமாலை மார்வனை வாழ்த்தி * மால் கொள் சிந்தையராய் *** ஆட்ட மேவி அலந்து அழைத்து * அயர்வெய்தும் மெய்யடியார்கள் தம் * ஈட்டம் கண்டிடக் கூடுமேல் * அது காணும் கண் பயன் ஆவதே.",
      2: "தோடுலா மலர் மங்கை தோள் இணை தோய்ந்ததும் * சுடர் வாளியால் * நீடு மாமரம் செற்றதும் நிரை மேய்த்தும் * இவையே நினைந்து *** ஆடிப்பாடி அரங்கவோ என்று அழைக்கும் * தொண்டரடிப் பொடிஆட நாம் பெறில் * கங்கை நீர் குடைந்தாடும் * வேட்கை என்னாவதே?",
      3: "ஏறு அடர்த்ததும் ஏனமாய் நிலம் கீண்டதும் * , முன் இராமனாய் * மாறு அடர்த்ததும் மண் அளந்ததும் * சொல்லிப் பாடி *** வண் பொன்னிப்பேராறு போல் வரும் கண்ண நீர் கொண்டு * அரங்கன் கோயில் திருமுற்றம் * சேறு செய் தொண்டர் சேவடிச் * செழுஞ்சேறு என் சென்னிக்கு அணிவனே.",
      4: "தோய்த்த தண் தயிர் வெண்ணெய் பால் உடன்உண்டலும் * உடன்று ஆய்ச்சி கண்டு * ஆர்த்த தோளுடை எம்பிரான் * என் அரங்கனுக்கு அடியார்களாய் *** நாத்தழும்ப எழ நாரணா என்று அழைத்து * மெய் தழும்பத் தொழுதுஏத்தி * இன்புறும் தொண்டர் சேவடி * ஏத்தி வாழ்த்தும் என் நெஞ்சமே.",
      5: "பொய் சிலைக் குரலேற்று எருத்தம் இறுத்துப் * போர் அரவீர்த்த கோன் * செய்சிலைச் சுடர் சூழ் ஒளித் * திண்ண மாமதிள் தென் அரங்கனாம் *** மெய் சிலைக் கருமேகம் ஒன்று * தம் நெஞ்சில் நின்று திகழப் போய் * மெய் சிலிர்ப்பவர் தம்மையே நினைந்து * என் மனம் மெய் சிலிர்க்குமே.",
      6: "ஆதி அந்தம் அனந்தம் அற்புதமான * வானவர் தம் பிரான் * பாதமாமலர் சூடும் பத்தியிலாத * பாவிகள் உய்ந்திட *** தீதில் நன்னெறி காட்டி * எங்கும் திரிந்த அரங்கன் எம்மானுக்கே * காதல் செய் தொண்டர்க்கு எப்பிறப்பிலும் * காதல் செய்யும் என் நெஞ்சமே.",
      7: "காரினம் புரை மேனி நற்கதிர் * மத்த வெண்ணகைச் செய்யவாய் * ஆர மார்வன் அரங்கன் என்னும் * அரும்பெருஞ் சுடர் ஒன்றினை *** சேரும் நெஞ்சினராகிச் * சேர்ந்து கசிந்து இழிந்த கண்ணீர்களால் * வார நிற்பவர் தாள் இணைக்கு * ஒர் வாரமாகும் என் நெஞ்சமே.",
      8: "மாலையுற்ற கடல் கிடந்தவன் * வண்டு கிண்டு நறுந்துழாய் * மாலை உற்றவரைப் பெருந்திரு மார்வனை * மலர்க் கண்ணனை *** மாலை உற்றெழுந்து ஆடிப் பாடித் * திரிந்த அரங்கன் எம்மானுக்கே * மாலை உற்றிடும் தொண்டர் வாழ்வுக்கு * மாலை உற்றது என் நெஞ்சமே.",
      9: "மொய்த்துக் கண் பனி சோர மெய்கள் சிலிர்ப்ப * ஏங்கி இளைத்து நின்று * எய்த்துக் கும்பிடு நட்டம் இட்டு எழுந்து * ஆடிப் பாடி இறைஞ்சி *** என்அத்தன் அச்சன் அரங்கனுக்கு அடியார்களாகி * அவனுக்கேபித்தராம் அவர் * பித்தர் அல்லர்கள் மற்றையார் முற்றும் பித்தரே.",
      10: "* அல்லி மாமலர் மங்கை நாதன் * அரங்கன் மெய் அடியார்கள் தம் * எல்லை இல் அடிமைத் திறத்தினில் * என்று மேவ மனத்தனாம் *** காெல்லி காவலன் கூடல் நாயகன் * கோழிக் கோன் குலசேகரன் * சொல்லின் இன் தமிழ் மாலை வல்லவர் * தொண்டர் தொண்டர்கள் ஆவரே.",
      11: "அடிவரவு: தேட்டு தோடு * ஏறு தோய்த்த * பொய் ஆதி * காரினம் மாலை * மொய்த்து அல்லி மெய் *"
    },
    'PMT.3.steps': {
      1: "* மெய்யில் வாழ்க்கையை * மெய்யெனக் கொள்ளும் * இவ்வையம் தன்னொடும் * கூடுவது இல்லை யான் *** ஐயனே! * அரங்கா! என்று அழைக்கின்றேன். * மையல் கொண்டு ஒழிந்தேன் * எந்தன் மாலுக்கே.",
      2: "நூலினேர் இடையார் * திறத்தே நிற்கும் * ஞாலம் தன்னொடும் * கூடுவது இல்லை யான் *** ஆலியா அழையா * அரங்கா! என்று * மால் எழுந்து ஒழிந்தேன் * எந்தன் மாலுக்கே",
      3: "மாரனார் * வரி வெஞ்சிலைக்கு ஆட்செய்யும் * பாரினாரொடும் * கூடுவது இல்லை யான் *** ஆரமார்வன் * அரங்கன் அனந்தன் * நல் நாரணன் * நரகாந்தகன் பித்தனே",
      4: "உண்டியே உடையே * உகந்தோடும் * இம் மண்டலத்தொடும் * கூடுவதில்லை யான் *** அண்டவாணன் * அரங்கன் வன்பேய் முலை * உண்ட வாயன் தன் * உன்மத்தன் காண்மினே",
      5: "தீதில் நன்னெறி நிற்க * அல்லாது செய் * நீதியாரொடும் * கூடுவது இல்லை யான் *** ஆதி ஆயன் * அரங்கன் அந்தாமரைப் * பேதை மா * மணவாளன் தன் பித்தனே",
      6: "எம்பரத்தர் * அல்லாரொடும் கூடலன் * உம்பர் வாழ்வை * ஒன்றாகக் கருதிலன் *** தம்பிரான் அமரர்க்கு * அரங்கநகர் * எம்பிரானுக்கு * எழுமையும் பித்தனே",
      7: "எத்திறத்திலும் * யாரொடும் கூடும் * அச் சித்தம் தன்னைத் * தவிர்த்தனன் செங்கண்மால் *** அத்தனே! * அரங்கா! என்று அழைக்கின்றேன் * பித்தனாய் ஒழிந்தேன் * எம்பிரானுக்கே",
      8: "பேயரே * எனக்கு யாவரும் * யானும் ஓர் பேயனே * எவர்க்கும் இது பேசி என்? *** ஆயனே * அரங்கா! என்று அழைக்கின்றேன் * பேயனாய் ஒழிந்தேன் * எம்பிரானுக்கே",
      9: "* அங்கை ஆழி * அரங்கன் அடியிணை * தங்கு சிந்தைத் * தனிப்பெரும் பித்தனாம் *** கொங்கர் கோன் * குலசேகரன் சொன்ன சொல் * இங்கு வல்லவர்க்கு * ஏதம் ஒன்று இல்லையே",
      10: "அடிவரவு: மெய் நூல் * மாரனார் உண்டி * தீதில் எம்பரத்தர் * எத்திறத்திலும் பேயரே * அங்கை ஊன் *"
    },
    'PMT.4.steps': {
      1: "* ஊனேறு செல்வத்து * உடற்பிறவி யான் வேண்டேன் * ஆனேறு ஏழ் வென்றான் * அடிமைத் திறமல்லாமல் *** கூனேறு சங்கம் இடத்தான் தன் * வேங்கடத்து * கோனேரி வாழும் * குருகாய்ப் பிறப்பேனே.",
      2: "ஆனாத செல்வத்து * அரம்பையர்கள் தற்சூழ * வான் ஆளும் செல்வமும் * மண்ணரசும் யான் வேண்டேன் *** தேனார் பூஞ்சோலைத் * திருவேங்கடச் சுனையில் * மீனாய்ப் பிறக்கும் * விதி உடையேன் ஆவேனே.",
      3: "பின்னிட்ட சடையானும் * பிரமனும் இந்திரனும் * துன்னிட்டுப் புகல் அரிய * வைகுந்த நீள் வாசல் *** மின்வட்டச் சுடராழி * வேங்கடக் கோன் தான் உமிழும் * பொன் வட்டில் பிடித்து உடனே * புகப் பெறுவேன் ஆவேனே.",
      4: "ஒண் பவள வேலை * உலவு தண் பாற்கடலுள் * கண் துயிலும் மாயோன் * கழல் இணைகள் காண்பதற்கு *** பண் பகரும் வண்டினங்கள் * பண் பாடும் வேங்கடத்து * செண்பகமாய் நிற்கும் * திருவுடையேன் ஆவேனே.",
      5: "கம்ப மதயானை * கழுத்தகத்தின் மேல் இருந்து * இன்பமரும் செல்வமும் * இவ்வரசும் யான் வேண்டேன் *** எம்பெருமான் ஈசன் * எழில் வேங்கட மலைமேல் * தம்பகமாய் நிற்கும் * தவமுடையேன் ஆவேனே.",
      6: "மின்னனைய நுண்ணிடையார் * உருப்பசியும் மேனகையும் * அன்னவர் தம் பாடலொடும் * ஆடல் அவை ஆதரியேன் *** தென்னவென வண்டினங்கள் * பண் பாடும் வேங்கடத்துள் * அன்னனைய பொற்குவடாம் * அருந்தவத்தன் ஆவேனே.",
      7: "வானாளும் மாமதி போல் * வெண்குடைக் கீழ் * மன்னவர்தம் கோனாகி வீற்றிருந்து * கொண்டாடும் செல்வறியேன் *** தேனார் பூஞ்சோலைத் * திருவேங்கட மலைமேல் * கானாறாய்ப் பாயும் * கருத்துடையேன் ஆவேனே.",
      8: "பிறையேறு சடையானும் * பிரமனும் இந்திரனும் * முறையாய பெருவேள்விக் * குறை முடிப்பான் மறையானான் *** வெறியார் தண்சோலைத் * திருவேங்கட மலைமேல் * நெறியாய்க் கிடக்கும் * நிலை உடையேன் ஆவேனே.",
      9: "* செடியாய வல்வினைகள் * தீர்க்கும் திருமாலே! * நெடியானே! வேங்கடவா! * நின் கோயிலின் வாசல் *** அடியாரும் வானவரும் * அரம்பையரும் கிடந்து இயங்கும் * படியாய்க் கிடந்து * உன் பவள வாய் காண்பேனே.",
      10: "உம்பர் உலகாண்டு * ஒரு குடைக் கீழ் * உருப்பசி தன் * அம்பொற் கலை அல்குல் * பெற்றாலும் ஆதரியேன் *** செம்பவள வாயான் * திருவேங்கடம் என்னும் * எம்பெருமான் பொன்மலை மேல் * ஏதேனும் ஆவேனே.",
      11: "* மன்னிய தண்சாரல் * வடவேங்கடத்தான் தன் * பொன்னியலும் சேவடிகள் * காண்பான் புரிந்து இறைஞ்சி *** கொன்னவிலும் கூர்வேல் * குலசேகரன் சொன்ன * பன்னிய நூல் தமிழ் வல்லார் * பாங்காய பத்தர்களே.",
      12: "அடிவரவு: ஊன் ஆனாத * பின்னிட்ட ஒண் * கம்ப மின் * வான் பிறை * செடி உம்பர் * மன்னிய தரு *"
    },

    'PMT.5.steps': {
      1: "* தரு துயரம் தடாயேல் * உன் சரண் அல்லால் சரண் இல்லை * விரை குழுவு மலர்ப் பொழில் சூழ் * விற்றுவக்கோட்டம்மானே! *** அரி சினத்தால் ஈன்ற தாய் * அகற்றிடினும் * மற்றவள் தன் அருள் நினைந்தே அழும் குழவி * அதுவே போன்று இருந்தேனே.",
      2: "கண்டார் இகழ்வனவே * காதலன் தான் செய்திடினும் * கொண்டானை அல்லால் * அறியாக் குலமகள் போல் *** விண்தோய் மதிள் புடைசூழ் * விற்றுவக்கோட்டம்மா! * நீ கொண்டாளாய் ஆகிலும் * உன் குரை கழலே கூறுவனே.",
      3: "மீன் நோக்கும் நீள்வயல் சூழ் * விற்றுவக்கோட்டம்மா! * என் பால் நோக்காய் ஆகிலும் * உன் பற்றல்லால் பற்றிலேன் *** தான் நோக்காது எத்துயரம் * செய்திடினும் * தார்வேந்தன் கோல் நோக்கி வாழும் * குடி போன்று இருந்தேனே.",
      4: "வாளால் அறுத்துச் சுடினும் * மருத்துவன் பால் * மாளாத காதல் * நோயாளன் போல் மாயத்தால் *** மீளாத்துயர் தரினும் * விற்றுவக்கோட்டம்மா! * நீ ஆளா உனதருளே * பார்ப்பன் அடியேனே.",
      5: "வெங்கண் திண் களிறு அடர்த்தாய்! * விற்றுவக்கோட்டம்மானே! * எங்குப் போய் உய்கேன்? * உன் இணையடியே அடையல் அல்லால் *** எங்கும் போய்க் கரை காணாது * எறிகடல் வாய் மீண்டேயும் * வங்கத்தின் கூம்பேறும் * மாப்பறவை போன்றேனே.",
      6: "செந்தழலே வந்து * அழலைச் செய்திடினும் * செங்கமலம் அந்தரம் சேர் * வெங்கதிரோற்கு அல்லால் அலராவால் *** வெந்துயர் வீட்டாவிடினும் * விற்றுவக்கோட்டம்மா! * உன் அந்தமில் சீர்க்கல்லால் * அகம் குழைய மாட்டேனே.",
      7: "எத்தனையும் வான் மறந்த காலத்தும் * பைங்கூழ்கள் * மைத்தெழுந்த மாமுகிலே * பார்த்திருக்கும் மற்றவை போல் *** மெய்த்துயர் வீட்டாவிடினும் * விற்றுவக்கோட்டம்மா! * என் சித்தமிக உன்பாலே * வைப்பன் அடியேனே.",
      8: "தொக்கிலங்கி ஆறெல்லாம் * பரந்தோடி * தொடுகடலே புக்கன்றிப் புறம் நிற்க * மாட்டாத மற்றவை போல் *** மிக்கிலங்கு முகில் நிறத்தாய்! * விற்றுவக்கோட்டம்மா! * உன் புக்கிலங்கு சீர் அல்லால் * புக்கிலன் காண் புண்ணியனே!",
      9: "நின்னையேதான் வேண்டி * நீள் செல்வம் வேண்டாதான் தன்னையே * தான் வேண்டும் * செல்வம் போல், மாயத்தால் *** மின்னையே சேர் திகிர் * விற்றுவக்கோட்டம்மானே! * நின்னையே தான் வேண்டி * நிற்பன் அடியேனே.",
      10: "* விற்றுவிக்கோட்டம்மா! * நீ வேண்டாயே ஆயிடினும் * மற்றாரும் பற்றிலேன் என்று * அவனைத் தாள் நயந்து *** கொற்றவேல் தானைக் * குலசேகரன் சொன்ன * நற்றமிழ் பத்தும் வல்லார் * நண்ணார் நரகமே.",
      11: "அடிவரவு: தரு கண்டார் * மீன் வாளால் * வெங்கண் செந்தழல் * எத்தனை தொக்கு * நின்னையே விற்றுவக்கோடு ஏர் *"
    },
    'PMT.6.steps': {
      1: "* ஏர்மலர்ப் பூங்குழல் ஆயர் மாதர் * எனைப் பலருள்ள இவ்வூரில் * உன்தன் மார்வு தழுவுதற்கு ஆசையின்மை * அறிந்தறிந்தே உன் தன் பொய்யைக் கேட்டு *** கூர்மழை போல் பனிக் கூதல் எய்திக் * கூசி நடுங்கிய முனையாற்றில் * வார் மணல் குன்றில் புலர நின்றேன் * வாசுதேவா! உன் வரவு பார்த்தே.",
      2: "கெண்டை ஒண் கண் மடவாள் ஒருத்தி * கீழையகத்துத் தயிர் கடையக் கண்டு * ஒல்லை நானும் கடைவன் என்று * கள்ள விழியை விழித்துப் புக்கு *** வண்டமர் பூங்குழல் தாழ்ந்து உலாவ * வாண்முகம் வேர்ப்பச் செவ்வாய் துடிப்ப * தண்தயிர் நீ கடைந்திட்ட வண்ணம் * தாமோதரா! மெய்யறிவன் நானே.",
      3: "கருமலர்க் கூந்தல் ஒருத்தி தன்னைக் * கடைக்கணித்து * ஆங்கே ஒருத்தி தன் பால் மருவி மனம் வைத்து மற்று ஒருத்திக்கு உரைத்து * ஒரு பேதைக்குப் பொய் குறித்து *** புரிகுழல் மங்கை ஒருத்தி தன்னைப் புணர்தி * அவளுக்கும் மெய்யன் அல்லை * மருது இறுத்தாய்! உன் வளர்த்தி ஊடே * வளர்க்கின்றதால் உன் தன் மாயைதானே.",
      4: "தாய் முலைப் பாலில் அமுதிருக்கத் * தவழ்ந்து தளர் நடை இட்டுச் சென்று * பேய் முலை வாய் வைத்து நஞ்சை உண்டு * பித்தன் என்றே பிறர் ஏச நின்றாய் *** ஆய்மிகு காதலோடு யான் இருப்ப * யான் விட வந்த என் தூதியோடே * நீமிகு போகத்தை நன்கு உகந்தாய் * அதுவும் உன் கோரம்புக்கு ஏற்கும் அன்றே.",
      5: "மின் ஒத்த நுண்ணிடையாளைக் கொண்டு * வீங்கிருள் வாய் என் தன் வீதி ஊடே * பொன் ஒத்த வாடை குக்கூடல் இட்டுப் * போகின்ற போது நான் கண்டு நின்றேன் *** கண்ணுற்றவளை நீ கண்ணாலிட்டுக் * கை விளிக்கின்றதும் கண்டே நின்றேன் * என்னுக்கு அவளை விட்டிங்கு வந்தாய்? * இன்னம் அங்கே நட நம்பி! நீயே",
      6: "மற்பொரு தோளுடை வாசுதேவா! * வல்வினையேன் துயில் கொண்டவாறே * இற்றை இரவு இடையே மத்தென்னை * இன்னணை மேலிட்டு அகன்று நீ போய் *** அற்றை இரவும் ஓர் பிற்றை நாளும் * அரிவையரோடும் அணைந்து வந்தாய் * எற்றுக்கு நீ என் மருங்கில் வந்தாய்? * எம்பெருமான்! நீ எழுந்தருளே.",
      7: "பையரவின்ன அணைப் பள்ளியினாய்! * பண்டையோம் அல்லோம் நாம் * நீ உகக்கும் மையரி ஒண் கண்ணினாரும் அல்லோம் * வைகி எம் சேரி வர ஒழி நீ *** செய்ய உடையும் திருமுகமும் * செங்கனி வாயும் குழலும் கண்டு * பொய் ஒரு நாள் பட்டதே அமையும் * புள்ளுவம் பேசாதே போகு நம்பீ!",
      8: "என்னை வருக எனக் குறித்திட்டு * இனமலர் முல்லையின் பந்தர் நீழல் * மன்னியவளைப் புணரப் புக்கு * மற்று என்னைக் கண்டுழறா நெகிழ்ந்தாய் *** பொன்னிற ஆடையைக் கையில் தாங்கிப் * பொய் அச்சம் காட்டிநீ போதியேலும் * இன்னம் என் கையகத்து ஈங்கு ஒரு நாள் * வருதியேல் என் சினம் தீர்வன் நானே.",
      9: "மங்கல நல் வன மாலை மார்வில் இலங்க * மயில் தழைப் பீலி சூடி * பொங்கிள ஆடை அரையிற் சாத்திப் * பூங்கொத்துக் காதில் புணரப் பெய்து *** கொங்கு நறுங்குழலார்களோடு * குழைந்து குழல் இனிது ஊதி வந்தாய் * எங்களுக்கே ஒரு நாள் வந்தூத * உன் குழல் இன்னிசை போதராதே.",
      10: "* அல்லி மலர்த் திருமங்கை கேள்வன் தன்னை * நயந்து இள ஆய்ச்சிமார்கள் * எல்லிப் பொழுதினில் ஏமத்தூடி * எள்கி உரைத்த உரை அதனை *** கொல்லி நகர்க்கிறை கூடற் கோமான் * குலசேகரன் இன்னிசையில் மேவி * சொல்லிய இன் தமிழ் மாலை பத்தும் * சொல்ல வல்லார்க்கு இல்லை துன்பம் தானே.",
      11: "அடிவரவு: ஏர் கெண்டை * கரு தாய் * மின் மற்பொரு * பை என்னை * மங்கலம் அல்லி ஆலை *"
    },
    'PMT.7.steps': {
      1: "* ஆலை நீள் கரும்பு அன்னவன் தாலோ * அம்புயத் தடங்கண்ணினன் தாலோ * வேலை நீர் நிறத்து அன்னவன் தாலோ * வேழப் போதக மன்னவன் தாலோ *** ஏலவார் குழல் என் மகன் தாலோ * என்று என்று உன்னை என் வாயிடை நிறைந் * தால் ஒலித்திடும் திருவினையில்லாத் * தாயரில் கடையாயின தாயே.",
      2: "வடிக் கொள் அஞ்சனம் எழுது செம்மலர்க்கண் * மருவிமேல் இனிது ஒன்றினை நோக்கி * முடக்கிச் சேவடி மலர்ச் சிறு கருந்தாள் * பொலியும் நீர் முகில் குழவியே போல *** அடக்கியாரச் செஞ்சிறு விரல் அனைத்தும் * அங்கையோடு அணைந்து ஆனையிற் கிடந்த * கிடக்கை கண்டிடப் பெற்றிலன் அந்தோ! * கேசவா! கெடுவேன் கெடுவேனே.",
      3: "முந்தை நன்முறை அன்புடை மகளிர் * முறை முறை தந்தம் குறங்கிடை இருத்தி * எந்தையே! என்தன் குலப் பெருஞ்சுடரே! * எழுமுகில் கணத்து எழில் கவர் ஏறே! *** உந்தை யாவன் என்று உரைப்ப நின் செங்கேழ் விரலினும் * கடைக் கண்ணினும் காட்ட * நந்தன் பெற்றனன் நல்வினையில்லா * நங்கள் கோன் வசுதேவன் பெற்றிலனே.",
      4: "களிநிலா எழில் மதி புரை முகமும் * கண்ணனே! திண்கை மார்வும் திண் தோளும் * தளிர்மலர்க் கருங்குழல் பிறை அதுவும் * தடங்கொள் தாமரைக் கண்களும் பாெலிந்த *** இளமை இன்பத்தை இன்று என் தன் கண்ணால் * பருகுவேற்கு இவள் தாய் என நினைந்த * அளவில் பிள்ளைமை இன்பத்தை இழந்த * பாவியேன் எனது ஆவி நில்லாதே.",
      5: "மருவு நின் திரு நெற்றியில் சுட்டி அசை தர * மணி வாயிடை முத்தம் தருதலும் * உன் தன் தாதையைப் போலும் வடிவு கண்டு கொண்டு * உள்ளம் உள் குளிர *** விரலைச் செஞ்சிறு வாயிடைச் சேர்த்து * வெகுளியாய் நின்று உரைக்கும் அவ்வுரையும் * திருவிலேன் ஒன்றும் பெற்றிலேன் * எல்லாம் தெய்வ நங்கை யசோதை பெற்றாளே.",
      6: "தண்ணந்தாமரைக் கண்ணனே! கண்ணா! * தவழ்ந்து எழுந்து தளர்ந்ததோர் நடையால் * மண்ணில் செம்பொடி ஆடிவந்து * என்தன் மார்வில் மன்னிடப் பெற்றிலேன் அந்தோ! *** வண்ணச் செஞ்சிறு கை விரல் அனைத்தும் * வாரி வாய்க் கொண்ட அடிசிலின் மிச்சில் * உண்ணப் பெற்றிலேன் ஓ! கொடுவினையேன் * என்னை என் செய்யப் பெற்றது எம்மோயே?",
      7: "குழகனே! என் தன் கோமளப் பிள்ளாய்! * கோவிந்தா! என் குடங்கையில் மன்னி * ஒழுகு பேரெழில் இளம் சிறு தளிர் போல் * ஒரு கையால் ஒரு முலை முகம் நெருடா *** மழலை மென்னகை இடையிடை அருளா * வாயிலே முலையிருக்க என் முகத்தே * எழில் கொள் நின் திருக்கண்ணிணை நோக்கந் தன்னையும் * இழந்தேன் இழந்தேனே.",
      8: "முழுதும் வெண்ணெய் அளைந்து தொட்டு உண்ணும் * முகிழ் இளம் சிறுத் தாமரைக் கையும் * எழில் கொள் தாம்பு கொண்டு அடிப்பதற்கு எள்கு நிலையும் * வெண்தயிர் தோய்ந்த செவ்வாயும் *** அழுகையும் அஞ்சி நோக்கும் அந்நோக்கும் * அணி கொள் செஞ்சிறு வாய் நெளிப்பதுவும் * தொழுகையும் இவை கண்ட அசோதை * தொல்லை இன்பத்திறுதி கண்டாளே.",
      9: "குன்றினால் கவித்ததும் * கோலக் குரவை கோத்ததும் குடமாட்டும் * கன்றினால் விளவு எறிந்ததும் * காலால் காளியன் தலை மிதித்ததும் முதலா *** வென்றி சேர் பிள்ளை நல் விளையாட்டம் அனைத்திலும் * அங்கு என் உள்ளம் உள் குளிர * ஒன்றும் கண்டிடப் பெற்றிலேன் அடியேன் * காணுமாறு இனி உண்டெனில் அருளே.",
      10: "வஞ்சமேவிய நெஞ்சுடைப் பேய்ச்சி * வரண்டு நார் நரம்பு எழக்கரிந்துக்க * நஞ்சமார் தரு சுழி முலை அந்தோ! * சுவைத்து நீ அருள் செய்து வளர்ந்தாய் *** கஞ்சன் நாள் கவர் கருமுகில் எந்தாய்! * கடையப்பட்டேன் வெறிதே முலை சுமந்து * தஞ்சமேல் ஒன்றிலேன் உய்ந்திருந்தேன் * தக்கதே நல்ல தாயைப் பெற்றாயே.",
      11: "* மல்லை மாநகர்க்கு இறையவன் தன்னை * வான் செலுத்தி வந்து தீங்கணை மாயத்து * எல்லையில் பிள்ளை செய்வன காணாத் * தெய்வத் தேவகி புலம்பிய புலம்பல் *** கொல்லி காவலன் மாலடி முடி மேல் * கோலமாம் குலசேகரன் சொன்ன * நல்லிசைத் தமிழ் மாலை வல்லார்கள் * நண்ணுவார் எல்லை நாரணன் உலகே.",
      12: "அடிவரவு: ஆலை வடி * முந்தை களி * மருவு தண்ணம் * குழகன் முழுதும் * குன்றினால் வஞ்சம் * மல்லை மன்னு *"
    },
    'PMT.8.steps': {
      1: "* மன்னு புகழ்க் கௌசலை தன் * மணி வயிறு வாய்த்தவனே! * தென் இலங்கைக் கோன் முடிகள் * சிந்துவித்தாய்! செம்பொன் சேர் *** கன்னி நன்மாமதிள் புடை சூழ் * கணபுரத்தென் கருமணியே! * என்னுடைய இன்னமுதே! * இராகவனே! தாலேலோ.",
      2: "புண்டரிக மலர் அதன் மேல் * புவனி எல்லாம் படைத்தவனே! * திண் திறலாள் தாடகை தன் * உரம் உருவச் சிலை வளைத்தாய்! *** கண்டவர் தம் மனம் வழங்கும் * கணபுரத்தென் கருமணியே! * எண் திசையும ஆளுடையாய்! * இராகவனே! தாலேலோ.",
      3: "கொங்கு மலி கருங்குழலாள் * கௌசலை தன் குல மதலாய்! * தங்கு பெரும் புகழ்ச் சனகன் * திருமருகா! தாசரதீ! *** கங்கையிலும் தீர்தத மலி * கணபுரத்தென் கருமணியே! * எங்கள் குலத்து இன்னமுதே! * இராகவனே! தாலேலோ.",
      4: "தாமரை மேல் அயன் அவனைப் * படைத்தவனே! * தயரதன் தன் மாமதலாய் * மைதிலி தன் மணவாளா! *** வண்டினங்கள் காமரங்கள் இசை பாடும் * கணபுரத்தென் கருமணியே! * ஏமருவும் சிலை வலவா! * இராகவனே! தாலேலோ.",
      5: "பாராளும் படர் செல்வம் * பரத நம்பிக்கே அருளி * ஆரா அன்பு இளையவனோடு * அருங்கானம் அடைந்தவனே! *** சீராளும் வரை மார்பா! * திருக்கண்ணபுரத்தரசே! * தாராளும் நீண் முடி * என் தாசரதீ! தாலேலோ.",
      6: "சுற்றமெல்லாம் பின் தொடரத் * தொல் கானம் அடைந்தவனே! * அற்றவர்கட்கு அருமருந்தே * அயோத்தி நகர்க்கு அதிபதியே! *** கற்றவர்கள் தாம் வாழும் * கணபுரத்தென் கருமணியே! * சிற்றவை தன் சொல் கொண்ட * சீராமா! தாலேலோ.",
      7: "ஆலின் இலைப் பாலகனாய் * அன்று உலகம் உண்டவனே! * வாலியைக் கொன்று * அரசு இளைய வானரத்துக்கு அளித்தவனே! *** காலின் மணி கரை அலைக்கும் * கணபுரத்தென் கருமணியே! * ஆலிநகர்க்கு அதிபதியே! * அயோத்திமனே! தாலேலோ.",
      8: "* மலை அதனால் அணை கட்டி * மதிள் இலங்கை அழித்தவனே! * அலை கடலைக் கடைந்து * அமரர்க்கு அமுது அருளிச் செய்தவனே! *** கலை வலவர் தாம் வாழும் * கணபுரத்தென் கருமணியே! * சிலை வலவா! சேவகனே! * சீராமா! தாலேலோ.",
      9: "தளை அவிழும் நறுங்குஞ்சித் * தயரதன் தன் குல மதலாய்! * வளைய ஒரு சிலை அதனால் * மதிள் இலங்கை அழித்தவனே! *** களை கழுநீர் மருங்கலரும் * கணபுரத்தென் கருமணியே! * இளையவர்கட்கு அருள் உடையாய்! * இராகவனே! தாலேலோ",
      10: "* தேவரையும் அசுரரையும் * திசைகளையும் படைத்தவனே! * யாவரும் வந்து அடி வணங்க * அரங்க நகர்த் துயின்றவனே! *** காவிரி நல் நதி பாயும் * கணபுரத்தென் கருமணியே! * ஏவரி வெஞ்சிலை வலவா! * இராகவனே! தாலேலோ.",
      11: "* கன்னி நன் மாமதிள் புடைசூழ் * கணபுரத்து என் காகுத்தன் தன் அடிமேல் * தாலேலோ என்று உரைத்த * தமிழ் மாலை *** கொல் நவிலும் வேல் வலவன் * குடைக் குலசேகரன் சொன்ன * பன்னிய நூல் பத்தும் வல்லார் * பாங்காய பத்தர்களே.",
      12: "அடிவரவு: மன்னு புண்டரிகம் * கொங்கு தாமரை * பார் சுற்றம் * ஆலின் மலை * தளை தேவர் * கன்னி வன்தாள்"
    },
    'PMT.9.steps': {
      1: "* வன்தாளினிணை வணங்கி வள நகரம் தொழுது ஏத்த * மன்னன் ஆவான் நின்றாயை * அரியணை மேல் இருந்தாயை * நெடுங்கானம் படரப் போகு என்றாள் *** எம் இராமாவோ! * உனைப் பயந்த கைகேசி தன் சொல் கேட்டு * நன்றாக நானிலத்தை ஆள்வித்தேன் * நன்மகனே! உன்னை நானே.",
      2: "வெவ்வாயேன் வெவ்வுரை கேட்டு * இரு நிலத்தை வேண்டாதே விரைந்து * வென்றி மைவாய களிறு ஒழிந்து தேர் ஒழிந்து மா ஒழிந்து * வனமே மேவி *** நெய் வாய வேல் நெடுங்கண் நேரிழையும் * இளங்கோவும் பின்பு போக * எவ்வாறு நடந்தனை? எம் இராமாவோ! * எம்பெருமான்! என் செய்கேனே?",
      3: "கொல்லணை வேல் வரி நெடுங்கண் * கௌசலை தன் குலமதலாய்! குனி வில் ஏந்தும் * மல்லணைந்த வரைத் தோளா! * வல்வினையேன் மனம் உருக்கும் வகையே கற்றாய் *** மெல்லணை மேல் முன் துயின்றாய் இன்றினிப் போய் * வியன் கான மரத்தின் நீழல் * கல்லணை மேல் கண் துயிலக் கற்றனையோ? * காகுத்தா! கரிய கோவே!",
      4: "வா போகு வா இன்னம் வந்து ஒரு கால் கண்டு போ * மலராள் கூந்தல் * வேய் போலும் எழில் தோளி தன் பொருட்டா * விடையோன் தன் வில்லைச் செற்றாய்! *** மாபோகு நெடுங்கானம் வல்வினையேன் * மனம் உருக்கும் மகனே! * இன்று நீ போக என் நெஞ்சம் * இரு பிளவாய்ப் போகாதே நிற்குமாறே!",
      5: "பொருந்தார் கை வேல் நுதி போல் பரல் பாய * மெல்லடிக்கள் குருதி சோர * விரும்பாத கான் விரும்பி வெயில் உறைப்ப * வெம்பசி நோய் கூர *** இன்று பெரும்பாவியேன் மகனே! போகின்றாய் * கேகயர் கோன் மகளாய்ப் பெற்ற * அரும்பாவி சொல் கேட்ட அருவினையேன் * என் செய்கேன்? அந்தோ! யானே.",
      6: "அம்மா என்று உகந்து அழைக்கும் * ஆர்வச் சொல் கேளாதே அணி சேர் மார்வம் * என் மார்வத்து இடை அழுந்தத் * தழுவாதே முழுசாதே மோவாது உச்சி *** கைம்மாவின் நடையன்ன மென்னடையும் * கமலம் போல் முகமும் காணாது * எம்மானை என் மகனை இழந்திட்ட * இழிதகையேன் இருக்கின்றேனே.",
      7: "பூமருவு நறுங்குஞ்சி புன் சடையாப் புனைந்து * பூந்துகில் சேர் அல்குல் * காமர் எழில் விழல் உடுத்துக் * கலன் அணியாது அங்கங்கள் அழகு மாறி *** ஏமரு தோள் என் புதல்வன் * யான் இன்று செலத் தக்க வனம் தான் சேர்தல் * தூமறையீர்! இது தகவோ? * சுமந்திரனே! வசிட்டனே! சொல்லீர் நீரே.",
      8: "பொன் பெற்றார் எழில் வேதப் புதல்வனையும் * தம்பியையும் பூவை போலும் * மின் பற்றா நுண் மருங்குல் * மெல்லியல் என் மருகியையும் வனத்தில் போக்கி *** நின் பற்றா நின் மகன் மேல் பழி விளைத்திட்டு * என்னையும் நீள் வானில் போக்க * என் பெற்றாய்? கைகேசி * இருநிலத்தில் இனிதாக இருக்கின்றாயே.",
      9: "முன் ஒரு நாள் மழு வாளி சிலை வாங்கி * அவன் தவத்தை முற்றும் செற்றாய் * உன்னையும் உன் அருமையையும் உன் மோயின் வருத்தமும் * ஒன்றாகக் கொள்ளாது *** என்னையும் என் மெய்யுரையும் மெய்யாகக் கொண்டு * வனம் புக்க எந்தாய்! * நின்னையே மகனாகப் பெறப் பெறுவேன் * ஏழ் பிறப்பும் நெடுந்தோள் வேந்தே!",
      10: "தேனகு மாமலர்க் கூந்தல் * கௌசலையும் சுமித்திரையும் சிந்தை நோவ * கூன் உருவின் கொடுந் தொழுத்தை சொல் கேட்ட * கொடியவள் தன் சொல் கொண்டு *** இன்று கானகமே மிக விரும்பி * நீ துறந்த வள நகரைத் துறந்து * நானும் வானகமே மிக விரும்பிப் போகின்றேன் * மனு குலத்தார் தங்கள் கோவே!",
      11: "* ஏரார்ந்த கரு நெடுமால் இராமனாய் * வனம் புக்க அதனுக்கு ஆற்றா * தாரார்ந்த தடவரைத் தோள் தயரதன் தான் புலம்பிய * அப்புலம்பல் தன்னை *** கூரார்ந்த வேல் வலவன் கோழியர் கோன் * குடைக் குலசேகரன் சொல் செய்த * சீரார்ந்த தமிழ் மாலை இவை வல்லார் * தீநெறிக் கண் செல்லார் தாமே.",
      12: "அடிவரவு: வன்தாள் வெவ்வாயேன் * கொல்லணை வாபோகு * பொருந்தார் அம்மா * பூ பாென் * முன் தேன் * ஏரார்ந்த் அங்கண்"
    },
    'PMT.10.steps': {
      1: "* அங்கணெடு மதிள் புடை சூழ் அயோத்தி என்னும் * அணி நகரத்து உலகனைத்தும் விளக்கும் சோதி * வெங்கதிரோன் குலத்துக்கோர் விளக்காய்த் தோன்றி * விண் முழுதும் உயக் கொண்ட வீரன் தன்னை *** செங்கணெடுங் கருமுகிலை இராமன் தன்னைத் * தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * எங்கள் தனி முதல்வனை எம்பெருமான் தன்னை * என்று கொலோ ? கண் குளிரக் காணும் நாளே.",
      2: "வந்து எதிர்ந்த தாடகை தன் உரத்தைக் கீறி * வரு குருதி பொழி தர வன் கணை ஒன்று ஏவி * மந்திரங்கொள் மறை முனிவன் வேள்வி காத்து * வல்லரக்கர் உயிர் உண்ட மைந்தன் காண்மின் *** செந்தளிர் வாய் மலர் நகை சேர் செழுந்தண் சோலைத் * தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * அந்தணர்கள் ஒரு மூவாயிரவர் ஏத்த * அணிமணி ஆசனத்து இருந்த அம்மான் தானே.",
      3: "செவ்வரி நல் கரு நெடுங்கண் சீதைக்காகிச் * சின விடையோன் சிலை இறுத்து , மழுவாள் ஏந்தி * வெவ்வரி நற்சிலை வாங்கி வென்றி கொண்டு * வேல் வேந்தர் பகை தடிந்த வீரன் தன்னை *** தெவ்வர் அஞ்சு நெடும் புரிசை உயர்ந்த பாங்கர்த் * தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * எவ்வரி வெஞ்சிலைத் தடக்கை இராமன் தன்னை * இறைஞ்சுவார் இணை அடியே இறைஞ்சினேனே.",
      4: "தொத்தலர் பூஞ்சுரி குழற் கைகேசி சொல்லால் * தொன்னகரந் துறந்து * துறைக் கங்கை தன்னை * பத்தியுடைக் குகன் கடத்த வனம் போய்ப் புக்குப் * பரதனுக்குப் பாதுகமும் அரசும் ஈந்து *** சித்திர கூடத்து இருந்தான் தன்னை * இன்று தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * எத்தனையும் கண் குளிரக் காணப் பெற்ற * இருநிலத்தார்ககு இமையவர் நேர் ஒவ்வார் தாமே.",
      5: "வலி வணக்கு வரை நெடுந்தோள் விராதைக் கொன்று * வண் தமிழ் மாமுனி கொடுத்த வரி வில் வாங்கி * கலை வணக்கு நோக்கு அரக்கி மூக்கை நீக்கிக் * கரனோடு தூடணன் தன் உயிரை வாங்கி *** சிலை வணக்கி மான் மறிய எய்தான் தன்னைத் * தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * தலை வணக்கிக் கை கூப்பி ஏத்த வல்லார் * திரிதலால் தவமுடைத்துத் தரணி தானே.",
      6: "தன மருவு வைதேகி பிரியலுற்றுத் * தளர்வெய்திச் சடாயுவை வைகுந்தத்து ஏற்றி * வன் மருவு கவியரசன் காதல் கொண்டு * வாலியைக் கொன்று இலங்கை நகர் அரக்கர் கோமான் *** சினம் அடங்க மாருதியால் சுடுவித்தானைத் * தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * இனிது அமர்ந்த அம்மானை இராமன் தன்னை * ஏத்துவார் இணையடியே ஏத்தினேனே.",
      7: "குரை கடலை அடல் அம்பால் மறுக எய்து * குலை கட்டி மறு கரையை அதனால் ஏறி * எரி நெடு வேல் அரக்கரொடும் இலங்கை வேந்தன் * இன்னுயிர் கொண்டவன் தம்பிக்கு அரசும் ஈந்து *** திருமகளோடு இனிது அமர்ந்த செல்வன் தன்னைத் * தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * அரசு அமர்ந்தான் அடி சூடும் அரசை அல்லால் * அரசு ஆக எண்ணேன் மற்று அரசு தானே.",
      8: "அம்பொன் எடு மணி மாட அயோத்தி எய்தி * அரசு எய்தி அகத்தியன் வாய்த்தான் முன் கொன்றான் தன் * பெருந்தொல் கதை கேட்டு மிதிலைச் செல்வி * உலகுய்யத் திருவயிறு வாய்த்த மக்கள் *** செம்பவளத் திரள் வாய்த் தன் சரிதை கேட்டான் * தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * எம்பெருமான் தன் சரிதை செவியால் கண்ணால் * பருகுவோம் * இன்னமுதம் மதியோம் அன்றே.",
      9: "செறிதவச் சம்புகன் தன்னைச் சென்று கொன்று * செழுமறையோன் உயிர் மீட்டு தவத்தோன் ஈந்த * நிறை மணிப் பூண் அணியும் கொண்டு இலவணன் தன்னைத் * தம்பியால் வான் ஏற்றி முனிவன் வேண்ட *** திறல் விளங்கும் இலக்குமனைப் பிரிந்தான் தன்னைத் * தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * உறைவானை * மறவாத உள்ளம் தன்னை உடையோம் * mற்று உறுதுயரம் அடையோம் அன்றே.",
      10: "* அன்று சராசரங்களை வைகுந்தத்தேற்றி * அடல் அரவப் பகையேறி அசுரர் தம்மை வென்று * இலங்கு மணி நெடுந்தோள் நான்கும தோன்ற * விண் முழுதும் எதிர் வரத் தன் தாமம் ஏவி *** சென்றினிது வீற்றிருந்த அம்மான் தன்னைத் * தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * என்றும் நின்றான் அவன் இவன் என்று ஏத்தி * நாளும் இறைஞ்சுமினோ எப்பொழுதும் தொண்டீர் ! நீரே.",
      11: "* தில்லை நகர்த் திருச்சித்ரகூடம் தன்னுள் * திறல் விளங்கு மாருதியோடு அமர்ந்தான் தன்னை * எல்லையில் சீர்த் தயரதன் தன் மகனாய்த் தோன்றிற்று அது முதலாத் * தன்னுகம் புக்கதீறா *** கொல்லியலும் படைத்தானைக் கொற்ற ஒள் வாள் * கோழியர் கோன் குடைக் குலசேகரன் சொல் செய்த * நல்லியல் இன் தமிழ் மாலை பத்தும் வல்லார் * நலந்திகழ் நாரணன் அடிக் கீழ் நண்ணுவாரே.",
      12: "அடிவரவு: அங்கண் வந்து * செவ்வரி தொத்து * வலி தன * குரை அம்பொன் * செறி அன்று தில்லை"
    },
  };

  // Non-destructive runtime merging engine
  for (const key in text_bundle_ta) {
    window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
    for (const p in text_bundle_ta[key]) {
      const idx = parseInt(p) - 1;
      window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
      window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
      window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
    }
  }
};
