

window.MARKER_DATABASE = window.MARKER_DATABASE || {};

window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'TVM.0.1.steps': {
            1: "🙏 நாதமுனிகள் அருளிச் செய்தது : பக்தாம்ருதம் விஶ்வ ஜனானு மோதனம் * ஸர்வார்த்ததம் ஸ்ரீஶடகோப வாங்க்மயம் * ஸகஶ்ர ஶாகோப நிஷத்ஸமாகமம் * நமாம்யஹம் த்ராவிட வேத ஸாகரம்.",
            2: "🙏 ஈச்வரமுனிகள் அருளிச் செய்தது : திருவழுதி நாடென்றும் தென்குருகூர் என்றும் * மருவினிய வண்பொரு நலென்றும் * அருமறைகள் அந்தாதி செய்தான் அடியிணையே எப்பொழுதும் * சிந்தியாய் நெஞ்சே! தெளிந்து.",
            3: "🙏 சொட்டை நம்பிகள் அருளிச் செய்தது : மனத்தாலும் வாயாலும் வண்குருகூர் பேணும் * இனத்தாரையல்லா திறைஞ்சேன் * தனத்தாலும் ஏதும் குறைவிலேன் * எந்தை சடகோபன் பாதங்கள் யாமுடைய பற்று.",
            4: "🙏 அனந்தாழ்வான் அருளிச் செய்த்து : ஏய்ந்த பெருங்கீர்த்தி இராமானுசமுனிதன் * வாய்ந்த மலர்ப் பாதம் வணங்குகின்றேன் * ஆய்ந்த பெருஞ்ச் சீரார் சடகோபன் செந்தமிழ் வேதம் தரிக்கும் * பேராத உள்ளம் பெற.",
            5: "🙏 பட்டர் அருளிச் செய்தது : வான் திகழும் சோலை மதிளரங்கர் வண் புகழ் மேல் * ஆன்ற தமிழ் மறைகள் ஆயிரமும் * ஈன்ற முதல் தாய் சடகோபன் மொய்ம் பால் வளர்த்த * இதத்தாய் இராமுனுசன்.",
            6: "🙏 பட்டர் அருளிச் செய்தது : மிக்க இறை நிலையும் மெய்யாம் உயிர் நிலையும் * தக்க நெறியும் தடையாகித் தொக்கியலும் * ஊழ்வினையும் வாழ்வினையும் ஓதும் குருகையர் கோன் * யாழினிசை வேதத்தியல்.",
        }
    };
    // Non-destructive runtime merging engine
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};

