window.MARKER_DATABASE = window.MARKER_DATABASE || {};
window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'TML.0.steps': {
            1: "திருவங்கப்பெருமாளரையர் அருளிச்செய்தது: மற்றொன்றும் வேண்டா மனமே! மதிளரங்கர் * கற்றினம் மேய்த்த கழலிணைக்கீழ் * உற்றதிருமாலை பாடும் சீர்த் தொண்டரடிப்பொடி எம்பெருமானை * எப்பொழுதும் பேசு. "
        },
        'TML.1.steps': {
            1: "காவலில் புலனை வைத்துக் * கலிதனைக் கடக்கப் பாய்ந்து * நாவலிட்டு உழி தருகின்றோம் * நமன் தமர் தலைகள் மீதே *** மூவுலகு உண்டு உமிழ்ந்த * முதல்வ! நின் நாமம் கற்ற * ஆவலிப் புடைமை கண்டாய் * அரங்கமா நகர் உளானே! ",
            2: "பச்சை மாமலைபோல் மேனி * பவளவாய் கமலச் செங்கண் * அச்சுதா! அமரர் ஏறே! * ஆயர் தம் கொழுந்தே! என்னும் *** இச்சுவை தவிர யான்போய் * இந்திர லோகம் ஆளும் * அச்சுவை பெறினும் வேண்டேன் * அரங்கமா நகர் உளானே! ",
            3: "வேத நூல் பிராயம் நூறு * மனிசர் தாம் புகுவ ரேலும் * பாதியும் உறங்கிப் போகும் * நின்றதில் பதினையாண்டு *** பேதை பாலகனதாகும் * பிணி பசி மூப்புத் துன்பம் * ஆதலால் பிறவி வேண்டேன் * அரங்கமா நகர் உளானே! ",
            4: "மொய்த்த வல்வினையுள் நின்று * மூன்று எழுத்துடைய பேரால் * கத்திர பந்தும் அன்றே * பராங்கதி கண்டு கொண்டான் *** இத்தனை அடியரானார்க்கு * இரங்கும் நம் அரங்கனாய * பித்தனைப் பெற்றும் அந்தோ! * பிறவியுள் பிணங்கு மாறே! ",
            5: "பெண்டிரால் சுகங்கள் உய்ப்பான் * பெரியதோர் இடும்பை பூண்டு * உண்டிராக் கிடக்கும் போது * உடலுக்கே கரைந்து நைந்து *** தண்துழாய் மாலை மார்பன் * தமர்களாய்ப் பாடி யாடி * தொண்டு பூண்டமுதம் உண்ணாத் * தொழும்பர் சோறு உகக்குமாறே! ",
            6: "மறம்சுவர் மதிளெடுத்து * மறுமைக்கே வெறுமை பூண்டு * புறம்சுவர் ஓட்டை மாடம் * புரளும்போது அறிய மாட்டீர் *** அறம் சுவராகி நின்ற * அரங்கனார்க்கு ஆட்செய்யாதே * புறம்சுவர் கோலம் செய்து * புள்கவ்வக் கிடக்கின்றீரே! ",
            7: "புலையறம் ஆகிநின்ற * புத்தொடு சமண மெல்லாம் * கலையறக் கற்ற மாந்தர் * காண்பரோ கேட்பரோதாம் *** தலை அறுப்புண்டும் சாவேன் * சத்தியங் காண்மின் ஐயா * சிலையினால் இலங்கை செற்ற * தேவனே தேவன் ஆவான். ",
            8: "வெறுப்பொடு சமணர் முண்டர் * விதியில் சாக்கியர்கள் * நின்பால்பொறுப்பரியனகள் பேசில் * போவதே நோயதாகி *** குறிப்பெனக் கடையும் ஆகில் * கூடுமேல் தலையை * ஆங்கேஅறுப்பதே கருமம் கண்டாய் * அரங்கமா நகருளானே! ",
            9: "மற்றுமோர் தெய்வம் உண்டே * மதியிலா மானிடங்காள் * உற்றபோது அன்றி நீங்கள் * ஒருவன் என்று உணர மாட்டீர் *** அற்றமேல் ஒன்று அறீயீர் * அவனல்லால் தெய்வ மில்லை * கற்றினம் மேய்த்த எந்தை * கழலிணை பணிமின் நீரே. ",
            10: "நாட்டினான் தெய்வம் எங்கும் * நல்லதோர் அருள் தன்னாலே * காட்டினான் திருவரங்கம் * உய்பவர்க்கு உய்யும் வண்ணம் *** கேட்டிரே நம்பிமீர்காள்! * கெருட வாகனனும் நிற்க * சேட்டை தன் மடிய கத்துச் * செல்வம் பார்த்து இருக்கின் றீரே. ",
            11: "ஒருவில்லால் ஓங்கு முந்நீர் * அடைத்து உலகங்கள் உய்ய * செருவிலே அரக்கர் கோனைச் * செற்ற நம் சேவகனார் *** மருவிய பெரிய கோயில் * மதிள் திருவரங்கம் என்னா * கருவிலே திருவிலாதீர்! * காலத்தைக் கழிக்கின்றீரே. ",
            12: "நமனும் முற்கலனும் பேச * நரகில் நின்றார்கள் கேட்க * நரகமே சுவர்க்க மாகும் * நாமங்கள் உடைய நம்பி *** அவனதூர் அரங்கம் என்னாது * அயர்த்து வீழ்ந்து அளிய மாந்தர் * கவலையுள் படுகின்றார் என்று * அதனுக்கே கவல்கின்றேனே! ",
            13: "எறியுநீர் வெறிகொள் வேலை * மாநிலத்து உயிர்களெல்லாம் * வெறிகொள் பூந்துளவ மாலை * விண்ணவர் கோனை ஏத்த *** அறிவிலா மனிதர் எல்லாம் * அரங்கமென்று அழைப்பராகில் * பொறியில்வாழ் நரகம் எல்லாம் * புல்லெழுந்து ஒழியுமன்றே? ",
            14: "வண்டினம் முரலும் சோலை * மயிலினம் ஆலும் சோலை * கொண்டல் மீதணவும் சோலை * குயிலினம் கூவும் சோலை *** அண்டர்கோன் அமரும் சோலை * அணி திருவரங்கம் என்னா * மிண்டர் பாய்ந்து உண்ணும் சோற்றை * விலக்கி நாய்க்கு இடுமினீரே. ",
            15: "மெய்யர்க்கே மெய்யனாகும் * விதியிலா என்னைப் போல * பொய்யர்க்கே பொய்யனாகும் * புட்கொடி உடைய கோமான் *** உய்யப்போம் உணர்வினார்கட்கு * ஒருவன் என்றுணர்ந்த பின்னை * ஐயப்பாடு அறுத்துத் தோன்றும் * அழகனூர் அரங்க மன்றே? ",
            16: "சூதனாய்க் கள்வனாகித் * தூர்த்தரோடு இசைந்த காலம் * மாதரார் கயற்கண் என்னும் * வலையுள் பட்டு அழுந்துவேனை *** போதரே என்று சொல்லிப் * புந்தியில் புகுந்து * தன்பால்ஆதரம் பெருக வைத்த * அழகனூர் அரங்கம் அன்றே? ",
            17: "விரும்பி நின்று ஏத்த மாட்டேன் * விதியிலேன் மதியொன்றில்லை * இரும்புபோல் வலிய நெஞ்சம் * இறையிறை உருகும் வண்ணம் *** சுரும்பமர் சோலை சூழ்ந்த * அரங்கமா கோயில் கொண்ட * கரும்பினைக் கண்டு கொண்டேன் * கண்ணிணை களிக்கு மாறே! ",
            18: "இனிதிரைத் திவலை மோத * எறியும்தண் பரவை மீதே * தனிகிடந்து அரசு செய்யும் * தாமரைக் கண்ணன் எம்மான் *** கனியிருந்து அனைய செவ்வாய்க் * கண்ணணைக் கண்ட கண்கள் * பனியரும்பு உதிருமாலோ * எஞ்செய்கேன் பாவி யேனே! ",
            19: "குடதிசை முடியை வைத்துக் * குணதிசை பாதம் நீட்டி * வடதிசை பின்பு காட்டித் * தென்திசை இலங்கை நோக்கி *** கடல்நிறக் கடவுள் எந்தை * அரவணைத் துயிலுமா கண்டு * உடலெனக்கு உருகுமாலோ * எஞ்செய்கேன் உலகத்தீரே! ",
            20: "பாயும் நீர் அரங்கந்தன்னுள் * பாம்பணைப் பள்ளி கொண்ட * மாயனார் திருநன் மார்பும் * மரகத உருவும் தோளும் *** தூய தாமரைக் கண்களும் * துவரிதழ் பவள வாயும் * ஆயசீர் முடியும் தேசும் * அடியரோர்க்கு அகலலாமே? ",
            21: "பணிவினால் மனமதொன்றிப் * பவளவாய் அரங்கனார்க்கு * துணிவினால் வாழமாட்டாத் * தொல்லை நெஞ்சே! நீ சொல்லாய் *** அணியனார் செம்பொனாய * அருவரை அனைய கோயில் * மணியனார் கிடந்தவாற்றை * மனத்தினால் நினைக்கலாமே? ",
            22: "பேசிற்றே பேசல் அல்லால் * பெருமை ஒன்று உணரலாகாது * ஆசற்றார் தங்கட்கல்லால் * அறியலா வானுமல்லன் *** மாசற்றார் மனத்துளானை * வணங்கி நாம் இருப்பதல்லால் * பேசத்தான் ஆவதுண்டோ? * பேதை நெஞ்சே!நீ சொல்லாய். ",
            23: "கங்கையில் புனிதமாய * காவிரி நடுவு பாட்டு * பொங்குநீர் பரந்து பாயும் * பூம்பொழில் அரங்கம் தன்னுள் *** எங்கள் மால் இறைவன் ஈசன் * கிடந்ததோர் கிடக்கை கண்டும் * எங்ஙனம் மறந்து வாழ்கேன் * ஏழையேன் ஏழையேனே! ",
            24: "வெள்ளநீர் பரந்து பாயும் * விரிபொழில் அரங்கம் தன்னுள் * கள்ளனார் கிடந்த வாறும் * கமலநன் முகமும் கண்டு *** உள்ளமே! வலியை போலும் * ஒருவன் என்று உணர மாட்டாய் * கள்ளமே காதல் செய்துன் * கள்ளத்தே கழிக்கின்றாயே! ",
            25: "குளித்து மூன்றனலை ஓம்பும் * குறிகொள் அந்தணமை தன்னை * ஒளித்திட்டேன் என்கணில்லை * நின்கணும் பத்தன் அல்லேன் *** களிப்பதென் கொண்டு நம்பீ! * கடல்வண்ணா! கதறு கின்றேன் * அளித்தெனக்கு அருள்செய் கண்டாய் * அரங்கமா நகர் உளானே! ",
            26: "போதெல்லாம் போது கொண்டுன் * பொன்னடி புனைய மாட்டேன் * தீதிலா மொழிகள் கொண்டுன் * திருக்குணம் செப்ப மாட்டேன் *** காதலால் நெஞ்சம் அன்பு * கலந்திலேன் அது தன்னாலே * ஏதிலேன் அரங்கர்க்கு எல்லே! * எஞ்செய்வான் தோன்றினேனே! ",
            27: "குரங்குகள் மலையை நூக்கக் * குளித்துத்தாம் புரண்டிட்டோடி * தரங்க நீரடைக்கலுற்ற * சலமிலா அணிலம் போலேன் *** மரங்கள்போல் வலிய நெஞ்சம் * வஞ்சனேன் நெஞ்சு தன்னால் * அரங்கனார்க்கு ஆட்செய்யாதே * அளியத்தேன் அயர்க்கின்றேனே! ",
            28: "உம்பரால் அறியலாகா * ஒளியுளார் ஆனைக்காகி * செம்புலால் உண்டு வாழும் * முதலைமேல் சீறி வந்தார் *** நம்பரமாயதுண்டே? * நாய்களோம் சிறுமை யோரா * எம்பிராற்கு ஆட்செய்யாதே * எஞ்செய்வான் தோன்றினேனே! ",
            29: "ஊரிலேன் காணி இல்லை * உறவு மற்றொருவர் இல்லை * பாரில்நின் பாத மூலம் * பற்றிலேன் பரம மூர்த்தி *** காரொளி வண்ணனே!(என்) * கண்ணனே! கதறு கின்றேன் * ஆருளர்க் களைகண் அம்மா! * அரங்கமா நகரு ளானே! ",
            30: "மனத்திலோர் தூய்மை இல்லை * வாயிலோர் இன்சொல் இல்லை * சினத்தினால் செற்றம் நோக்கித் * தீவிளி விளிவன் வாளா *** புனத்துழாய் மாலை யானே! * பொன்னிசூழ் திருவரங்கா * எனக்கினி கதியென் சொல்லாய் * என்னை ஆளுடைய கோவே! ",
            31: "தவத்துளார் தம்மில் அல்லேன் * தனம் படத்தாரில் அல்லேன் * உவர்த்தநீர் போல என்தன் * உற்றவர்க்கு ஒன்றும் அல்லேன் *** துவர்த்த செவ்வாயினார்க்கே * துவக்கறத் துரிசனானேன் * அவத்தமே பிறவி தந்தாய் * அரங்கமா நகரு ளானே! ",
            32: "ஆர்த்து வண்டலம்பும் சோலை * அணிதிருவரங்கந் தன்னுள் * கார்த்திரள் அனைய மேனிக் * கண்ணனே! உன்னைக் காணும் *** மார்க்கம் ஒன்றறிய மாட்டா * மனிசரில் துரிசனாய * மூர்க்கனேன் வந்து நின்றேன் * மூர்க்கனேன் மூர்க்கனேனே. ",
            33: "மெய்யெல்லாம் போக விட்டு * விரிகுழலாரில் பட்டு * பொய்யெலாம் பொதிந்து கொண்ட * போட்கனேன் வந்து நின்றேன் *** ஐயனே! அரங்கனே! உன் * அருளென்னும் ஆசை தன்னால் * பொய்யனேன் வந்து நின்றேன் * பொய்யனேன் பொய்யனேனே. ",
            34: "உள்ளத்தே உறையும் மாலை * உள்ளுவான் உணர்வொன்றில்லா * கள்ளத்தேன் நானும் தொண்டாய்த் * தொண்டுக்கே கோலம் பூண்டேன் *** உள்ளுவார் உள்ளிற்று எல்லாம் * உடனிருந்து அறிதி என்று * வெள்கிப் போயென்னுள்ளே நான் * விலவறச் சிரித்திட்டேனே! ",
            35: "தாவியன்று உலகமெல்லாம் * தலைவிளாக் கொண்ட எந்தாய் * சேவியேன் உன்னை அல்லால் * சிக்கெனச் செங்கண் மாலே *** ஆவியே! அமுதே! என்தன் * ஆருயிர் அனைய எந்தாய் * பாவியேன் உன்னை அல்லால் * பாவியேன் பாவியேனே. ",
            36: "மழைக்கன்று வரை முனேந்தும் * மைந்தனே!மதுர வாறே * உழைக்கன்றே போல நோக்கம் * உடையவர் வலையுள் பட்டு *** உழைக்கின்றேற்கு என்னை நோக்காது * ஒழிவதேஉன்னை அன்றே * அழைக்கின்றேன் ஆதி மூர்த்தி! * அரங்கமா நகரு ளானே! ",
            37: "தெளிவிலாக் கலங்கல் நீர்சூழ் * திருவரங்கங்கத்துள் ஓங்கும் * ஒளியுளார் தாமே அன்றே * தந்தையும் தாயும் ஆவார் *** எளியதோர் அருளும் அன்றே * என்திறத்து எம்பிரானார் * அளியன்நம் பையல் என்னார் * அம்மவோ கொடிய வாறே! ",
            38: "மேம்பொருள் போக விட்டு * மெய்ம்மையை மிக உணர்ந்து * ஆம்பரிசறிந்து கொண்டு * ஐம்புலன் அகத்தடக்கி *** காம்புறத் தலை சிரைத்துன் * கடைத்தலை யிருந்துவாழும் * சோம்பரை உகத்தி போலும் * சூழ்புனல் அரங்கத் தானே! ",
            39: "அடிமையில் குடிமை இல்லா * அயல் சதுப்பேதி மாரில் * குடிமையில் கடைமை பட்ட * குக்கரில் பிறப்ப ரேலும் *** முடியினில் துளபம் வைத்தாய்! * மொய்கழற்கு அன்பு செய்யும் * அடியரை உகத்தி போலும் * அரங்கமா நகரு ளானே! ",
            40: "திருமறு மார்வ! நின்னைச் * சிந்தையுள் திகழ வைத்து * மருவிய மனத்தராகில் *** மாநிலத்து உயிர்களெல்லாம் * வெருவரக் கொன்று சுட்டிட்டு ஈட்டிய வினைய ரேலும் * அருவினைப் பயனது உய்யார் * அரங்கமா நகரு ளானே! ",
            41: "வானுளார் அறியலாகா * வானவா! என்பர் ஆகில் * தேனுலாந் துளப மாலைச் * சென்னியாய்! என்பர் ஆகில் *** ஊனமாயினகள் செய்யும் * ஊனகாரகர்களேலும் * போனகம் செய்த சேடம் * தருவரேல் புனித மன்றே? ",
            42: "பழுதிலா ஒழுகல் ஆற்றுப் * பலசதுப் பேதி மார்கள் * இழிகுலத்தவர்களேலும் * எம் அடியார்களாகில் *** தொழுமினீர் கொடுமின் கொள்மின்! * என்றுநிந்னோடு ஒக்க * வழிபட அருளினாய் போல் * மதிள் திருவரங்கத் தானே! ",
            43: "அமரவோர் அங்கமாறும் * வேதமோர் நான்கும் ஓதி * தமர்களில் தலைவ ராய * சாதி அந்தணர்களேலும் *** நுமர்களைப் பழிப்ப ராகில் * நொடிப்பதோர் அளவில் * ஆங்கேஅவர்கள்தாம் புலையர் போலும் * அரங்கமா நகரு ளானே! ",
            44: "பெண்ணுலாம் சடையினானும் * பிரமனும் உன்னைக் காண்பான் * எண்ணிலா வூழி யூழி * தவஞ்செய்தார் வெள்கி நிற்ப *** விண்ணுளார் வியப்ப வந்து * ஆனைக்கு அன்று அருளை ஈந்தகண்ணறா * உன்னை யென்னோ * களைகணாக் கருது மாறே! ",
            45: "வளவெழும் தவள மாட * மதுரைமா நகரந் தன்னுள் * கவளமால் யானை கொன்ற * கண்ணனை அரங்க மாலை *** துவளத் தொண்டாய தொல்சீர்த் * தொண்டரடிப்பொடி சொல் * இளையபுன் கவிதை யேலும் * எம்பிறார் கினிய வாறே! தொண்டரடிப்பொடி ஆழ்வார் திருவடிகளே சரணம்.",
        },
    };

    // Non-destructive runtime merging engine
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};



