window.MARKER_DATABASE = window.MARKER_DATABASE || {};
// Global function to trigger the merge on-demand
window.mergeLanguageTexts = function () {
    const text_bundle_ta = {
        'URM.0.steps': {
            1: "முன்னம் திருவாய்மொழிப்பிள்ளை தாம் உபதேசித்த * நேர் தன்னின் படியைத் தணவாத சொல் மணவாள முனி *** தன் அன்புடன் செய் உபதேச ரத்தின மாலை தன்னைத் * தன் நெஞ்சு தன்னில் தரிப்பவர் தாள்கள் சரண் நமக்கே *"
        },
        'URM.1.steps': {
            1: "எந்தை திருவாய்மொழிப் பிள்ளை இன்னருளால் * வந்த உபதேச மார்க்கத்தைச் சிந்தை செய்து *** பின்னவரும் கற்க * உபதேசமாய்ப் பேசுகிறேன் * மன்னிய சீர் வெண்பாவில் வைத்து *",
            2: "கற்றோர்கள் தாம் உகப்பர் * கல்வி தன்னில் ஆசை உள்ளோர் * பெற்றோம் என உகந்து பின்பு கற்பர் *** மற்றோர்கள் மாச்சரியத்தால் * இகழில் வந்ததென் நெஞ்சே * இகழ்கை ஆச்சர்யமோ தான் அவர்க்கு *",
            3: "ஆழ்வார்கள் வாழி * அருளிச்செயல் வாழி * தாழ்வாதுமில் குரவர் தாம் வாழி *** ஏழ் பாரும் உய்ய * அவர்கள் உரைத்தவைகள் தாம் வாழி * செய்ய மறை தன்னுடனே சேர்ந்து *",
            4: "பொய்கையார் பூதத்தார் பேயார் * புகழ் மழிசை ஐயன் * அருள் மாறன் சேரலர் கோன் *** துய்ய பட்ட நாதன் அன்பர் தாள் தூளி * நற்பாணன் நற்கலியன் * ஈதிவர் தோற்றத்து அடைவாம் இங்கு *",
            5: "அந்தமிழால் நற்கலைகள் * ஆய்ந்துரைத்த ஆழ்வார்கள் * இந்த உலகில் இருள் நீங்க *** வந்துதித்த மாதங்கள் நாள்கள் தம்மை * மண்ணுலகோர் தாம் அறிய * ஈதென்று சொல்லுவோம் யாம் *",
            6: "ஐப்பசியில் ஓணம் * அவிட்டம் சதயம் இவை * ஒப்பிலவா நாள்கள் உலகத்தீர் *** எப்புவியும் பேசு புகழ்ப் * பொய்கையார் பூதத்தார் பேயாழ்வார் * தேசுடனே தோன்று சிறப்பால் *",
            7: "மற்றுள்ள ஆழ்வார்களுக்கு * முன்னே வந்துதித்து * நற்றமிழால் நூல் செய்து நாட்டை உய்த்த *** பெற்றிமையோர் என்று * முதல் ஆழ்வார்கள் என்னும் பெயர் இவர்க்கு * நின்றதுலகத்தே நிகழ்ந்து *",
            8: "பேதை நெஞ்சே * இன்றைப் பெருமை அறிந்திலையோ * ஏது பெருமை இன்றைக்கு என்னேன்னில் *** ஓதுகின்றேன் வாய்த்த புகழ் மங்கையர்கோன் * மாநிலத்தில் வந்துதித்த * கார்த்திகையில் கார்த்திகை நாள் காண் *",
            9: "மாறன் பணித்த * தமிழ் மறைக்கு * மங்கையர் கோன் ஆறங்கம் கூற அவதரித்த *** வீறுடைய கார்த்திகையில் கார்த்திகை நாள் * இன்றென்று காதலிப்பார் * வாய்த்த மலர்த் தாள்கள் நெஞ்சே வாழ்த்து *",
            10: "கார்த்திகையில் ரோகிணி நாள் * காண்மின் இன்று காசினியீர் * வாய்த்த புகழ்ப் பாணர் வந்துதிப்பால் *** ஆத்தியர்கள் அன்புடனே தான் * அமலனாதிபிரான் கற்றதற்பின் * நன்குடனே கொண்டாடும் நாள் *",
            11: "மன்னிய சீர் மார்கழியில் கேட்டை இன்று மாநிலத்தீர் என்னிதனுக்கு ஏற்றம் எனில் உரைக்கேன் *** துன்னு புகழ் மாமறையோன் தொண்டரடிப்பொடி ஆழ்வார் பிறப்பால் நான்மறையோர் கொண்டாடும் நாள் *",
            12: "தையில் மகம் இன்று தாரணியீர் ஏற்றம் இந்தத் தையில் மகத்துக்குச் சாற்றுகின்றேன் *** துய்ய மதி பெற்ற மழிசைப் பிரான் பிறந்த நாள் என்று நற்றவர்கள் கொண்டாடும் நாள் *",
            13: "மாசிப் புனர்பூசம் காண்மின் இன்று மண்ணுலகீர் தேசு இத்திவசத்துக்கு ஏதென்னில் *** பேசுகின்றேன் கொல்லி நகர்க் கோன் குலசேகரன் பிறப்பால் நல்லவர்கள் கொண்டாடும் நாள் *",
            14: "ஏரார் வைகாசி விசாகத்தின் ஏற்றத்தைப் பாரோர் அறியப் பகர்கின்றேன் *** சீராரும் வேதம் தமிழ் செய்த மெய்யன் எழில் குருகை நாதன் அவதரித்த நாள் *",
            15: "உண்டோ வைகாசி விசாகத்துக்கு ஒப்பொரு நாள் உண்டோ சடகோபர்க்கு ஒப்பொருவர் *** உண்டோ திருவாய்மொழிக்கு ஒப்பு தென் குருகைக்கு உண்டோ ஒரு பார் தனில் ஒக்கும் ஊர் *",
            16: "இன்றைப் பெருமை அறிந்திலையோ ஏழை நெஞ்சே இன்றைக்கு என் ஏற்றம் எனில் உரைக்கேன் *** நன்றி புனை பல்லாண்டு பாடிய நம் பட்டர் பிரான் வந்துதித்த நல்லானியில் சோதி நாள் *",
            17: "மாநிலத்தில் முன் நம் பெரியாழ்வார் வந்துதித்த ஆனி தன்னில் சோதி என்றால் ஆதரிக்கும் *** ஞானியர்க்கு ஒப்போர் இல்லை இவ்வுலகு தனில் என்று நெஞ்சே எப்பொழுதும் சிந்தித்திரு *",
            18: "மங்களாசாசனத்தில் மற்றுள்ள ஆழ்வார்கள் தங்கள் ஆர்வத்தளவு தான் அன்றி *** பொங்கும் பரிவாலே வில்லிபுத்தூர் பட்டர் பிரான் பெற்றான் பெரியாழ்வார் என்னும் பெயர் *",
            19: "கோதிலவாம் ஆழ்வார்கள் கூறு கலைக்கெல்லாம் ஆதி திருப்பல்லாண்டு ஆனதுவும் *** வேதத்துக்கு ஓம் என்னும் அது போல் உள்ளதுக்கெல்லாம் சுருக்காய்த் தான் மங்கலம் ஆதலால் *",
            20: "உண்டோ திருப்பல்லாண்டுக்கு ஒப்பதோர் கலை தான் உண்டோ பெரியாழ்வார்க்கு ஒப்பொருவர் *** தண் தமிழ் நூல் செய்தருளும் ஆழ்வார்கள் தம்மில் அவர் செய் கலையில் பைதல் நெஞ்சே நீ உணர்ந்து பார் *",
            21: "ஆழ்வார் திருமகளார் ஆண்டாள் மதுரகவி ஆழ்வார் எதிராசராம் இவர்கள் *** வாழ்வாக வந்துதித்த மாதங்கள் நாள்கள் தம்மின் வாசியையும் இந்த உலகோர்க்கு உரைப்போம் யாம் *",
            22: "இன்றோ திருவாடிப்பூரம் எமக்காக அன்றோ இங்கு ஆண்டாள் அவதரித்தாள் *** குன்றாத வாழ்வான வைகுந்த வான் போகம் தன்னை இகழ்ந்து ஆழ்வார் திருமகளாராய் *",
            23: "பெரியாழ்வார் பெண் பிள்ளையாய் ஆண்டாள் பிறந்த திருவாடிப் பூரத்தின் சீர்மை *** ஒரு நாளைக்கு உண்டோ மனமே உணர்ந்து பார் ஆண்டாளுக்கு உண்டாகில் ஒப்பிதற்கும் உண்டு *",
            24: "அஞ்சு குடிக்கு ஒரு சந்ததியாய் ஆழ்வார்கள் தம் செயலை விஞ்சி நிற்கும் தன்மையளாய் *** பிஞ்சாய்ப் பழுத்தாளை ஆண்டாளைப் பத்தியுடன் நாளும் வழுத்தாய் மனமே மகிழ்ந்து *",
            25: "ஏரார் மதுரகவி இவ்வுலகில் வந்துதித்த சீராரும் சித்திரையில் சித்திரை நாள் *** பாருலகில் மற்றுள்ள ஆழ்வார்கள் வந்துதித்த நாள்களிலும் உற்றதெமக்கென்று நெஞ்சே ஓர் *",
            26: "வாய்த்த திருமந்திரத்தின் மத்திமமாம் பதம் போல் சீர்த்த மதுரகவி செய் கலையை *** ஆர்த்த புகழ் ஆரியர்கள் தாங்கள் அருளிச்செயல் நடுவே சேர்வித்தார் தாற்பரியம் தேர்ந்து *",
            27: "இன்றுலகீர் சித்திரையில் ஏய்ந்த திருவாதிரை நாள் என்றையினும் இன்று இதனுக்கு ஏற்றம் என் தான் *** என்றவர்க்குச் சாற்றுகின்றேன் கேண்மின் எதிராசர் தம் பிறப்பால் நாற்றிசையும் கொண்டாடும் நாள் *",
            28: "ஆழ்வார்கள் தாங்கள் அவதரித்த நாள்களிலும் வாழ்வான நாள் நமக்கு மண்ணுலகீர் *** ஏழ் பாரும் உய்ய எதிராசர் உதித்தருளும் சித்திரையில் செய்ய திருவாதிரை *",
            29: "எந்தை எதிராசர் இவ்வுலகில் எந்தமக்கா வந்துதித்த நாள் என்னும் வாசியினால் *** இந்தத் திருவாதிரை தன்னின் சீர்மை தனை நெஞ்சே ஒருவாமல் எப்பொழுதும் ஓர் *",
            30: "எண்ணரும் சீர்ப் பொய்கை முன்னோர் இவ்வுலகில் தோன்றிய ஊர் வண்மை மிகு கச்சி மல்லை மாமயிலை *** மண்ணியில் நீர் தேங்கும் குறையலூர் சீர்க் கலியன் தோன்றிய ஊர் ஓங்கும் உறையூர் பாணன் ஊர் *",
            31: "தொண்டரடிபொடியார் தோன்றிய ஊர் தொல் புகழ் சேர் மண்டங்குடி என்பர் மண்ணுலகில் *** எண்டிசையும் ஏத்தும் குலசேகரன் ஊர் என உரைப்பர் வாய்த்த திருவஞ்சிக்களம் *",
            32: "மன்னு திருமழிசை மாடத் திருகுருகூர் மின்னு புகழ் வில்லிபுத்தூர் மேதினியில் *** நன்னெறியோர் ஏய்ந்த பத்திசாரர் எழில் மாறன் பட்டர் பிரான் வாய்ந்துதித்த ஊர்கள் வகை *",
            33: "சீராரும் வில்லிபுத்தூர் செல்வத் திருக்கோளூர் ஏரார் பெரும்பூதூர் என்னும் இவை *** பாரில் மதியாரும் ஆண்டாள் மதுரகவி ஆழ்வார் எதிராசர் தோன்றிய ஊர் இங்கு *",
            34: "ஆழ்வார்கள் ஏற்றம் அருளிச் செயல் ஏற்றம் தாழ்வாதும் இன்றி அவை தாம் வளர்த்தோர் *** ஏழ் பாரும் உய்ய அவர்கள் செய்த வியாக்கியைகள் உள்ளதெல்லாம் வையம் அறியப் பகர்வோம் வாய்ந்து *",
            35: "ஆழ்வார்களையும் அருளிச் செயல்களையும் தாழ்வா நினைப்பவர்கள் தாம் நரகில் வீழ்வார்கள் என்று நினைத்து நெஞ்சே எப்பொழுதும் நீ அவர் பால் சென்றணுகக் கூசித் திரி *",
            36: "தெருளுற்ற ஆழ்வார்கள் சீர்மை அறிவாரார் அருளிச் செயலை அறிவாரார் *** அருள் பெற்ற நாதமுனி முதலாம் நம் தேசிகரை அல்லால் பேதை மனமே உண்டோ பேசு *",
            37: "ஓராண் வழியாய் உபதேசித்தார் முன்னோர் ஏரார் எதிராசர் இன்னருளால் *** பாருலகில் ஆசை உடையோர்க்கெல்லாம் ஆரியர்காள் கூறும் என்று பேசி வரம்பறுத்தார் பின் *",
            38: "எம்பெருமானார் தரிசனம் என்றே இதற்கு நம்பெருமாள் பேரிட்டு நாட்டி வைத்தார் *** அம்புவியோர் இந்தத் தரிசனத்தை எம்பெருமானார் வளர்த்த அந்தச் செயல் அறிகைக்கா *",
            39: "பிள்ளான் நஞ்சீயர் பெரியவாச்சான் பிள்ளை தெள்ளார் வடக்குத் திருவீதிப் பிள்ளை மணவாள யோகி திருவாய்மொழியைக் காத்த குணவாளர் என்று நெஞ்சே கூறு *",
            40: "முந்துறவே பிள்ளான் முதலானோர் செய்தருளும் அந்த வியாக்கியைகள் அன்றாகில் *** அந்தோ திருவாய்மொழிப் பொருளைத் தேர்ந்துரைக்க வல்ல குருவார் இக்காலம் நெஞ்சே கூறு *",
            41: "தெள்ளாரும் ஞானத் திருக்குருகைப் பிரான் பிள்ளான் எதிராசர் பேரருளால் *** உள்ளாரும் அன்புடனே மாறன் மறைப் பொருளை அன்றுரைத்தது இன்ப மிகு ஆறாயிரம் *",
            42: "தன் சீரை ஞானியர்கள் தாம் புகழும் வேதாந்தி நஞ்சீயர் தாம் பட்டர் நல்லருளால் *** எஞ்சாத ஆர்வமுடன் மாறன் மறைப் பொருளை ஆய்ந்த்ரைத்தது ஏர் ஒன்பதினாயிரம் *",
            43: "நம்பிள்ளை தம்முடைய நல்லருளால் ஏவியிட பின் பெரியவாச்சான் பிள்ளை அதனால் *** இன்பா வருபத்தி மாறன் மறைப் பொருளைச் சொன்னது இருபத்து நாலாயிரம் *",
            44: "தெள்ளியதா நம்பிள்ளை செப்பு நெறி தன்னை வள்ளல் வடக்குத் திருவீதிப் பிள்ளை *** இந்த நாடறிய மாறன் மறைப் பொருளை நன்குரைத்தது ஈடு முப்பத்தாறயிரம் *",
            45: "அன்போடு அழகிய மணவாளச் சீயர் பின்போரும் கற்றறிந்து பேசுகைக்கா *** தம் பெரிய போதமுடன் மாறன் மறையின் பொருள் உரைத்தது ஏதமில் பன்னீராயிரம் *",
            46: "பெரியவாச்சான் பிள்ளை பின்புள்ளவைக்கும் தெரிய வியாக்கியைகள் செய்வால் *** அரிய அருளிச் செயல் பொருளை ஆரியர்கட்கு இப்போது அருளிச் செயலாய்த்தறிந்து *",
            47: "நஞ்சீயர் செய்த வியக்கியைகள் நாலிரண்டுக்கு எஞ்சாமை யாவைக்கும் இல்லையே *** தம் சீரால் வைய குருவின் தம்பி மன்னு மணவாள முனி செய்யுமவை தாமும் சில *",
            48: "சீரார் வடக்குத் திருவீதிப் பிள்ளை எழுது ஏரார் தமிழ் வேதத்து ஈடு தனை *** தாரும் என வாங்கி முன் நம்பிள்ளை ஈயுண்ணி மாதவர்க்குத் தாம் கொடுத்தார் பின் அதனைத் தான் *",
            49: "ஆங்கவர் பால் பெற்ற சிறியாழ்வான் அப்பிள்ளை தாம் கொடுத்தார் தம் மகனார் தம் கையில் *** பாங்குடனே நாலூர் பிள்ளைக்கு அவர் தாம் நல்ல மகனார்க்கு அவர் தாம் மேலோர்க்கு ஈந்தார் அவரே மிக்கு *",
            50: "நம்பெருமாள் நம்மாழ்வார் நஞ்சீயர் நம்பிள்ளை என்பர் அவரவர் தம் ஏற்றத்தால் *** அன்புடையோர் சாற்று திருநாமங்கள் தான் என்று நன்னெஞ்சே ஏத்ததனைச் சொல்லு நீ இன்று *",
            51: "துன்னு புகழ்க் கந்தாடை தோழப்பர் தம் உகப்பால் என்ன உலகாரியனோ என்றுரைக்கப் *** பின்னை உலகாரியன் என்னும் பேர் நம்பிள்ளைக்கு ஓங்கி விலகாமல் நின்றதென்றும் மேல் *",
            52: "பின்னை வடக்குத் திருவீதிப் பிள்ளை அன்பால் அன்ன திருநாமத்தை ஆதரித்து *** மன்னு புகழ் மைந்தர்க்குச் சாற்றுகையால் வந்து பரந்தது எங்கும் இந்தத் திருநாமம் இங்கு *",
            53: "அன்ன புகழ் முடும்பை அண்ணல் உலகாசிரியன் இன்னருளால் செய்த கலை யாவையிலும் *** உன்னில் திகழ் வசன பூடணத்தின் சீர்மை ஒன்றுக்கில்லை புகழல்ல இவ்வார்த்தை மெய் இப்போது *",
            54: "முன்னம் குரவோர் மொழிந்த வசனன்கள் தன்னை மிகக் கொண்டு கற்றோர் தம் உயிர்க்கு *** மின்னணியாச் சேரச் சமைத்தவரே சீர் வசன பூடணமென்னும் பேர் இக்கலைக்கு இட்டார் பின் *",
            55: "ஆர் வசன பூடணத்தின் ஆழ் பொருள் எல்லாம் அறிவார் ஆரது சொல் நேரில் அனுட்டிப்பார் *** ஓரொருவர் உண்டாகில் அத்தனை காண் உள்ளமே எல்லார்க்கும் அண்டாததன்றோ அது *",
            56: "உய்ய நினைவுடையீர் உங்களுக்குச் சொல்லுகின்றேன் வைய குரு முன்னம் வாய் மொழிந்த *** செய்ய கலையாம் வசன பூடணத்தின் ஆழ்பொருளை கற்றதனுக்காம் நிலையில் நில்லும் அறிந்து *",
            57: "தேசிகர் பால் கேட்ட செழும் பொருளைச் சிந்தை தன்னில் மாசறவே ஊன்ற மனனம் செய்து *** ஆசரிக்க வல்லார்கள் தாம் வசன பூடணத்தின் வான் பொருளைக் கல்லாததென்னோ கவர்ந்து *",
            58: "சச்சம்பிரதாயம் தாம் உடையோர் கேட்டக்கால் மெச்சும் வியாக்கியைகள் உண்டாகில் *** நச்சி அதிகரியும் நீர் வசன பூடணத்துக்கற்ற மதியுடையீர் மத்தியத்தராய் *",
            59: "சீர் வசன பூடணத்தின் செம்பொருளைச் சிந்தை தன்னால் தேரிலுமாம் வாய் கொண்டு செப்பிலுமாம் *** ஆரியர்காள் என்தனக்கு நாளும் இனிதாக நின்றதையோ உன்தமக்கு எவ்வின்பம் உளதாம் *",
            60: "தன் குருவின் தாளிணைகள் தன்னில் அன்பு ஒன்றில்லாதார் அன்பு தன் பால் செய்தாலும் அம்புயைகோன் *** இன்ப மிகு விண்ணாடு தான் அளிக்க வேண்டியிரான் ஆதலால் நண்ணார் அவர்கள் திருநாடு *",
            61: "ஞானம் அனுட்டானம் இவை நன்றாகவே உடையனான குருவை அடைந்தக்கால் *** மாநிலத்தீர் தேனார் கமலத் திருமாமகள் கொழுனன் தானே வைகுந்தம் தரும் *",
            62: "உய்ய நினைவுண்டாகில் உம் குருக்கள் தம் பதத்தே வையும் அன்பு தன்னை இந்த மாநிலத்தீர் *** மெய் உரைக்கேன் பையரவில் மாயன் பரம பதம் உங்களுக்காம் கை இலங்கு நெல்லிக் கனி *",
            63: "ஆசாரியன் செய்த உபகாரமானவது தூய்தாக நெஞ்சு தன்னில் தோன்றுமேல் *** தேசாந்தரத்தில் இருக்க மனம் தான் பொருந்த மாட்டாது இருத்தல் இனி ஏதறியோம் யாம் *",
            64: "தன் ஆரியனுக்குத் தான் அடிமை செய்வது அவன் இந்நாடு தன்னில் இருக்கும் நாள் *** அந்நேர் அறிந்தும் அதில் ஆசை இன்றி ஆசாரியனைப் பிரிந்திருபார் ஆர் மனமே பேசு *",
            65: "ஆசாரியன் சிச்சன் ஆருயிரைப் பேணுமவன் தேசாரும் சிச்சன் அவன் சீர் வடிவை *** ஆசையுடன் நோக்குமவன் என்னும் நுண்ணறிவைக் கேட்டு வைத்தும் ஆர்க்கும் அந்நேர் நிற்கை அரிதாம் *",
            66: "பின்பழகராம் பெருமாள் சீயர் பெருந்திவத்தில் அன்பதுவும் அற்று மிக்க ஆசையினால் *** நம்பிள்ளைக்கான அடிமைகள் செய் அந்நிலையை நன்னெஞ்சே ஊனமற எப்பொழுதும் ஓர் *",
            67: "ஆசாரியர்கள் அனைவரும் முன் ஆசரித்த ஆசாரம் தன்னை அறியாதார் *** பேசுகின்ற வார்த்தைகளைக் கேட்டு மருளாதே பூருவர்கள் சீர்த்த நிலை தன்னை நெஞ்சே சேர் *",
            68: "நாத்திகரும் நற்கலையின் நன்னெறி சேர் ஆத்திகரும் ஆத்திக நாத்திகருமாம் இவரை *** ஓர்த்து நெஞ்சே முன்னவரும் பின்னவரும் மூர்க்கர் என விட்டு நடுச் சொன்னவரை நாளும் தொடர் *",
            69: "நல்ல மனம் உள்ளதொன்றை நண்ணி இருப்பதற்கு நல்ல மணம் உண்டாம் நலம் அது போல் *** நல்ல குணம் உடையோர் தங்களுடன் கூடி இருப்பார்க்குக் குணம் அதுவேயாம் சேர்த்தி கொண்டு *",
            70: "தீய கந்தம் உள்ளதொன்றைச் சேர்ந்து இருப்பதொன்றுக்குத் தீய கந்தம் ஏறும் திறம் அது போல் *** தீய குணம் உடையோர் தங்களுடன் கூடி இருப்பார்க்குக் குணம் அதுவேயாம் செறிவு கொண்டு *",
            71: "முன்னோர் மொழிந்த * முறை தப்பாமல் கேட்டு * பின்னோர்ந்து தாம் அதனைப் பேசாதே *** தன் நெஞ்சில் தோற்றினதே சொல்லி * இது சுத்த உபதேசவர வாற்றதென்பர் * மூர்க்கர் ஆவார் *",
            72: "பூருவாசாரியர்கள் * போதம் அனுட்டானங்கள் * கூறுவார் வார்த்தைகளைக் கொண்டு நீர் தேறி *** இருள் தருமா ஞாலத்தே * இன்பம் உற்று வாழும் * தெருள் தருமா தேசிகனைச் சேர்ந்து *",
            73: "இந்த உபதேச * ரத்தின மாலை தன்னைச் * சிந்தை தன்னில் நாளும் சிந்திப்பார் *** எந்தை எதிராசர் * இன்னருளுக்கு என்றும் இலக்காகிச் * சதிராக வாழ்ந்திடுவார் தாம் *",
            74: "மன்னுயிர்காள் இங்கே * மணவாள மாமுனிவன் * பொன்னடியாம் செங்கமலப் போதுகளை *** உன்னிச் சிரத்தாலே தீண்டில் * அமானவனும் நம்மைக் * கரத்தாலே தீண்டல் கடன் *"
        },
    };
    // Non-destructive runtime merging engine
    for (const key in text_bundle_ta) {
        window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
        for (const p in text_bundle_ta[key]) {
            const idx = parseInt(p) - 1;
            window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
            window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
            window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
        }
    }
};