window.MARKER_DATABASE = window.MARKER_DATABASE || {};
// Global function to trigger the merge ondemand
window.mergeLanguageTexts = function () {
  const text_bundle_ta = {
    '4TA.0.steps': {
      1: "சீராமப்பிள்ளை அருளிச்செய்தது: நாரயணன் படைத்தான் நான்முகனை * நான்முகனுக்கு ஏரார் சிவன்பிறந்தான் என்னும் சொல் * சீரார் மொழி செப்பி வாழலாம் நெஞ்சமே * மொய்பூமழிசைப் பரனடியே வாழ்த்து"
    },
    '4TA.1.steps': {

      1: "🙏 நான்முகனை * நாராயணன் படைத்தான் * நான்முகனும் தான் முகமாய்ச் * சங்கரனைத் தான் படைத்தான் *** யான் முகமாய் அந்தாதி மேலிட்டு * அறிவித்தேன் ஆழ்பொருளை * சிந்தாமல் கொண்மினீர் தேர்ந்து",
      2: "தேருங்கால் தேவன் * ஒருவனே என்றுரைப்பர் * ஆருமறியார் அவன் பெருமை *** ஓரும் பொருள் முடிவும் இத்தனையே * எத்தவம் செய்தார்க்கும் * அருள் முடிவது ஆழியான் பால்",
      3: "பாலில் கிடந்ததுவும் * பண்டரங்கம் மேயதுவும் * ஆலில் துயின்றதுவும் ஆரறிவார் *** ஞாலத்து ஒரு பொருளை * வானவர் தம் மெய்ப்பொருளை * அப்பில் அருபொருளை யானறிந்தவாறு?",
      4: "ஆறு சடைக்கரந்தான் * அண்டர்கோன் தன்னோடும் * கூறுடையன் என்பதுவும் கொள்கைத்தே *** வேறொருவர் இல்லாமை * நின்றானை எம்மானை * எப்பொருட்கும் சொல்லானைச் சொன்னேன் தொகுத்து",
      5: "தொகுத்த வரத்தனாய்த் * தோலாதான் மார்வம் * வகிர்த்தவளை உகிர்த்தோள் மாலே *** உகத்தில் ஒரு நான்று நீயுயர்த்தி * உள்வாங்கி நீயே * அருநான்கும் ஆனாய் அறி",
      6: "அறியார் சமணர் * அயர்த்தார் பவுத்தர் * சிறியார் சிவப்பட்டார் செப்பில் *** வெறியாய மாயவனை மாலவனை * மாதவனை ஏத்தாதார் * ஈனவரே ஆதலால் இன்று.",
      7: "இன்றாக * நாளையேயாக * இனிச்சிறிதும் நின்றாக * நின்னருள் என் பாலதே *** நன்றாக நான் உன்னை * அன்றி இலேன் கண்டாய் * நாரணனே நீயென்னை அன்றியிலை",
      8: "இலைதுணை மற்றென்னெஞ்சே * ஈசனை வென்ற * சிலை கொண்ட செங்கண்மால் சேரா *** குலை கொண்ட ஈரைந்தலையான் * இலங்கையை ஈடழித்த * கூரம்பன் அல்லால் குறை",
      9: "குறை கொண்டு நான்முகன் * குண்டிகை நீர் பெய்து * மறை கொண்ட மந்திரத்தால் வாழ்த்தி *** கறை கொண்ட கண்டத்தான் * சென்னி மேல் ஏறக் கழுவினான் * அண்டத்தான் சேவடியை ஆங்கு",
      10: "ஆங்காரவாரம் * அது கேட்டு * அழலுமிழும் பூங்கார் அரவணையான் பொன்மேனி *** யாம்காண வல்லமே அல்லமே? * மாமலரான் வார்சடையான் * வல்லரே அல்லரே? வாழ்த்து",
      11: "வாழ்த்துக வாய் * காண்க கண் கேட்க செவி * மகுடம் தாழ்த்தி * வணங்குமின்கள் தண்மலரால் *** சூழ்த்த துழாய் மன்னு நீள் முடி * என் தொல்லைமால் தன்னை * வழாவண்கை கூப்பி மதித்து",
      12: "மதித்தாய் போய் நான்கின் * மதியார் போய் வீழ * மதித்தாய் மதிகோள் விடுத்தாய் *** மதித்தாய் மடுக்கிடந்த * மாமுதலை கோள்விடுப்பான் * ஆழிவிடற்கிரண்டும் போய் இரண்டின் வீடு",
      13: "வீடாக்கும் * பெற்றியறியாது * மெய்வருத்திக் கூடாக்கி * நின்றுண்டு கொண்டுழல்வீர் *** வீடாக்கும் மெய்ப்பொருள்தான் * வேத முதற்பொருள்தான் * விண்ணவர்க்கு நற்பொருள் தான் நாராயணன்",
      14: "நாராயணன் * என்னையாளி * நரகத்துச் சேராமல் * காக்கும் திருமால் *** தன்பேரான பேசப்பெறாத * பிணச்சமயர் பேசக்கேட்டு * ஆசைப்பட்டு ஆழ்வார் பலர்",
      15: "பலதேவரேத்தப் * படிகடந்தான் பாதம் * மலரேற விட்டிறைஞ்சி வாழ்த்த வலராகில் *** மார்க்கண்டன் கண்ட வகையே * வருங்கண்டீர் * நீர்க்கண்டன் கண்ட நிலை",
      16: "நிலைமன்னும் என்னெஞ்சம் * அந்நான்று * தேவர் தலைமன்னர் * தாமே மாற்றாக *** பல மன்னர் போர்மாள * வெங்கதிரோன் மாயப் பொழில்மறைய * தேராழியால் மறைத்தாரால்",
      17: "ஆலநிழற் கீழ் * அறநெறியை * நால்வர்க்கு மேலையுகத்துரைத்தான் * மெய்த்தவத்தோன் *** ஞாலம் அளந்தானை * ஆழிக் கிடந்தானை * ஆல்மேல் வளர்ந்தானைத் தான் வணங்குமாறு",
      18: "மாறாய தானவனை * வள்ளுகிரால் * மார்விரண்டு கூறாகக் * கீறிய கோளரியை *** வேறாக ஏத்தியிருப்பாரை * வெல்லுமே * மற்றவரை சார்த்தி இருப்பார் தவம்",
      19: "தவம் செய்து * நான்முகனால் பெற்ற வரத்தை * அவம் செய்த ஆழியாயன்றே *** உவந்து எம்மைக் காப்பாய் நீ * காப்பதனை ஆவாய் நீ * வைகுந்தம் ஈப்பாயும் எவ்வுயிர்க்கும் நீ",
      20: "நீயே உலகெலாம் * நின்னருளே நிற்பனவும் * நீயே தவத்தேவ தேவனும் *** நீயே எரிசுடரும் மால்வரையும் * எண்திசையும் * அண்டத்து இருசுடருமாய இவை",
      21: "இவையா! பிலவாய் * திறந்தெரி கான்ற * இவையா! எரிவட்டக் கண்கள் *** இவையா எரிபொங்கிக் காட்டும் * இமையோர் பெருமான் * அரிபொங்கிக் காட்டும் அழகு?",
      22: "அழகியான் தானே * அரியுருவன் தானே * பழகியான் தாளே பணிமின் *** குழவியாய்த் தான் ஏழுலகுக்கும் * தன்கைக்கும் தன்மையனே * மீனாய் உயிரளிக்கும் வித்து",
      23: "வித்துமிட வேண்டுங் கொல்லோ * விடையடர்த்த * பத்தி உழவன் பழம்புனத்து *** மொய்த்தெழுந்த கார்மேகமன்ன * கருமால் திருமேனி * நீர்வானம் காட்டும் நிகழ்ந்து.",
      24: "நிகழ்ந்தாய் * பால் பொன் பசுப்புக் * கார்வண்ணம் நான்கும் இகழ்ந்தாய் * இருவரையும் வீயப் புகழ்ந்தாய் *** சினப்போர்ச் சுவேதனைச் * சேனாபதியாய் * மனப்போர் முடிக்கும் வகை",
      25: "வகையால் மதியாது * மண்கொண்டாய் * மற்றும் வகையால் * வருவதொன்றுண்டே *** வகையால் வயிரம் குழைத்துண்ணும் * மாவலிதான் என்னும் * வயிர வழக்கொழித்தாய் மற்று",
      26: "மற்றுத் தொழுவார் * ஒருவரையும் யானின்மை * கற்றைச் சடையான் கரிக்கண்டாய் *** எற்றைக்கும் கண்டுகொள் கண்டாய் * கடல்வண்ணா * யான் உன்னைக் கண்டு கொள்கிற்குமாறு",
      27: "மால் தான் புகுந்த * மடநெஞ்சம் * மற்றதுவும் பேறாகக் * கொள்வேனா பேதைகாள் *** நீறாடி தான் காண மாட்டாத * தாரகலச் சேவடியை * யான் காண வல்லேற்கு இது",
      28: "இது இலங்கை ஈடழியக் * கட்டிய சேது * இது விலங்கு வாலியை வீழ்த்தது *** இது இலங்கை தானொடுங்க வில்நுடங்கத் * தண்தார் இராவணனை * ஊனொடுங்க எய்தான் உகப்பு.",
      29: "உகப்புருவன் தானே * ஒளியுருவன் தானே * மகப்புருவன் தானே மதிக்கில் *** மிகப்புருவம் ஒன்றுக்கொன்று * ஓசனையான் வீழ * ஒருகணையால் அன்றிக்கொண்டு எய்தான் அவன்.",
      30: "அவன் என்னையாளி * அரங்கத்து அரங்கில் * அவனென்னை எய்தாமல் காப்பான் *** அவன் என்னது உள்ளத்து * நின்றான் இருந்தான் கிடக்குமே * வெள்ளத்தரவணையின் மேல்.",
      31: "மேல் நான்முகன் * அரனையிட்ட விடு சாபம் * தான் நாரணன் ஒழித்தான் தாரகையுள் *** வானோர் பெருமானை * ஏத்தாத பேய்காள் * பிறக்கும் கருமாயம் பேசின் கதை",
      32: "கதைப் பொருள் தான் * கண்ணன் திருவயிற்றின் உள்ள * உதைப்பளவு போதுபோக்கு இன்றி *** வதைப் பொருள்தான் வாய்ந்த குணத்துப் * படாதது அடைமினோ * ஆய்ந்த குணத்தான் அடி",
      33: "அடிச்சகடம் சாடி * அரவாட்டி * யானை பிடித்தொசித்துப் * பேய்முலை நஞ்சுண்டு *** வடிப்பவள வாய்ப்பின்னை தோளுக்கா * வல்லேற்ற எருத்திறுத்து * கோப்பின்னுமானான் குறிப்பு.",
      34: "குறிப்பு எனக்குக் * கோட்டியூர் மேயானையேத்த * குறிப்பு எனக்கு நன்மை பயக்க *** வெறுப்பனோ வேங்கடத்து மேயானை * மெய்வினை நோய் எய்தாமல் * தான் கடத்தும் தன்மையான் தாள்",
      35: "🙏 தாளால் உலகம் * அளந்த அசைவேகொல் * வாளாகிடந்தருளும் வாய்திறவான் *** நீளோதம் வந்தலைக்கும் மாமயிலை * மாவல்லிக்கேணியான் * ஐந்தலைவாய் நாகத்தணை?",
      36: "🙏 நாகத்தணைக் குடந்தை * வெஃகா திருவெவ்வுள் * நாகத்தணை அரங்கம் பேரன்பில் *** நாகத்தணைப் பாற்கடல் கிடக்கும் * ஆதி நெடுமால் * அணைப்பார் கருத்தன் ஆவான்.",
      37: "வானுலவு தீவளி * மாகடல் மாபொருப்பு * தானுலவு வெங்கதிரும் தண்மதியும் *** மேனிலவு கொண்டல் பெயரும் * திசையெட்டும் சூழ்ச்சியும் * அண்டத் திருமால் அகைப்பு.",
      38: "அகைப்பில் மனிசரை * ஆறு சமயம் புகைத்தான் * பொருகடல்நீர் வண்ணன் *** உகைக்கு மேல் எத்தேவர் வாலாட்டும் * எவ்வாறு செய்கையும் * அப்போது ஒழியும் அழைப்பு.",
      39: "அழைப்பன் * திருவேங்கடத்தானைக் காண * இழைப்பன் * திருக்கூடல் கூட *** மழைப் பேரருவி * மணிவரன்றி வந்திழிய * யானை வெருவி அரவொடுங்கும் வெற்பு.",
      40: "வெற்பென்று * வேங்கடம் பாடினேன் * வீடாக்கி நிற்கின்றேன் * நின்று நினைக்கின்றேன் *** கற்கின்ற நூல்வலையில் பட்டிருந்த * நூலாட்டி கேள்வனார் * கால் வலையில் பட்டிருந்தேன் காண்.",
      41: "காணலுறுகின்றேன் * கல்லருவி முத்து உதிர * ஓண விழவில் ஒலியதிர *** பேணி வருவேங்கடவா! * என்னுள்ளம் புகுந்தாய் * திருவேங்கடம் அதனைச் சென்று.",
      42: "சென்று வணங்குமினோ * சேணுயர் வேங்கடத்தை * நின்று வினைகெடுக்கும் நீர்மையால் *** என்றும் கடிக்கமல நான்முகனும் * கண் மூன்றத்தானும் * அடிக்கமலம் இட்டேத்தும் அங்கு.",
      43: "மங்குல்தோய் சென்னி * வடவேங்கடத்தானை * கங்குல் புகுந்தார்கள் * காப்பணிவான் *** திங்கள் சடையேற வைத்தானும் * தாமரை மேலானும் * குடையேறத் தாம்குவித்துக் கொண்டு.",
      44: "கொண்டு குடங்கால் * மேல்வைத்த குழவியாய் * தண்ட அரக்கன் தலை தாளால் பண்டெண்ணி *** போம்குமரன் நிற்கும் * பொழில்வேங்கட மலைக்கே * போம் குமரருள்ளீர் புரிந்து.",
      45: "புரிந்து மலரிட்டுப் * புண்டரீகப் பாதம் * பரிந்து படுகாடு நிற்ப *** தெரிந்தெங்கும் தானோங்கி நிற்கின்றான் * தண்ணருவி வேங்கடமே * வானோர்க்கும் மண்ணோர்க்கும் வைப்பு.",
      46: "வைப்பன் மணிவிளக்கா * மாமதியை * மாலுக்கென்று எப்பொழுதும் * கைநீட்டும் யானையை *** எப்பாடும் வேடுவளைக்கக் * குறவர் வில்லெடுக்கும் வேங்கடமே * நாடுவளைத் தாடுமேல் நன்று.",
      47: "நன்மணி வண்ணனூர் * ஆளியும் கோளரியும் * பொன்மணியும் முத்தமும் பூமரமும் ** பன்மணி நீரோடு பொருதுருளும் * கானமும் வானரமும் * வேடுமுடை வேங்கடம்.",
      48: "வேங்கடமே * விண்ணோர் தொழுவதுவும் * மெய்ம்மையால் வேங்கடமே * மெய்வினைநோய் தீர்ப்பதுவும் *** வேங்கடமே தானவரை வீழத் * தன்னாழிப் படைதொட்டு * வானவரைக் காப்பான் மலை.",
      49: "மலையாமை மேல் வைத்து * வாசுகியைச் சுற்றி * தலையாமை தானொரு கை பற்றி *** அலையாமல் பீறக்கடைந்த * பெருமான் திருநாமம் * கூறுவதே யாவர்க்கும் கூற்று.",
      50: "கூற்றமும் சாரா * கொடுவினையும் சாரா * தீ மாற்றமும்  சாரா வகையறிந்தேன் *** ஆற்றங்கரை கிடக்கும் * கண்ணன் கடல்கிடக்கும் * மாயன் உரைக்கிடக்கும் உள்ளத்து எனக்கு.",
      51: "எனக்காவார் ஆரொருவரே * எம்பெருமான் தனக்காவான் * தானே மற்று அல்லால் *** புனக்காயா வண்ணனே * உன்னைப் பிறர் அறியார் * என்மதிக்கு விண்ணெல்லாம் உண்டோ விலை?",
      52: "விலைக்கு ஆட்படுவர் * விசாதியேற்றுண்பர் * தலைக்காட்பலி திரிவர் தக்கோர் *** முலைக்கால் விடமுண்ட வேந்தனையே * வேறா ஏத்தாதார் * கடம் உண்டார் கல்லாதவர்.",
      53: "கல்லாதவர் இலங்கை கட்டழித்த * காகுத்தன் அல்லால் * ஒரு தெய்வம் யானிலேன் *** பொல்லாத தேவரை * தேவர் அல்லாரை * திருவில்லாத் தேவரைத் தேறல்மின் தேவு.",
      54: "தேவராய் * நிற்கும் அத்தேவும் * அத்தேவரில் மூவராய் நிற்கும் * முதுபுணர்ப்பும் *** யாவராய் நிற்கின்றது எல்லாம் * நெடுமால் என்றோராதார் * கற்கின்றது எல்லாம் கடை.",
      55: "கடை நின்று அமரர் கழல் தொழுது * நாளும் இடை நின்ற * இன்பத்தர் ஆவர் *** புடைநின்ற நீரோத மேனி * நெடுமாலே * நின் அடியை யாரோத வல்லார் அவர்?",
      56: "அவர் இவர் என்று இல்லை * அனங்கவேள் தாதைக்கு * எவரும் எதிர் இல்லை கண்டீர் *** உவரிக் கடல் நஞ்சம் உண்டான் * கடன் என்று * வாணற்கு உடன் நின்று தோற்றான் ஒருங்கு.",
      57: "ஒருங்கிருந்த நல்வினையும் * தீவினையும் ஆவான் * பெருங்குருந்தம் சாய்த்தவனே பேசில் *** மருங்கிருந்த வானவர் தாம் தானவர் தாம் * தாரகை தான் * என் நெஞ்சம் ஆனவர் தாம் அல்லாதது என்?",
      58: "என் நெஞ்ச மேயான் * இருள் நீக்கி எம்பிரான் * மன் அஞ்ச முன்னொரு நாள் மண் அளந்தான் *** என்நெஞ்சம் மேயானை * இல்லா விடை ஏற்றான் * வெவ்வினை தீர்த்து ஆயானுக்கு ஆக்கினேன் அன்பு. ",
      59: "அன்பாவாய் * ஆரமுதம் ஆவாய் * அடியேனுக்கு இன்பாவாய் * எல்லாமும் நீயாவாய் *** பொன்பாவை கேள்வா * கிளரொளி என் கேசவனே * கேடின்றி ஆள்வாய்க்கு அடியேன் நான் ஆள்.",
      60: "ஆட்பார்த்து உழிதருவாய் * கண்டு கொள் என்று * நின் தாள் பார்த்து உழிதருவேன் தன்மையை *** கேட்பார்க்கு அரும்பொருளாய் * நின்ற அரங்கனே * உன்னை விரும்புவதே விள்ளேன் மனம்.",
      61: "மனக்கேதம் சாரா * மதுசூதன் தன்னை * தனக்கே தான் தஞ்சமாக் கொள்ளில் *** எனக்கே தான் இன்று ஒன்றி நின்று உலகையேழ் * ஆணை ஓட்டினான் * சென்று ஒன்றி நின்ற திரு.",
      62: "திருநின்ற பக்கம் * திறவிது என்றோரார் * கருநின்ற கல்லார்க்கு உரைப்பர் *** திருவிருந்த மார்பின் * சிரீதரன் தன் வண்டுஉலவு தண்துழாய் * தார் தன்னைச் சூடித் தரித்து.",
      63: "தரித்திருந்தேன் ஆகவே * தாரா கணப்போர் * விரித்துரைத்த வெந்நாகத்துன்னை *** தெரித்தெழுதி வாசித்தும் கேட்டும் * வணங்கி வழிபட்டும் * பூசித்தும் போக்கினேன் போது.",
      64: "போதான * இட்டிறைஞ்சி ஏத்துமினோ * பொன்மகரக் காதானை * ஆதிப் பெருமானை *** நாதானை நல்லானை நாரணனை * நம் ஏழ் பிறப்பறுக்கும் சொல்லானை * சொல்லுவதே சூது.",
      65: "சூதாவது * என்நெஞ்சத்து எண்ணினேன் * சொல் மாலை மாதாய * மாயவனை மாதவனை *** யாதானும் வல்லவா * சிந்தித்து இருப்பேற்கு * வைகுந்தத்து இல்லையோ சொல்லீர் இடம்?",
      66: "இடமாவது * என்நெஞ்சம் இன்றெல்லாம் * பண்டு படநாகணை * நெடியமாற்கு *** திடமாக வையேன் * மதிசூடி தன்னோடு * அயனை நான் வையேன் ஆட்செய்யேன் வலம்.",
      67: "வலமாக * மாட்டாமை தானாக * வைகல் குலமாக * குற்றம் தானாக *** நலமாக நாரணனை நாபதியை * ஞானப் பெருமானை * சீரணனை ஏத்தும் திறம்.",
      68: "திறம்பேன் மின்கண்டீர் * திருவடிதன் நாமம் * மறந்தும் புறந்தொழா மாந்தர் *** இறைஞ்சியும் சாதுவராய்ப் * போதுமின்கள் என்றான் * நமனும் தன் தூதுவரைக் கூவிச் செவிக்கு.",
      69: "செவிக்கு இன்பம் ஆவதுவும் * செங்கண்மால் நாமம் * புவிக்கும் புவியதுவே கண்டீர் *** கவிக்கு நிறை பொருளாய் * நின்றானை நேர்பட்டேன் * பார்க்கில் மறைப்பொருளும் அத்தனையே தான்.",
      70: "தான் ஒருவனாகித் * தரணி இடந்தெடுத்து * ஏன் ஒருவனாய் எயிற்றில் தாங்கியதும் *** யான் ஒருவன் * இன்றா அறிகின்றேன் அல்லேன் * இருநிலத்தைச் சென்றாங்கு அடிப்படுத்த சேய்.",
      71: "சேயன் அணியன் * சிறியன் மிகப்பெரியன் * ஆயன் துவரைக்கோனாய் நின்ற மாயன் *** அன்று ஓதிய * வாக்கதனைக் கல்லார் * உலகத்தில் ஏதிலராய் மெய்ஞ்ஞான மில்.",
      72: "இல்லறம் இல்லேல் * துறவறமில் என்னும் * சொல் அறம் அல்லனவும் சொல் அல்ல * நல்லறம் ஆவனவும் * நால்வேத மாத்தவமும் * நாரணனே யாவது ஈதன்று என்பாரார்?",
      73: "ஆரே அறிவார் * அனைத்து உலகும் உண்டுமிழ்ந்த * பேராழியான் தன் பெருமையை *** கார்செறிந்த கண்டத்தான் * எண்கண்ணான் காணான் * அவன் வைத்த பண்டைத் தானத்தின் பதி.",
      74: "பதிப்பகைஞர்க்கு ஆற்றாது * பாய்திரை நீர்ப் பாழி * மதித்தடைந்த வாளரவந் தன்னை *** மதித்தவன் தன் வல்லாகத் தேற்றிய * மாமேனி மாயவனை * அல்லாது ஒன்று ஏத்தாது என் நா.",
      75: "நாக்கொண்டு * மானிடம் பாடேன் * நலமாகத் தீக்கொண்ட * செஞ்சடையான் சென்று *** என்றும் பூக்கொண்டு வல்லவாறு * ஏத்த மகிழாத * வைகுந்தச் செல்வனார் சேவடிமேல் பாட்டு.",
      76: "பாட்டும் முறையும் * படுகதையும் பல்பொருளும் * ஈட்டிய தீயும் இருவிசும்பும் *** கேட்ட மனுவும் * சுருதி மறை நான்கும் * மாயன் தனமாயையில் பட்டதற்பு.",
      77: "தற்பென்னைத் * தான் அறியானேலும் * தடங்கடலைக் கற்கொண்டு தூர்த்த கடல்வண்ணன் *** எற்கொண்ட வெவ்வினையும் நீங்க * விலங்கா மனம் வைத்தான் * எவ்வினையும் மாயுமால் கண்டு.",
      78: "கண்டு வணங்கினார்க்கு * என்னாங்கொல் * காமன் உடல் கொண்ட * தவத்தாற்கு உமையுணர்த்த *** வண்டலம்பும் தாரலங்கல் நீள்முடியான் * தன் பெயரே கேட்டிருந்து * அங்கு ஆரலங்கல் ஆனமையால் ஆய்ந்து.",
      79: "ஆய்ந்து கொண்டு * ஆதிப் பெருமானை * அன்பினால் வாய்ந்த * மனத்து இருந்த வல்லார்கள் *** ஏய்ந்த தம் மெய்குந்தமாக * விரும்புவரே * தாமும் தம் வைகுந்தம் காண்பார் விரைந்து.",
      80: "விரைந்தடைமின் மேல் ஒருநாள் * வெள்ளம் பரக்க * கரந்துலகம் காத்து அளித்த கண்ணன் *** பரந்துலகம் * பாடின ஆடின கேட்டு * படுநரகம் வீடின வாசற் கதவு.",
      81: "கதவு மனம் என்றும் * காணலாம் என்றும் * குதையும் வினையாவி தீர்ந்தேன் *** விதையாக நல்தமிழை வித்தி * என் உள்ளத்தை நீ விளைத்தாய் * கற்றமொழி ஆகிக் கலந்து.",
      82: "கலந்தான் என் உள்ளத்துக் * காமவேள் தாதை * நலந்தானும் ஈதொப்பது உண்டே *** அலர்ந்தலர்கள் இட்டேத்தும் * ஈசனும் நான்முகனும் * என்று இவர்கள் விட்டேத்த மாட்டாத வேந்து.",
      83: "வேந்தராய் விண்ணவராய் * விண்ணாகித் தண்ணளியாய் * மாந்தராய் மாதாய் மற்று எல்லாமாய் *** சார்ந்தவர்க்குத் தன்னால் தான் நேமியான் * மால்வண்ணன் தான் கொடுக்கும் * பின்னால் தான் செய்யும் பிதிர்.",
      84: "பிதிரும் மனம் இலேன் * பிஞ்ஞகன் தன்னோடு எதிர்வன் * அவன் எனக்கு நேரான் *** அதிரும் கழற்கால மன்னனையே * கண்ணனையே * நாளும் தொழக் காதல் பூண்டேன் தொழில்.",
      85: "தொழில் எனக்குத் * தொல்லை மால்தன் நாமம் ஏத்த * பொழுது எனக்கு மற்றதுவே போதும் *** கழிசினத்த வல்லாளன் * வானரக்கோன் வாலி மதன் அழித்த * வில்லாளன் நெஞ்சத்து உளன்.",
      86: "உளன் கண்டாய் நன்நெஞ்சே * உத்தமன் என்றும் உளன்கண்டாய் * உள்ளுவார் உள்ளத்து உளன்கண்டாய் *** தன் ஒப்பான் தானாய் * உளன்காண் தமியேற்கும் * என் ஒப்பார்க்கு ஈசன் இமை.",
      87: "இமையப் பெருமலை போல் * இந்திரனார்க்கு இட்ட * சமய விருந்துண்டு ஆர் காப்பார் *** சமயங்கள் கண்டான் அவை காப்பான் * கார்க்கண்டன் நான்முகேனாடு * உண்டான் உலகோடுயிர்.",
      88: "உயிர் கொண்டு உடல் ஒழிய * ஓடும் போதோடி * அயர்வென்ற தீர்ப்பான் பேர் பாடி *** செயல்தீரச் சிந்தித்து * வாழ்வாரே வாழ்வார் * சிறுசமயப் பந்தனையார் வாழ்வேல் பழுது.",
      89: "பழுதாகாது ஒன்று அறிந்தேன் * பாற்கடலான் பாதம் * வழுவா வகை நினைந்து வைகல் தொழுவாரை *** கண்டு இறைஞ்சி வாழ்வார் * கலந்த வினைகெடுத்து * விண்திறந்து வீற்று இருப்பார் மிக்கு.",
      90: "வீற்றிருந்து * விண்ணாள வேண்டுவார் * வேங்கடத்தான் பால்திருந்த வைத்தாரே பல்மலர்கள் *** மேல் திருந்த வாழ்வார் * வருமதி பார்த்து அன்பினராய் * மற்றவர்க்கே தாழ்வாய் இருப்பார் தமர் * ",
      91: "தமராவர் யாவருக்கும் * தாமரை மேலாற்கும் * அமரர்க்கும் ஆடரவத்தார்க்கும் *** அமரர்கள் தாள் தாமரை * மலர்கள் இட்டு இறைஞ்சி * மால் வண்ணன் தாள் தாமரை அடைவோம் என்று * ",
      92: "என்றும் மறந்து அறியேன் * என் நெஞ்சத்தே வைத்து * நின்றும் இருந்தும் நெடுமாலை *** என்றும் திருவிருந்த மார்பன் * சிரீதரனுக்கு ஆளாய் * கருவிருந்த நாள்முதலாக் காப்பு.",
      93: "காப்பு மறந்து அறியேன் * கண்ணனே என்று இருப்பன் * ஆப்பு அங்கொழியவும் பல்லுயிர்க்கும் *** ஆக்கை கொடுத்து அளித்த * கோனே குணப்பரனே * உன்னை விடத்துணியார் மெய்தெளிந்தார் தாம்.",
      94: "மெய்தெளிந்தார் என் செய்யார் * வேறானார் நீறாக * கை தெளிந்து காட்டிக் களப்படுத்து *** பைதெளிந்த பாம்பின் அணையாய் * அருளாய் அடியேற்கு * வேம்பும் கறியாகும் என்று.",
      95: "🙏 ஏன்றேன் அடிமை * இழிந்தேன் பிறப்பு இடும்பை * ஆன்றேன் அமரர்க் கமராமை *** ஆன்றேன் கடன் நாடும் மண்ணாடும் * கைவிட்டு * மேலை இடநாடு காண இனி.",
      96: "🙏 இனி அறிந்தேன் * ஈசற்கும் நான்முகற்கும் தெய்வம் * இனி அறிந்தேன்  எம்பெருமான் உன்னை *** இனி அறிந்தேன் காரணன் நீ கற்றவை நீ * கற்பவை நீ * நற்கிரிசை நாரணன் நீ நன்கு அறிந்தேன் நான்."
    }
  };

  // Nondestructive runtime merging engine
  for (const key in text_bundle_ta) {
    window.MARKER_DATABASE[key] = window.MARKER_DATABASE[key] || [];
    for (const p in text_bundle_ta[key]) {
      const idx = parseInt(p) - 1;
      window.MARKER_DATABASE[key][idx] = window.MARKER_DATABASE[key][idx] || { p: parseInt(p) };
      window.MARKER_DATABASE[key][idx]['text'] = window.MARKER_DATABASE[key][idx]['text'] || {};
      window.MARKER_DATABASE[key][idx]['text']['ta'] = text_bundle_ta[key][p];
    }
  }
};

